<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Startpunkte mit Zielen verbinden</h2><p/>
        <h2><img src="../images/GUID-7266D30B-0250-4132-B1A5-9B59F0212FAD-web.png" alt="Startpunkte mit Zielen verbinden"></h2>
        <hr/>
    <p>Mit &quot;Startpunkten mit Zielen verbinden&quot; wird die Fahrzeit oder Entfernung zwischen Punktepaaren gemessen. Mit diesem Werkzeug k&ouml;nnen geradlinige Entfernungen, Entfernungen in Abh&auml;ngigkeit von einem Reisemodus wie etwa &quot;Gehen&quot; oder &quot;Fahren&quot; oder Fahrzeiten in Abh&auml;ngigkeit von einem Reisemodus erfasst werden. Mit diesem Werkzeug haben Sie folgende M&ouml;glichkeiten:
    </p>
    <p>
        <ul>
            <li>Berechnen Sie die Gesamtstrecke oder -zeit, die Pendler von ihrem Wohnort zum Arbeitsplatz aufwenden m&uuml;ssen.
            </li>
            <li>Ermitteln Sie, wie weit Kunden fahren, um in Ihrem Gesch&auml;ft einzukaufen. Verwenden Sie diese Informationen, um Ihr Marktpotenzial zu definieren, insbesondere bei der gezielten Ausrichtung von Werbekampagnen oder der Auswahl neuer Gesch&auml;ftsstandorte.
            </li>
            <li>Berechnen Sie die erwarteten Reisekilometer f&uuml;r Ihre Fahrzeugflotte.  F&uuml;hren Sie anschlie&szlig;end das Werkzeug &quot;Zusammenfassen (innerhalb)&quot; aus, um die Kilometerzahl nach Bundesland oder anderen Regionen zu erfassen.
            </li>
        </ul>
        
    </p>
    <p>Auf der Basis der angegebenen Start- und Endpunkte erstellt das Werkzeug einen Layer mit Routenlinien und Messwerten zwischen den zugeordneten Startpunkten und Zielen. 
    </p>
    <p>Wenn die Option  <b>Aktuelle Kartenausdehnung verwenden</b> aktiviert ist, werden nur die Features in der Analyse ber&uuml;cksichtigt, die in der aktuellen Kartenausdehnung sichtbar sind.  Wenn diese Option deaktiviert ist, werden alle Features im Eingabe-Layer ber&uuml;cksichtigt, auch diejenigen, die sich au&szlig;erhalb der aktuellen Kartenausdehnung befinden.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="originsLayer">
        <div><h2>Punkt-Layer ausw채hlen, der die urspr체nglichen Positionen darstellt</h2></div>
        <hr/>
        <div>
            <p>Den Punkt-Layer ausw&auml;hlen, der den bzw. die Startpunkte darstellt.  Das Werkzeug unterst&uuml;tzt bis zu  5.000 Startpunkte und  5.000 Ziele. </p>
            <p>Wenn Sie einen Layer mit genau einem Startpunkt ausw&auml;hlen, wird er mit allen Zielen verbunden.
            </p>
            <p>Neben einem Layer aus Ihrer Karte k&ouml;nnen Sie auch die Option  <b>Analyse-Layer ausw&auml;hlen</b> unten in der Dropdown-Liste ausw&auml;hlen. Mit dieser Option &ouml;ffnen Sie eine Galerie, in der Sie zu Datasets aus verschiedenen Quellen navigieren und diese f&uuml;r Ihre Analysen ausw&auml;hlen k&ouml;nnen. 
            </p>
        </div>
    </div>
    <div id="destinationsLayer">
        <div><h2>Ziel-Layer ausw채hlen</h2></div>
        <hr/>
        <div>
            <p>W&auml;hlen Sie den Layer mit dem bzw. den Zielen aus, mit denen die Startpunkte verbunden sein sollen. Das Werkzeug unterst&uuml;tzt bis zu  5.000 Startpunkte und  5.000 Ziele. </p>
            <p>Wenn Sie einen Layer mit genau einem Ziel ausw&auml;hlen, werden alle Startpunkte mit diesem Ziel verbunden. 
            </p>
            <p>Wenn ein Startpunkt und viele Ziele vorhanden sind, verbindet das Werkzeug den Startpunkt mit jedem Ziel.
            </p>
            <p>Neben einem Layer aus Ihrer Karte k&ouml;nnen Sie auch die Option  <b>Analyse-Layer ausw&auml;hlen</b> unten in der Dropdown-Liste ausw&auml;hlen. Mit dieser Option &ouml;ffnen Sie eine Galerie, in der Sie zu Datasets aus verschiedenen Quellen navigieren und diese f&uuml;r Ihre Analysen ausw&auml;hlen k&ouml;nnen. 
            </p>
            <p> Wenn viele Startpunkte und viele Ziele vorhanden sind, ben&ouml;tigen Sie zwei Felder zur Definition der Startpunkt-Ziel-Paare: <b>ID-Feld in Startpunkten</b> und <b>&Uuml;bereinstimmendes ID-Feld in Zielen</b>. Das Werkzeug verbindet die Startpunkt-Ziel-Paare w&auml;hrend der Analyse. Angenommen, Sie verf&uuml;gen &uuml;ber zwei Startpunkte mit den ID-Feldwerten <code>Rosie</code> und <code>Harold</code> und zwei Ziele mit denselben ID-Werten. Der Startpunkt <code>Rosie</code> wird mit dem Ziel <code>Rosie</code> und <code>Harold</code> wird mit <code>Harold</code> verbunden. Es werden keine anderen Verbindungen hergestellt bzw. Messungen durchgef&uuml;hrt.
            </p>
            <p>Wenn die Anzahl an Startpunkten und Zielen gleich ist, m&uuml;ssen die ID-Werte in den einzelnen Layern eindeutig sein. Beispielsweise kann der Wert  <code>Rosie</code> nicht zweimal in einem Ziel-Layer vorhanden sein. Die Werte in den Startpunkt- und Ziel-Layern m&uuml;ssen exakt &uuml;bereinstimmen, um Paare zu erstellen; <code>Harold</code> wird nicht mit dem falsch geschriebenen Wert <code>Harodl</code> verbunden. 
            </p>
            <p>Das Werkzeug unterst&uuml;tzt die Verbindung eines Startpunktes mit mehreren Zielen sowie eines Zieles mit mehreren Startpunkten. Auch in diesem Fall ben&ouml;tigen Sie zwei Felder, in denen die Start-Ziel-Paare beschrieben werden. Jedoch m&uuml;ssen nur in einem der Layer (entweder der Startpunkt- oder Ziel-Layer) eindeutige ID-Werte angegeben werden.
            </p>
        </div>
    </div>
    <div id="measurementType">
        <div><h2>Messen</h2></div>
        <hr/>
        <div>
            
            <p>Legen Sie fest, ob Startpunkte unter Verwendung einer geradlinigen Entfernung oder eines Reisemodus mit Zielen verbunden werden sollen. Die Ausgaberoute folgt Stra&szlig;en und Gehwegen, wobei alle geltenden Verkehrsregeln wie Einbahnstra&szlig;en und unzul&auml;ssige Wendepunkte ber&uuml;cksichtigt werden. Die verf&uuml;gbaren Reisemodi werden vom Administrator Ihrer Organisation bestimmt.  
            </p>
            <p>Bei Auswahl von  <b>Fahrzeit</b>, <b>Fahrzeit auf Landstra&szlig;en</b> oder <b>Lkw-Fahrzeit</b> werden Optionen zum Messen der Fahrzeit bereitgestellt.
                <ul>
                    <li>
                        <p>Deaktivieren Sie  <b>Verkehrsdaten verwenden</b>, um die schnellsten Routen basierend auf festgelegten Geschwindigkeiten zu suchen.
                        </p>
                        <p>Deaktivieren Sie diese Option, wenn Sie eine allgemeine Fahrzeitmessung und nicht etwa ein Ergebnis w&uuml;nschen, das anhand einer sich st&auml;ndig &auml;ndernden Verkehrslage f&uuml;r eine bestimmte Abfahrtzeit berechnet wird.
                        </p>
                    </li>
                    <li>
                        <p>Aktivieren Sie die Option  <b>Verkehrsdaten verwenden</b>, um die schnellsten Routen basierend auf einer angegebenen Startzeit und sich &auml;ndernden Verkehrsbedingungen zu suchen. Wenn Sie au&szlig;erdem die Option <b>Live-Verkehrsdaten</b> ausw&auml;hlen, wird die Abfahrtzeit von den Startpunkten auf die aktuelle Uhrzeit festgelegt und aktuelle und vorhergesagte Fahrgeschwindigkeiten werden von Sensoren und Feeds referenziert, um die Routen zu erstellen. Die vorhergesagten Fahrgeschwindigkeiten werden berechnet, indem Geschwindigkeitsdaten des Live-Verkehrs und aktuelle Ereignisse wie das Wetter referenziert werden. Fahrgeschwindigkeiten werden f&uuml;r die n&auml;chsten 12 Stunden vorhergesagt, damit Sie die Abfahrtzeit mit dem Schieberegler auf bis zu  12 Stunden im Voraus einstellen k&ouml;nnen. </p>
                        <p>Verwenden Sie diese Einstellungen, um die Fahrzeiten zu ermitteln, wenn Sie zum aktuellen Zeitpunkt, in einer Stunde ab dem aktuellen Zeitpunkt usw. abfahren.
                        </p>
                    </li>
                    <li>
                        <p>Wenn Sie die Option  <b>Verkehrsdaten verwenden</b> aktivieren und <b>Verkehrsdaten auf Grundlage von normalen Bedingungen f&uuml;r</b> einen Tag und eine Uhrzeit ausw&auml;hlen, findet das Werkzeug die schnellsten Routen basierend auf historischen Durchschnittsgeschwindigkeiten f&uuml;r jedes 5-Minuten-Intervall &uuml;ber eine normale Woche hinweg. Die Ergebnisse umfassen Verkehrsdaten, lassen jedoch den Einfluss aktueller Verkehrssituationen und -ereignisse au&szlig;er Acht, die erheblich von der Norm abweichen k&ouml;nnen.
                        </p>
                        <p>Sie k&ouml;nnen diese Einstellungen f&uuml;r historische Verkehrsdaten verwenden, um beispielsweise folgende Frage zu stellen: Wie lange dauert es im Allgemeinen, diese Ziele zu erreichen, wenn an einem Mittwoch um 11:30 Uhr losgefahren wird?
                        </p>
                        <p>Die festgelegte Zeit bezieht sich auf die Zeitzone, in der sich die Startpunkte befinden. Wenn Sie die Uhrzeit also auf 8:00 Uhr festlegen und &uuml;ber zwei Startpunkte verf&uuml;gen, einen in New York und den anderen in Los Angeles, werden die Routen f&uuml;r die Abfahrtzeit von 8:00 Uhr Eastern Time bzw. 8:00 Uhr Pacific Time erstellt.
                        </p>
                    </li>
                </ul>
                
            </p>
            <p>Beachten Sie, dass Zeit vergeht und Verkehrslagen sich &auml;ndern, w&auml;hrend sich ein Fahrzeug vom Startpunkt wegbewegt. Das Werkzeug &quot;Startpunkte mit Zielen verbinden&quot; ber&uuml;cksichtigt diese Unterschiede, wenn Sie die Option  <b>Verkehrsdaten verwenden</b> aktivieren. Allerdings unterst&uuml;tzen nicht alle Regionen Verkehrsdaten. 
Klicken Sie in dem Werkzeug auf den Link <b>Verf&uuml;gbarkeit anzeigen</b>, um zu ermitteln, ob dies f&uuml;r Ihr Einzugsgebiet zutrifft.
            </p>
            <p>F&uuml;r die  <b>Lkw-Fahrzeit</b> k&ouml;nnen dynamische, auf den Verkehrsbedingungen basierende Reisegeschwindigkeiten bis maximal zur gesetzlichen H&ouml;chstgeschwindigkeit f&uuml;r Lkw zugrunde gelegt werden. Wenn beispielsweise die dynamische Geschwindigkeit f&uuml;r eine Stra&szlig;e auf Grundlage der Live-Verkehrsdaten bei 100&nbsp;km/h liegt, die zul&auml;ssige H&ouml;chstgeschwindigkeit f&uuml;r Lkw auf dieser Stra&szlig;e jedoch 80&nbsp;km/h betr&auml;gt, werden in der Berechnung f&uuml;r diese Stra&szlig;e 80&nbsp;km/h zugrunde gelegt.
            </p>
        </div>
    </div>
    <div id="barrier_layers">
        <div><h2>Barriere-Layer ausw채hlen</h2></div>
        <hr/>
        <div>
            <p> Mindestens ein Feature, das als vor&uuml;bergehende Einschr&auml;nkung (also Barriere) bei der Fahrt auf den zugrunde liegenden Stra&szlig;en fungiert Sie k&ouml;nnen die Barrieren anhand von Punkt-, Linien- oder Polygon-Features angeben.
            </p>
            <p>Eine Punkt-Barriere kann zum Modellieren eines umgefallenen Baumes, eines Unfalls, einer herabh&auml;ngenden Stromleitung oder eines beliebigen anderen Objekts, das den Verkehr an einer bestimmten Position auf der Stra&szlig;e blockiert, verwendet werden. Die Fahrt auf der Stra&szlig;e ist zul&auml;ssig, jedoch nicht die Fahrt durch die Barriere. Sie k&ouml;nnen bis zu 250&nbsp;Features, die als Punkt-Barrieren fungieren, hinzuf&uuml;gen.
            </p>
            <p>Eine Linien-Barriere unterbindet den Verkehr an allen Punkten, an denen die Barriere Stra&szlig;en schneidet. Mit einer Linien-Barriere kann beispielsweise eine Parade oder Demonstration modelliert werden, die den Verkehr &uuml;ber mehrere Stra&szlig;enz&uuml;ge hinweg blockiert. Wenn die Anzahl der Stra&szlig;en-Features, die sich mit allen Linien-Barrieren schneiden, 500 &uuml;berschreitet, gibt das Werkzeug einen Fehler zur&uuml;ck
            </p>
            <p>Eine Polygon-Barriere unterbindet den Verkehr an allen Punkten, an denen das Polygon Stra&szlig;en schneidet. Dieser Barrierentyp wird beispielsweise verwendet, um &uuml;berflutete Bereiche des Stra&szlig;ennetzes zu modellieren und den Stra&szlig;enverkehr in diesen Bereichen zu sperren. Wenn die Anzahl der Stra&szlig;en-Features, die sich mit allen Polygon-Barrieren schneiden, 2000 &uuml;berschreitet, gibt das Werkzeug einen Fehler zur&uuml;ck
            </p>
        </div>
    </div>
    <div id="routeShape">
        <div><h2>Routen-Shape</h2></div>
        <hr/>
        <div>
            <p>W&auml;hlen Sie f&uuml;r die Route das Shape aus, anhand dessen die einzelnen Startpunkte bei der Verwendung eines Reisemodus mit dem Ziel verbunden werden:
            </p>
            <ul>
                <li> <b>Entlang von Stra&szlig;en</b>: Das Shape basiert auf dem zugrunde liegenden Stra&szlig;ennetz. Diese Option eignet sich optimal f&uuml;r die Erstellung von Routen zwischen Startpunkten und Zielen.
                </li>
                <li> <b>Gerade Linie</b>: Das Shape entspricht einer geraden Linie, die das Start-Ziel-Paar verbindet. Diese Option eignet sich optimal f&uuml;r die Erstellung von Netzdiagrammen oder Desire-Lines (z.&nbsp;B. um darzustellen, welche Filialen Kunden aufsuchen).
                </li>
            </ul>
            
            <p>Die beste Route zwischen einem Startpunkt und dessen Ziel wird unabh&auml;ngig vom ausgew&auml;hlten Shape stets auf Basis des Reisemodus berechnet.
            </p>
        </div>
    </div>
    <div id="outputLayer">
        <div><h2>Name des Ergebnis-Layers</h2></div>
        <hr/>
        <div>
            <p>Der Name des Feature-Layers, der in  <b>Eigene Inhalte</b> erstellt und der Karte hinzugef&uuml;gt wird. Wenn der Feature-Layer bereits vorhanden ist, werden Sie aufgefordert, einen anderen Namen einzugeben. Der Feature-Layer enth&auml;lt einen Layer f&uuml;r jedes der folgenden Elemente: Routen, nicht zugewiesene Startpunkte und nicht zugewiesene Zielpunkte, wenn einige Startpunkte nicht mit ihren Zielpunkten verbunden werden k&ouml;nnen.
            </p>
            <p>Wenn Sie  <b>Routen-Layer einbeziehen</b> ausw&auml;hlen, wird jede Route des Ergebnisses auch als Routen-Layer gespeichert. Ein Routen-Layer umfasst alle Informationen einer bestimmten Route wie zum Beispiel die Stopps, die der Route zugewiesen sind, oder die Wegbeschreibungen. Das Erstellen von Routen-Layern ist n&uuml;tzlich, wenn Sie die einzelnen Routen f&uuml;r andere Mitglieder in Ihrer Organisation freigeben oder wenn Sie die Routen mithilfe der Schaltfl&auml;che <b>Wegbeschreibung</b> im Map Viewer weiter bearbeiten m&ouml;chten. F&uuml;r die Namen der Routen-Layer wird der Name des angegebenen Feature-Layers als Pr&auml;fix verwendet. Dazu hinzugef&uuml;gt wird der Routenname, der bei der Analyse generiert wurde, um einen eindeutigen Namen f&uuml;r jeden Routen-Layer zu erstellen.
            </p>
            <p>Die maximale Anzahl von Routen-Layern, die erstellt werden k&ouml;nnen, betr&auml;gt  1.000. Wenn das Ergebnis mehr als  1.000 Routen enth&auml;lt und  <b>Routen-Layer einbeziehen</b> aktiviert ist, erstellt das Werkzeug lediglich den Ausgabe-Feature-Service.
            </p>
            <p>&Uuml;ber das Dropdown-Men&uuml;  <b>Ergebnis speichern in</b> k&ouml;nnen Sie den Namen eines Ordners in <b>Eigene Inhalte</b> angeben, um darin den Feature-Layer und die ggf. erstellten Routen-Layer zu speichern.
            </p>
        </div>
    </div>
</div>
</html>
