<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Objekte mit Deep Learning ermitteln</h2><p/>
        <h2><img src="../images/GUID-EE76A33E-0B8F-48EE-94F8-782FAD241D72-web.png" alt="Objekte mit Deep Learning ermitteln"></h2>
        <hr/>
    <p>Dieses Werkzeug f&uuml;hrt ein trainiertes Deep-Learning-Modell auf einem Eingabe-Raster zur Erstellung einer Feature-Class aus, die die gefundenen Objekte enth&auml;lt. Bei den Features kann es sich um Rahmen oder Polygone um die gefundenen Objekte oder um Punkte im Mittelpunkt der Objekte handeln.
    </p>
    <p>Wenn die Option  <b>Aktuelle Kartenausdehnung verwenden</b> aktiviert ist, wird nur die Raster-Fl&auml;che analysiert, die in der aktuellen Kartenausdehnung sichtbar ist. Wenn diese Option deaktiviert ist, wird auch dann das gesamte Raster analysiert, wenn es sich au&szlig;erhalb der aktuellen Kartenausdehnung befindet.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputRaster">
        <div><h2>Bild für die Ermittlung von Objekten auswählen</h2></div>
        <hr/>
        <div>
            <p>Das Eingabebild f&uuml;r die Ermittlung von Objekten.
            </p> 
        </div>
    </div>
    <div id="model">
        <div><h2>Deep-Learning-Modell für die Ermittlung von Objekten auswählen</h2></div>
        <hr/>
        <div>
            <p>Das Eingabe-Deep-Learning-Paketelement ( <code>.dlpk</code>).
            </p>
            <p>Das Deep-Learning-Paket besteht aus der JSON-Datei mit der Esri Modelldefinition ( <code>.emd</code>), der bin&auml;ren Datei des Deep-Learning-Modells und optional aus der zu verwendenden Python-Raster-Funktion.
            </p>
        </div>
    </div>
    <div id="modelArguments">
        <div><h2>Argumente für das Deep-Learning-Modell angeben</h2></div>
        <hr/>
        <div>
            <p>Die Funktionsargumente werden in der Python-Raster-Funktionsklasse definiert, die vom Eingabemodell referenziert wird. Hier geben Sie zus&auml;tzliche Deep-Learning-Parameter und Argumente f&uuml;r Experimente und Verfeinerungen wie den Konfidenzschwellenwert zur Anpassung der Empfindlichkeit an.
            </p>
            <p>Die Namen der Argumente werden vom Werkzeug durch Lesen des Python-Moduls im Raster-Analyse-Server ausgef&uuml;llt.
            </p>
        </div>
    </div>
    <div id="runNMS">
        <div><h2>Doppelte Features aus der Ausgabe entfernen (optional)</h2></div>
        <hr/>
        <div>
            <p>F&uuml;hrt die nicht maximale Unterdr&uuml;ckung durch, wenn doppelte Objekte erkannt werden und das doppelte Feature mit einem niedrigeren Konfidenzwert entfernt wird. 
                <ul>
                    <li>Deaktiviert: Alle erkannten Objekte sind in der Ausgabe-Feature-Class enthalten. Dies ist die Standardeinstellung.
                        

                    </li>
                    <li>Aktiviert: Entfernt doppelte Objekte, die erkannt werden.
                        

                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="confidenceScoreField">
        <div><h2>Feld für die Konfidenzpunktzahl</h2></div>
        <hr/>
        <div>
            <p>Das Feld im Feature-Service, das die Konfidenzpunktzahlen enth&auml;lt, die von der Objekterkennungsmethode als Ausgabe verwendet werden.
            </p>
            <p>Dieser Parameter wird ben&ouml;tigt, wenn Sie den Parameter  <b>Nicht-Maxima-Unterdr&uuml;ckung</b> aktivieren.
            </p>
        </div>
    </div>
    <div id="classValueField">
        <div><h2>Klassenwertefeld</h2></div>
        <hr/>
        <div>
            <p>Das Klassenwertefeld im Ausgabe-Feature-Service. Wenn dieses Feld nicht festgelegt wird, verwendet das Werkzeug die Standard-Klassenwertefelder  <i>Classvalue</i> und <i>Value</i>. Wenn diese Felder nicht vorhanden sind, werden alle Features wie eine Objektklasse behandelt.
            </p>
        </div>
    </div>
    <div id="maxOverlapRatio">
        <div><h2>Maximale Überlappungsrate</h2></div>
        <hr/>
        <div>
            <p>Die maximale &Uuml;berlappungsrate f&uuml;r zwei &uuml;berlappende Features, die als Verh&auml;ltnis von Schnittfl&auml;che zu Vereinigungsfl&auml;che definiert ist. Die Standardeinstellung ist 0.
            </p>
        </div>
    </div>
    <div id="outputObjects">
        <div><h2>Name des Ergebnis-Layers</h2></div>
        <hr/>
        <div>
            <p>Der Name des Layers, der in  <b>Eigene Inhalte</b> erstellt und der Karte hinzugef&uuml;gt wird. Der Standardname basiert auf dem Werkzeugnamen und dem Namen des Eingabe-Layers. Wenn der Layer bereits vorhanden ist, werden Sie aufgefordert, einen anderen Namen einzugeben.
            </p>
            <p>Sie k&ouml;nnen den Namen eines Ordners in  <b>Eigene Inhalte</b> angeben, in dem das Ergebnis &uuml;ber das Dropdown-Feld <b>Ergebnis speichern in</b> gespeichert wird.
            </p>
        </div>
    </div>
</div>
</html>
