<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Grenzen zusammenführen</h2><p/>
        <h2><img src="../images/GUID-7B5F69B0-3625-404F-8B52-2B562766C0BB-web.png" alt="Grenzen zusammenf&uuml;hren"></h2>
        <hr/>
    <p>Fl&auml;chen, die sich &uuml;berlappen oder eine gemeinsame Grenze bzw. einen gemeinsamen Attributwert aufweisen, werden zu einer Fl&auml;che zusammengef&uuml;hrt.
    </p>
    <p>Durch Angabe eines Feldes k&ouml;nnen Sie steuern, welche Grenzen zusammengef&uuml;hrt werden. Wenn Sie beispielsweise &uuml;ber einen Landkreis-Layer verf&uuml;gen und jeder Landkreis das Attribut  <pre>State_Name</pre> aufweist, k&ouml;nnen Sie Grenzen anhand des Attributs <pre>State_Name</pre> zusammenf&uuml;hren. Landkreise werden zusammengef&uuml;hrt, wenn sie den gleichen Wert f&uuml;r <pre>State_Name</pre> haben. Das Resultat ist ein Layer mit Bundeslandgrenzen.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Flächen-Layer auswählen, deren Grenzen aufgelöst werden</h2></div>
        <hr/>
        <div>
            <p>Der Layer, der Fl&auml;chen-Features enth&auml;lt, die zusammengef&uuml;hrt werden. 
            </p>
            <p>Sie k&ouml;nnen nicht nur einen Layer aus der Karte ausw&auml;hlen, sondern auch unten in der Dropdown-Liste die Option  <b>Analyse-Layer ausw&auml;hlen</b> ausw&auml;hlen, um zu Ihren Inhalten f&uuml;r ein Big-Data-Dateifreigabe-Dataset bzw. -Feature-Layer zu navigieren.
            </p>
        </div>
    </div>
    <div id="dissolveFields">
        <div><h2>Zusammenführungsmethode auswählen</h2></div>
        <hr/>
        <div>
            <p>Gibt die zum Zusammenf&uuml;hren der Felder verwendete Methode an.
            </p>
            <p>Sie k&ouml;nnen eine dieser beiden Methoden ausw&auml;hlen, um Fl&auml;chen-Features zusammenzuf&uuml;hren:
                <ul>
                    <li> <b>&Uuml;berlappende oder benachbarte Fl&auml;chen</b>: Mindestens zwei Fl&auml;chen, deren Grenzen sich &uuml;berlappen, werden zu einer Fl&auml;che zusammengef&uuml;hrt. Au&szlig;erdem werden benachbarte Fl&auml;chen (d.&nbsp;h. sie haben eine gemeinsame Grenze) zu einer Fl&auml;che zusammengef&uuml;hrt.
                    </li>
                    <li> <b>Fl&auml;chen mit dem gleichen Feldwert</b>: Mindestens zwei Fl&auml;chen werden zu einer Fl&auml;che zusammengef&uuml;hrt, wenn sie den gleichen Feldwert aufweisen.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="multipart">
        <div><h2>Multipart-Features erstellen</h2></div>
        <hr/>
        <div>
            <p>Multipart ist eine Darstellung eines Ortes oder Objekts, der bzw. das aus mehreren Teilen besteht, jedoch als ein Feature definiert ist, da ein Satz von Attributen referenziert wird. Bei einem Layer mit Bundesstaaten kann beispielsweise Hawaii als Multipart-Feature betrachtet werden, da dessen separate geometrischen Teile als ein Bundesstaat klassifiziert werden.
            </p>
            <p> <b>Multipart-Features erstellen</b> stellt zwei Optionen zur Verf&uuml;gung:
                <ul>
                    <li>True (aktiviert): Der Ausgabeservice kann Multipart-Features enthalten.
                    </li>
                    <li>False (deaktiviert): Der Ausgabeservice enth&auml;lt nur Singlepart-Features, und f&uuml;r jeden Teil werden jeweils einzelne Features erstellt. Dies ist die Standardeinstellung.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="summaryFields">
        <div><h2>Statistiken hinzufügen (optional)</h2></div>
        <hr/>
        <div>
            <p>Wenn Fl&auml;chen zusammengef&uuml;hrt werden, k&ouml;nnen Sie deren Attributwerte mit aussagekr&auml;ftigen Statistiken zusammenfassen.  Wenn Sie beispielsweise die Grenze zwischen Landkreisen auf Grundlage von  <pre>State_Name</pre> aufl&ouml;sen und jeder Landkreis &uuml;ber ein <i>Population</i>-Feld verf&uuml;gt, k&ouml;nnen Sie die Summe der <pre>Population</pre> f&uuml;r das Bundesland berechnen.
            </p>
            <p> Sie k&ouml;nnen f&uuml;r Features, die zusammengefasst wurden, Statistiken berechnen.F&uuml;r numerische Felder sind folgende Berechnungen m&ouml;glich:
                <ul>
                    <li>Anzahl: Berechnet die Anzahl der Nicht-NULL-Werte.Sie kann f&uuml;r numerische Felder oder Zeichenfolgen verwendet werden. Die Anzahl von [NULL, 0, 2] betr&auml;gt 2.
                    </li>
                    <li>Summe: Die Summe der numerischen Werte in einem Feld. Die Summe von [NULL, NULL, 3] betr&auml;gt 3.
                    </li>
                    <li>Mittelwert: Der Mittelwert der numerischen Werte. Der Mittelwert von [0, 2, NULL] betr&auml;gt 1.
                    </li>
                    <li>Min: Der Minimalwert eines numerischen Feldes. Der Minimalwert von [0, 2, NULL] betr&auml;gt 0. 
                    </li>
                    <li>Max: Der Maximalwert eines numerischen Feldes. Der Maximalwert von [0, 2, NULL] betr&auml;gt 2.
                    </li>
                    <li>Bereich: Der Bereich eines numerischen Feldes. Dieser wird durch die Subtraktion der Minimalwerte vom Maximalwert berechnet. Der Bereich von [0, NULL, 1] lautet 1. Der Bereich von [NULL, 4] lautet 0.
                    </li>
                    <li>Varianz: Die Varianz eines numerischen Feldes in einer Spur. Die Varianz von [1] betr&auml;gt Null. Die Varianz von [NULL, 1,0,1,1] betr&auml;gt 0,25.
                    </li>
                    <li>Standardabweichung: Die Standardabweichung eines numerischen Feldes. Die Standardabweichung von [1] ist Null. Die Standardabweichung von [NULL, 1,0,1,1] ist 0,5. 
                    </li>
                </ul>
                
            </p>
            <p>F&uuml;r Zeichenfolgenfelder sind folgende Berechnungen m&ouml;glich:
                <ul>
                    <li>Anzahl: Die Anzahl der Nicht-NULL-Werte.
                    </li>
                    <li>Beliebig: Diese Statistik ist eine auf dem Zufallsprinzip basierende Stichprobe eines Zeichenfolgenwertes im angegebenen Feld.
                    </li>
                </ul>
                Alle Statistiken werden f&uuml;r Nicht-NULL-Werte berechnet. Der resultierende Layer enth&auml;lt ein neues Feld f&uuml;r jede berechnete Statistik. Jede Anzahl von Statistiken kann durch Auswahl eines Attributs und einer Statistik ausgew&auml;hlt werden. 
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Name des Ergebnis-Layers</h2></div>
        <hr/>
        <div>
            <p> Der Name des Layers, der erstellt wird.  Wenn Sie in einen ArcGIS Data Store schreiben, werden Ihre Ergebnisse in  <b>Eigene Inhalte</b> gespeichert und der Karte hinzugef&uuml;gt. Wenn Sie in eine Big-Data-Dateifreigabe schreiben, werden Ihre Ergebnisse in der Big-Data-Dateifreigabe gespeichert und  ihrem Manifest hinzugef&uuml;gt. Sie werden nicht der Karte hinzugef&uuml;gt. Der Standardname basiert auf dem Werkzeugnamen und dem Namen des Eingabe-Layers. Wenn der Layer bereits vorhanden ist, kann das Werkzeug nicht ausgef&uuml;hrt werden.
            </p>
            <p>Wenn Sie &uuml;ber das Dropdown-Feld  <b>Ergebnis speichern in</b> in ArcGIS Data Store (Big Data Store vom Typ &quot;relational&quot; oder &quot;spatiotemporal&quot;) schreiben, k&ouml;nnen Sie den Namen eines Ordners in  <b>Eigene Inhalte</b> angeben, in dem das Ergebnis gespeichert wird.
            </p>
        </div>
    </div>
</div>
</html>
