<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Layer anreichern</h2><p/>
        <h2><img src="../images/GUID-5B2D9742-AFD2-4054-8D05-ED6A80EDAF4D-web.png" alt="Layer anreichern"></h2>
        <hr/>
    <p>Mit diesem Werkzeug werden Daten angereichert, indem Fakten zu Personen, Orten und Unternehmen in der Umgebung Ihrer Datenpositionen abgerufen werden. Auf diese Weise lassen sich Fragestellungen zu Standorten kl&auml;ren, die nicht allein anhand von Karten beantwortet werden k&ouml;nnen. Beispiel: Welche Menschen leben hier? Welche Aktivit&auml;ten bevorzugen die Menschen in diesem Gebiet? Welche Gewohnheiten und Lebensweisen haben sie? Welche Arten von Unternehmen befinden sich in diesem Gebiet?
    </p>
    <p>Das Ergebnis ist ein neuer Layer mit allen demografischen und geographischen Informationen aus angegebenen Datensammlungen. Diese Informationen werden der Tabelle als Felder hinzugef&uuml;gt.
    </p>
    <p>Wenn die Option  <b>Aktuelle Kartenausdehnung verwenden</b> aktiviert ist, werden nur die Features im Eingabe-Layer angereichert, die in der aktuellen Kartenausdehnung sichtbar sind.  Wenn diese Option deaktiviert ist, werden alle Features im Eingabe-Layer angereichert, auch diejenigen, die sich au&szlig;erhalb der aktuellen Kartenausdehnung befinden.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Layer auswählen, der mit neuen Daten angereichert werden soll</h2></div>
        <hr/>
        <div>
            <p>Der Punkt-, Linien- oder Fl&auml;chen-Layer, der mit neuen Attributdaten angereichert wird. 
            </p>
            <p>Neben einem Layer aus Ihrer Karte k&ouml;nnen Sie auch die Option  <b>Analyse-Layer ausw&auml;hlen</b> unten in der Dropdown-Liste ausw&auml;hlen. Mit dieser Option &ouml;ffnen Sie eine Galerie, in der Sie zu Datasets aus verschiedenen Quellen navigieren und diese f&uuml;r Ihre Analysen ausw&auml;hlen k&ouml;nnen. 
            </p>
        </div>
    </div>
    <div id="DataCollection">
        <div><h2>Anreicherungsvariablen</h2></div>
        <hr/>
        <div>
            
            <p>Klicken Sie auf  <b>Variablen ausw&auml;hlen</b>, um den <b>Daten-Browser</b> zu &ouml;ffnen.  Mit dem <b>Daten-Browser</b>  k&ouml;nnen Sie Anreicherungsvariablen finden und einzeln oder in Gruppen ausw&auml;hlen.
            </p>
            <p>Eine Region wird automatisch auf Grundlage Ihrer Daten ausgew&auml;hlt. Sie k&ouml;nnen eine andere Region ausw&auml;hlen, wenn Ihre Daten mehr als ein Land abdecken. 
            </p>
            <p>Die Anreicherungsvariablen sind in Gruppen geordnet, um gezielt darauf zugreifen zu k&ouml;nnen. Wenn Sie eine Kategorie ausw&auml;hlen, zeigt der Browser einige der am h&auml;ufigsten verwendeten Anreicherungsvariablen in dieser Gruppe an. Unter  <b>Suchvorgang fortsetzen</b> werden au&szlig;erdem Kategorien innerhalb der Sammlung angezeigt. Sie k&ouml;nnen in jeder Kategorie vollst&auml;ndige Unterkategorien ausw&auml;hlen oder eine Unterkategorie durchsuchen und einzelne Anreicherungsvariablen ausw&auml;hlen. Sie haben au&szlig;erdem die M&ouml;glichkeit, bestimmte Variablen innerhalb einer Kategorie &uuml;ber das Suchfeld zu suchen.
            </p>
            <p>Wenn Sie Variablen ausw&auml;hlen, die in die Anreicherung einbezogen werden sollen, werden sie dem Warenkorb hinzugef&uuml;gt, der sich in der Ecke des  <b>Daten-Browsers</b> befindet. Anhand dieses Warenkorbs k&ouml;nnen Sie die Anzahl der ausgew&auml;hlten Variablen nachverfolgen.
            </p>
            <p>Jede ausgew&auml;hlte Variable wird dem Ergebnis-Layer als Feld hinzugef&uuml;gt.
            </p> 
        </div>
    </div>
    <div id="BufferOption">
        <div><h2>Anzureichernde Flächen definieren</h2></div>
        <hr/>
        <div>
            <p>Definieren Sie die Fl&auml;che um Ihre Eingabepunkte oder Linien herum, die angereichert werden, indem Sie entweder eine geradlinige Entfernung oder einen ausgew&auml;hlten Reisemodus verwenden. Geben Sie f&uuml;r eine geradlinige Entfernung einen Wert von maximal 1609 Kilometer (1000 Meilen) ein. Reisemodi k&ouml;nnen nur dann verwendet werden, wenn Ihr Eingabe-Layer Punkte enth&auml;lt. Die verf&uuml;gbaren Reisemodi werden vom Administrator Ihrer Organisation bestimmt. Wenn Sie einen der Reisemodi verwenden, werden die Messungen entlang Stra&szlig;en und Gehwegen vorgenommen, wobei alle geltenden Verkehrsregeln wie Einbahnstra&szlig;en, unzul&auml;ssige Wendepunkte usw. ber&uuml;cksichtigt werden. Nachdem Sie den Modus und Messwert ausgew&auml;hlt haben, geben Sie eine Dauer oder Entfernung von maximal 5 Stunden (300 Minuten) oder 482 Kilometer (300 Meilen) ein.
            </p>
            <p>Wenn  <b>Ergebnis als umgebende Fl&auml;chen zur&uuml;ckgeben</b> aktiviert ist, werden Fl&auml;chen-Features entsprechend der Definition durch die oben aufgef&uuml;hrten Zeit- oder Entfernungswerte als Ergebnis zur&uuml;ckgegeben.  Wenn die Option deaktiviert ist, werden Punkt-Features als Ergebnis zur&uuml;ckgegeben.
            </p>
        </div>
    </div>
    <div id="OutputName">
        <div><h2>Name des Ergebnis-Layers</h2></div>
        <hr/>
        <div>
            <p>Dies ist der Name des Layers, der in  <b>Eigene Inhalte</b> erstellt und der Karte hinzugef&uuml;gt wird.  Der Standardname basiert auf dem Werkzeugnamen und dem Namen des Eingabe-Layers. Wenn der Layer-Name bereits vorhanden ist, werden Sie dazu aufgefordert, einen anderen Namen einzugeben.
            </p>
            <p>&Uuml;ber das Dropdown-Men&uuml;  <b>Ergebnis speichern in</b> k&ouml;nnen Sie den Namen eines Ordners in <b>Eigene Inhalte</b> angeben, in dem das Ergebnis gespeichert werden soll.
            </p>
        </div>
    </div>
</div>
</html>
