<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Zusammenfassen (innerhalb)</h2><p/>
        <h2><img src="../images/GUID-9B12DB3F-AA7B-41EB-87C6-D2DEC3D52DA9-web.png" alt="Zusammenfassen (innerhalb)"></h2>
        <hr/>
    <p>Dieses Werkzeug findet Features (und Teile von Features), die sich innerhalb der Grenzen von Fl&auml;chen im ersten Eingabe-Layer befinden.  
        <ul>
            <li>Ermitteln Sie anhand eines Layers mit Grenzen von Abflussgebieten und eines Layers mit Grenzen von Landnutzungsfl&auml;chen die Gesamtlandwirtschaftsfl&auml;che des Landnutzungstyps f&uuml;r jedes Abflussgebiet. 
            </li>
            <li>Fassen Sie anhand eines Flurst&uuml;cks-Layers in einem Landkreis und eines Stadtgrenzen-Layers den durchschnittlichen Grundst&uuml;ckswert unbebauter Flurst&uuml;cke je Stadt zusammen.
            </li>
        </ul>
        
    </p>
    <p>Wenn die Option  <b>Aktuelle Kartenausdehnung verwenden</b> aktiviert ist, werden nur die Features im Eingabe-Layer und dem zusammenfassenden Layer analysiert, die in der aktuellen Kartenausdehnung sichtbar sind.  Wenn diese Option deaktiviert ist, werden auch dann alle Features im Eingabe- und im zusammenfassenden Layer analysiert, wenn sie sich au&szlig;erhalb der aktuellen Ausdehnung befinden.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="sumWithinLayer">
        <div><h2>Flächen-Layer auswählen, um andere Features innerhalb dessen Grenzen zusammenzufassen</h2></div>
        <hr/>
        <div>
            <p>Der Fl&auml;chen-Layer, anhand dessen Features zusammengefasst werden, die innerhalb seiner Grenzen liegen. Sie k&ouml;nnen innerhalb eines Polygon-Layer zusammenfassen, den Sie bereitstellen, oder innerhalb von Rechteck- oder Hexagonabschnitten, die beim Ausf&uuml;hren des Werkzeugs erstellt werden.  Beim Erstellen von Abschnitten geben die f&uuml;r  <b>Quadrat</b> angegebene Zahl und die Einheiten die H&ouml;he und Breite des Quadrats. Bei <b>Hexagon</b> wird anhand der angegebenen Zahl und der Einheiten die Entfernung zwischen parallelen Seiten festgelegt.
            </p>
            <p>F&uuml;r Analysen, die  <b>Quadrat</b>- oder <b>hexagonale</b> Abschnitte verwenden, ist ein projiziertes Koordinatensystem erforderlich. Sie k&ouml;nnen das <b>Verarbeitungskoordinatensystem</b> in <b>Analyseumgebungen</b> festlegen. Wenn das Verarbeitungskoordinatensystem nicht auf ein projiziertes Koordinatensystem festgelegt ist, werden Sie aufgefordert, es festzulegen, wenn Sie die <b>Analyse ausf&uuml;hren</b> .
            </p>
            <p>Sie k&ouml;nnen nicht nur einen Layer aus der Karte ausw&auml;hlen, sondern auch unten in der Dropdown-Liste die Option  <b>Analyse-Layer ausw&auml;hlen</b> ausw&auml;hlen, um zu Ihren Inhalten f&uuml;r ein Big-Data-Dateifreigabe-Dataset bzw. -Feature-Layer zu navigieren.
            </p>
        </div>
    </div>
    <div id="summaryLayer">
        <div><h2>Einen Layer für die Zusammenfassung auswählen</h2></div>
        <hr/>
        <div>
            <p>Features in diesem Layer, die innerhalb der Grenzen der Features im oben genannten Eingabe-Layer oder in den oben genannten Abschnitten liegen, werden zusammengefasst. 
            </p>
            <p>Sie k&ouml;nnen nicht nur einen Layer aus der Karte ausw&auml;hlen, sondern auch unten in der Dropdown-Liste die Option  <b>Analyse-Layer ausw&auml;hlen</b> ausw&auml;hlen, um zu Ihren Inhalten f&uuml;r ein Big-Data-Dateifreigabe-Dataset bzw. -Feature-Layer zu navigieren.
            </p>
        </div>
    </div>
    <div id="inputBins">
        <div><h2>Eine Entfernung zum Erstellen von Abschnitten auswählen, in die aggregiert werden soll</h2></div>
        <hr/>
        <div>
            <p>Die zum Generieren von Abschnitten verwendete Entfernung.  
            </p>
            <p>Es muss entweder eine  <b>Abschnittsgr&ouml;&szlig;e</b> f&uuml;r Abschnitte oder ein <b>Fl&auml;chen-Layer</b> festgelegt werden.
            </p>
        </div>
    </div>
    <div id="timeSlicing">
        <div><h2>Mit Zeitintervallen aggregieren (optional)</h2></div>
        <hr/>
        <div>
            <p>Wenn Zeiteigenschaften f&uuml;r den Eingabepunkt-Layer aktiviert und vom Typ &quot;Sofort&quot; sind, kann die Analyse mittels Zeitintervallen durchgef&uuml;hrt werden. Bei Verwendung von Zeit k&ouml;nnen drei Parameter festgelegt werden:
                <ul>
                    <li> <b>Zeitschrittintervall</b>
                    </li>
                    <li> <b>Wie h&auml;ufig der Zeitschritt wiederholt werden soll</b>
                    </li>
                    <li> <b>Zeit zum Ausrichten von Zeitschritten</b>
                    </li>
                </ul>
                
            </p>
            <p>Wenn Sie beispielsweise &uuml;ber Daten verf&uuml;gen, die ein Jahr darstellen, und Sie f&uuml;r diese eine Analyse mit w&ouml;chentlichen Schritten durchf&uuml;hren m&ouml;chten, setzen Sie  <b>Zeitschrittintervall</b> auf <code>1 Woche</code>. 
            </p>
            <p>Wenn Sie beispielsweise &uuml;ber Daten verf&uuml;gen, die ein Jahr darstellen, und Sie f&uuml;r diese eine Analyse mit der ersten Woche des Monats durchf&uuml;hren m&ouml;chten, setzen Sie  <b>Zeitschrittintervall</b> auf <code>1 Woche</code>, <b>Wie h&auml;ufig der Zeitschritt wiederholt werden soll</b> auf <code>1 Monat</code> und <b>Zeit zum Ausrichten von Zeitschritten</b> auf den <code>1. Januar 12:00 Uhr</code>.
            </p>
        </div>
    </div>
    <div id="timeInterval">
        <div><h2>Zeitintervall, in das aggregiert werden soll</h2></div>
        <hr/>
        <div>
            <p>Das Zeitintervall f&uuml;r die Erzeugung von Zeitschritten. Das  <b>Zeitschrittintervall</b> kann entweder allein oder zusammen mit dem Parameter <b>Wie h&auml;ufig der Zeitschritt wiederholt werden soll</b> oder <b>Zeit zum Ausrichten von Zeitschritten</b> verwendet werden.
            </p>
            <p>Wenn Sie beispielsweise Zeitschritte erstellen m&ouml;chten, die jeden Montag von 9:00 bis 10:00 Uhr stattfinden, setzen Sie  <b>Zeitschrittintervall</b> auf <code>1 Stunde</code>, <b>Wie h&auml;ufig der Zeitschritt wiederholt werden soll</b> auf <code>1 Woche</code> und <b>Zeit zum Ausrichten von Zeitschritten</b> auf <code>9:00:00 Uhr am Montag</code>.
            </p>
        </div>
    </div>
    <div id="timeStep">
        <div><h2>Zeitschritt, in den aggregiert werden soll</h2></div>
        <hr/>
        <div>
            <p> Der Schritt zum Berechnen eines Zeitschritts. <b>Wie h&auml;ufig der Zeitschritt wiederholt werden soll</b> kann allein oder zusammen mit <b>Zeitschrittintervall</b>, mit <b>Bezugszeit</b> oder sowohl mit <b>Zeitschrittintervall</b> als auch mit <b>Zeit zum Ausrichten von Zeitschritten</b> verwendet werden.
            </p>
            <p> Wenn Sie beispielsweise Zeitschritte erstellen m&ouml;chten, die jeden Montag von 9:00 bis 10:00 Uhr stattfinden, setzen Sie <b>Zeitschrittintervall</b> auf <code>1 Stunde</code>, <b>Wie h&auml;ufig der Zeitschritt wiederholt werden soll</b> auf <code>1 Woche</code> und <b>Zeit zum Ausrichten von Zeitschritten</b> auf <code>9:00:00 Uhr am Montag</code>.
            </p>
        </div>
    </div>
    <div id="timeReference">
        <div><h2>Bezugszeit zum Ausrichten der Zeitintervalle</h2></div>
        <hr/>
        <div>
            <p>Das Datum und die Uhrzeit zum Ausrichten der Zeitintervalle. Die Zeitintervalle beginnen bzw. enden an diesem Zeitpunkt. Wenn keine Bezugszeit ausgew&auml;hlt wurde, werden die Intervalle am 1. Januar 1970 ausgerichtet. 
            </p>
            <p> Wenn Sie beispielsweise Zeitschritte erstellen m&ouml;chten, die jeden Montag von 9:00 bis 10:00 Uhr stattfinden, setzen Sie <b>Zeitschrittintervall</b> auf <code>1 Stunde</code>, <b>Wie h&auml;ufig der Zeitschritt wiederholt werden soll</b> auf <code>1 Woche</code> und <b>Zeit zum Ausrichten von Zeitschritten</b> auf <code>9:00:00 Uhr am Montag</code>.
            </p>
        </div>
    </div>
    <div id="summaryFields">
        <div><h2>Statistiken hinzufügen (optional)</h2></div>
        <hr/>
        <div>
            <p> Sie k&ouml;nnen f&uuml;r Features, die zusammengefasst wurden, Statistiken berechnen.F&uuml;r numerische Felder sind folgende Berechnungen m&ouml;glich:
                <ul>
                    <li>Anzahl: Berechnet die Anzahl der Nicht-NULL-Werte.Sie kann f&uuml;r numerische Felder oder Zeichenfolgen verwendet werden. Die Anzahl von [NULL, 0, 2] betr&auml;gt 2.
                    </li>
                    <li>Summe: Die Summe der numerischen Werte in einem Feld. Die Summe von [NULL, NULL, 3] betr&auml;gt 3.
                    </li>
                    <li>Mittelwert: Der Mittelwert der numerischen Werte. Der Mittelwert von [0, 2, NULL] betr&auml;gt 1.
                    </li>
                    <li>Min: Der Minimalwert eines numerischen Feldes. Der Minimalwert von [0, 2, NULL] betr&auml;gt 0. 
                    </li>
                    <li>Max: Der Maximalwert eines numerischen Feldes. Der Maximalwert von [0, 2, NULL] betr&auml;gt 2.
                    </li>
                    <li>Bereich: Der Bereich eines numerischen Feldes. Dieser wird durch die Subtraktion der Minimalwerte vom Maximalwert berechnet. Der Bereich von [0, NULL, 1] lautet 1. Der Bereich von [NULL, 4] lautet 0.
                    </li>
                    <li>Varianz: Die Varianz eines numerischen Feldes in einer Spur. Die Varianz von [1] betr&auml;gt Null. Die Varianz von [NULL, 1,0,1,1] betr&auml;gt 0,25.
                    </li>
                    <li>Standardabweichung: Die Standardabweichung eines numerischen Feldes. Die Standardabweichung von [1] ist Null. Die Standardabweichung von [NULL, 1,0,1,1] ist 0,5. 
                    </li>
                </ul>
                
            </p>
            <p>F&uuml;r Zeichenfolgenfelder sind folgende Berechnungen m&ouml;glich:
                <ul>
                    <li>Anzahl: Die Anzahl der Nicht-NULL-Werte.
                    </li>
                    <li>Beliebig: Diese Statistik ist eine auf dem Zufallsprinzip basierende Stichprobe eines Zeichenfolgenwertes im angegebenen Feld.
                    </li>
                </ul>
                Alle Statistiken werden f&uuml;r Nicht-NULL-Werte berechnet. Der resultierende Layer enth&auml;lt ein neues Feld f&uuml;r jede berechnete Statistik. Jede Anzahl von Statistiken kann durch Auswahl eines Attributs und einer Statistik ausgew&auml;hlt werden. 
            </p>
            <p>Neben diesen Statistiken werden proportionale Statistiken f&uuml;r alle numerischen Felder berechnet:
                <ul>
                    <li>Anzahl: Die Anzahl jedes Feldes wird mit dem Anteil des Zusammenfassungs-Layers innerhalb der Polygone multipliziert. 
                    </li>
                    <li>Summe: Die Summe der gewichteten Werte in jedem Feld. Die Gewichtung entspricht dem Anteil des Zusammenfassungs-Layers innerhalb der Polygone.
                    </li>
                    <li>Mittelwert: Der gewichtete Mittelwert der Werte in jedem Feld. Die Gewichtung entspricht dem Anteil des Zusammenfassungs-Layers innerhalb der Polygone.
                    </li>
                    <li>Min.: Der Minimalwert der gewichteten Werte in jedem Feld. Die Gewichtung entspricht dem Anteil des Zusammenfassungs-Layers innerhalb der Polygone.
                    </li>
                    <li>Max.: Der Maximalwert der gewichteten Werte in jedem Feld. Die Gewichtung entspricht dem Anteil des Zusammenfassungs-Layers innerhalb der Polygone.
                    </li>
                    <li>Bereich: Die Differenz zwischen den Maximal- und Minimalwerten.
                    </li>
                </ul>
                
            </p>
            <p>Je nach Feature-Typen, die Sie zusammenfassen, wird die Gesamtzahl nahe gelegener Punkte, die Gesamtl&auml;nge der Linien oder die Gesamtfl&auml;che berechnet.
            </p>
        </div>
    </div>
    <div id="GroupBy">
        <div><h2>Feld für die Gruppierung auswählen</h2></div>
        <hr/>
        <div>
            <p>Dies ist ein Attribut der  <b>Feldstatistik</b>-Features, mit denen Statistiken f&uuml;r jeden eindeutigen Attributwert getrennt berechnet werden k&ouml;nnen. Angenommen der erste Eingabe-Layer enth&auml;lt beispielsweise Stadtgrenzen und die Zusammenfassungs-Features sind Flurst&uuml;cke.  Eines der Attribute der Flurst&uuml;cke lautet <i>Status</i> und enth&auml;lt zwei Werte: &quot;VACANT&quot; und &quot;OCCUPIED&quot;. Um die Gesamtfl&auml;che unbebauter bzw. bebauter Flurst&uuml;cke innerhalb der Grenzen einer Stadt zu berechnen, verwenden Sie <i>Status</i> als Attribut, nach dem gruppiert werden soll. Die Statistik f&uuml;r jede Gruppe und die Anzahl der Features innerhalb jeder Fl&auml;chengrenze werden im Pop-up des Ergebnis-Layers angezeigt.
            </p>
        </div>
    </div>
    <div id="MinorityMajority">
        <div><h2>Minderheit, Mehrheit hinzufügen</h2></div>
        <hr/>
        <div>
            <p>Dieses Kontrollk&auml;stchen ist aktiviert, wenn Sie ein Feld ausw&auml;hlen, nach dem gruppiert werden soll. Wenn Sie ermitteln m&ouml;chten, welche Attributwerte in jeder Gruppe die Minderheit (geringste Dominanz) oder die Mehrheit (h&ouml;chste Dominanz) innerhalb jeder Grenze des ersten Eingabe-Layers ausmachen, w&auml;hlen Sie  <b>Minderheit, Mehrheit hinzuf&uuml;gen</b> aus.   Wenn Sie die Option <b>Minderheit, Mehrheit hinzuf&uuml;gen</b> ausw&auml;hlen, werden dem Ergebnis-Layer zwei neue Felder hinzugef&uuml;gt.   Wenn Sie <b>Prozents&auml;tze hinzuf&uuml;gen</b> ausw&auml;hlen, werden dem Ergebnis-Layer zwei weitere Felder hinzugef&uuml;gt, die die Prozents&auml;tze der Minderheits- und Mehrheitsattributwerte in jeder Gruppe enthalten.
            </p>
            <ul>
                <li>Wenn Sie Punkte zusammenfassen, werden Minderheits- und Mehrheitswerte basierend auf der Anzahl der Punkte innerhalb jedes Grenzbereichs im Eingabe-Fl&auml;chen-Layer berechnet.  
                </li>
                <li>Wenn Sie Linien zusammenfassen, werden Minderheits- und Mehrheitswerte basierend auf der L&auml;nge der Linien innerhalb jedes Grenzbereichs im Eingabe-Fl&auml;chen-Layer berechnet.  
                </li>
                <li>Wenn Sie Fl&auml;chen zusammenfassen, werden Minderheits- und Mehrheitswerte basierend auf den Fl&auml;chen innerhalb jedes Grenzbereichs im Eingabe-Fl&auml;chen-Layer berechnet.  
                </li>
            </ul>
            
        </div>
    </div>
    <div id="PercentShape">
        <div><h2>Prozentsätze hinzufügen</h2></div>
        <hr/>
        <div>
            <p>Dieses Kontrollk&auml;stchen ist aktiviert, wenn Sie ein Feld ausw&auml;hlen, nach dem gruppiert werden soll. W&auml;hlen Sie  <b>Prozents&auml;tze hinzuf&uuml;gen</b> aus, wenn Sie den Prozentsatz jedes Attributwertes innerhalb einer Gruppe ermitteln m&ouml;chten.  Der Ergebnistabelle wird ein neues Feld hinzugef&uuml;gt, das die Prozents&auml;tze jedes Attributwertes innerhalb jeder Gruppe enth&auml;lt. Wenn die Option <b>Minderheit, Mehrheit hinzuf&uuml;gen</b> ebenfalls aktiviert ist, werden dem Ergebnis-Layer zwei weitere Felder hinzugef&uuml;gt, die die Prozents&auml;tze der Minderheits- und Mehrheitsattributwerte in jeder Gruppe enthalten.
            </p>
        </div>
    </div>
    <div id="dataStore">
        <div><h2>Data Store auswählen</h2></div>
        <hr/>
        <div>
            <p>GeoAnalytics-Ergebnisse werden in einem Data Store gespeichert und als Feature-Layer in  Portal for ArcGIS dargestellt. In den meisten F&auml;llen sollten Ergebnisse im Data Store vom Typ &quot;spatiotemporal&quot; gespeichert werden, was gleichzeitig die Standardeinstellung ist. Manchmal empfiehlt es sich auch, Ergebnisse im Data Store vom Typ &quot;relational&quot; zu speichern. Die folgenden Gr&uuml;nde sprechen daf&uuml;r, die Ergebnisse im Data Store vom Typ &quot;relational&quot; zu speichern: 
                <ul>
                    <li>Sie k&ouml;nnen die Ergebnisse in portal&uuml;bergreifender Zusammenarbeit verwenden.
                    </li>
                    <li>Sie sind in der Lage, Synchronisierungsfunktionen mit Ihren Ergebnissen zu aktivieren.
                    </li>
                </ul>
                
            </p>
            <p>Der Einsatz des Data Stores vom Typ &quot;relational&quot; wird nicht empfohlen, wenn abzusehen ist, dass Ihre GeoAnalytics-Ergebnisse weiter zunehmen. Nutzen Sie in diesem Fall die Funktionen des Big Data Store vom Typ &quot;spatiotemporal&quot; zur Verwaltung von gro&szlig;en Datenmengen.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Name des Ergebnis-Layers</h2></div>
        <hr/>
        <div>
            <p> Der Name des Layers, der erstellt wird.  Wenn Sie in einen ArcGIS Data Store schreiben, werden Ihre Ergebnisse in  <b>Eigene Inhalte</b> gespeichert und der Karte hinzugef&uuml;gt. Wenn Sie in eine Big-Data-Dateifreigabe schreiben, werden Ihre Ergebnisse in der Big-Data-Dateifreigabe gespeichert und  ihrem Manifest hinzugef&uuml;gt. Sie werden nicht der Karte hinzugef&uuml;gt. Der Standardname basiert auf dem Werkzeugnamen und dem Namen des Eingabe-Layers. Wenn der Layer bereits vorhanden ist, kann das Werkzeug nicht ausgef&uuml;hrt werden.
            </p>
            <p>Wenn Sie &uuml;ber das Dropdown-Feld  <b>Ergebnis speichern in</b> in ArcGIS Data Store (Big Data Store vom Typ &quot;relational&quot; oder &quot;spatiotemporal&quot;) schreiben, k&ouml;nnen Sie den Namen eines Ordners in  <b>Eigene Inhalte</b> angeben, in dem das Ergebnis gespeichert wird.
            </p>
        </div>
    </div>
</div>
</html>
