<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Crear zonas de influencia</h2><p/>
        <h2><img src="../images/GUID-6E648C49-37F9-4673-82D5-DB646921A828-web.png" alt="Crear zonas de influencia"></h2>
        <hr/>
    <p>Una zona de influencia es un &aacute;rea que cubre una distancia dada desde una entidad de puntos, de l&iacute;nea o de &aacute;rea. 
    </p>
    <p>Las zonas de influencia se suelen utilizar para crear &aacute;reas que se pueden analizar m&aacute;s a fondo usando otras herramientas. Por ejemplo, si la pregunta es &iquest;Qu&eacute; edificios est&aacute;n a 1 kil&oacute;metro del colegio?, la respuesta se puede encontrar creando una zona de influencia de 1 kil&oacute;metro en torno al colegio y superponiendo la zona de influencia con la capa que contiene las superficies de los edificios. El resultado final es una capa con los edificios que se encuentran a menos de 1 kil&oacute;metro del colegio.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Elegir una capa a la que aplicar la zona de influencia</h2></div>
        <hr/>
        <div>
            <p>Las entidades de puntos, l&iacute;neas o &aacute;reas que se deben incluir en la zona de influencia. Las capas de entrada deben estar en un sistema de coordenadas proyectado o la referencia espacial de procesamiento debe estar definida en un sistema de coordenadas proyectado mediante  <b>Entornos de an&aacute;lisis</b>.
            </p>
            <p>Adem&aacute;s de elegir una capa en el mapa, puede elegir  <b>Elegir capa de an&aacute;lisis</b> en la parte inferior de la lista desplegable para examinar el contenido del dataset o la capa de entidades de un recurso compartido de archivos de big data.
            </p>
        </div>
    </div>
    <div id="bufferType">
        <div><h2>Seleccionar el tipo de zona de influencia que se va a aplicar</h2></div>
        <hr/>
        <div>
            <p>Existen tres formas de especificar el tama&ntilde;o de la zona de influencia para las entidades de entrada: 
                <ul>
                    <li>Especificar una distancia aplicable a todas las entidades.
                    </li>
                    <li>Especificar un campo de la capa de entrada que contenga el valor de distancia. Puede utilizar un campo de cadena de caracteres o un campo num&eacute;rico. Si no se ha definido una unidad lineal, se utilizar&aacute;n las unidades de la referencia espacial. Si va a utilizar un sistema de coordenadas geogr&aacute;ficas, se asumir&aacute; que el campo sin unidades est&aacute; expresado en metros. 
                    </li>
                    <li>Crear una expresi&oacute;n con varios campos y operadores matem&aacute;ticos. Por ejemplo, para crear una zona de influencia 10 veces el valor de un campo denominado  <i>wind_speed</i>, agregue la expresi&oacute;n <i>$feature[&quot;wind_speed&quot;] x 10</i>.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="method">
        <div><h2>Seleccionar el método de zona de influencia</h2></div>
        <hr/>
        <div>
            <p>Puede optar por utilizar un m&eacute;todo  <b>Planar</b> o un m&eacute;todo <b>Geod&eacute;sico</b>. El m&eacute;todo <b>Planar</b> puede ser m&aacute;s r&aacute;pido y es apropiado para an&aacute;lisis locales sobre datos proyectados. El m&eacute;todo <b>Geod&eacute;sico</b> es apropiado para &aacute;reas grandes y para cualquier sistema de coordenadas geogr&aacute;ficas.
            </p>
        </div>
    </div>
    <div id="dissolveOption">
        <div><h2>Seleccionar el tipo de método de disolución</h2></div>
        <hr/>
        <div>
            <p>Opciones para especificar el m&eacute;todo de disolver.   Si ha elegido un m&eacute;todo de disolver, tendr&aacute; la opci&oacute;n de crear &aacute;reas multiparte o de una sola parte y podr&aacute; calcular estad&iacute;sticas bas&aacute;ndose en los campos proporcionados.
                <ul>
                    <li> <b>Todo</b>: se disolver&aacute;n todas las entidades. Si se permiten entidades multiparte, todas las entidades se disolver&aacute;n en una &uacute;nica entidad. Si no se permiten entidades multiparte, se disolver&aacute;n las entidades adyacentes o superpuestas.
                    </li>
                    <li> <b>Campos</b>: se disolver&aacute;n las entidades que compartan el mismo campo o combinaci&oacute;n de campos que se haya especificado. Si se permiten entidades multiparte, todas las entidades con el mismo campo se disolver&aacute;n en una &uacute;nica entidad. Si no se permiten entidades multiparte, se disolver&aacute;n las entidades adyacentes o superpuestas con el mismo valor de campo.
                    </li>
                    <li> <b>Nada</b>: no se disolver&aacute; ninguna entidad.  Esta es la opci&oacute;n predeterminada.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="multipart">
        <div><h2>Permitir entidades multiparte</h2></div>
        <hr/>
        <div>
            <p>Opci&oacute;n que permite especificar si el resultado estar&aacute; compuesto por entidades multiparte o de una sola parte. 

            </p>
            <p>
                <ul>
                    <li>Activado: en los resultados del an&aacute;lisis se incluir&aacute;n entidades multiparte.   
                    </li>
                    <li>Desactivado: en los resultados del an&aacute;lisis se incluir&aacute;n entidades de una sola parte. Es la opci&oacute;n predeterminada.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="summaryFields">
        <div><h2>Agregar estadísticas (opcional)</h2></div>
        <hr/>
        <div>
            <p> Puede calcular estad&iacute;sticas sobre las entidades resumidas. Puede calcular lo siguiente en los campos num&eacute;ricos:
                <ul>
                    <li>Recuento: calcula el n&uacute;mero de valores no nulos. Se puede usar en campos num&eacute;ricos o cadenas de caracteres. El recuento de [nulo, 0, 2] es 2.
                    </li>
                    <li>Suma: la suma de valores num&eacute;ricos en un campo. La suma de [nulo, nulo, 3] es 3.
                    </li>
                    <li>Media: la media de valores num&eacute;ricos. La media de [0, 2, nulo] es 1.
                    </li>
                    <li>M&iacute;n: el valor m&iacute;nimo de un campo num&eacute;rico. El m&iacute;nimo de [0, 2, nulo] es 0. 
                    </li>
                    <li>M&aacute;x: el valor m&aacute;ximo de un campo num&eacute;rico. El m&aacute;ximo de [0, 2, nulo] es 2.
                    </li>
                    <li>Rango: el rango de un campo num&eacute;rico. Se calcula como los valores m&iacute;nimos restados del valor m&aacute;ximo. El rango de [0, nulo, 1] es 1. El rango de [nulo, 4] es 0.
                    </li>
                    <li>Varianza: la varianza de un campo num&eacute;rico en un recorrido. La varianza de [1] es nulo. La varianza de [nulo, 1,0,1,1] es 0,25.
                    </li>
                    <li>Desviaci&oacute;n est&aacute;ndar: la desviaci&oacute;n est&aacute;ndar de un campo num&eacute;rico. La desviaci&oacute;n est&aacute;ndar de [1] es nulo. La desviaci&oacute;n est&aacute;ndar de [nulo, 1,0,1,1] es 0,5. 
                    </li>
                </ul>
                
            </p>
            <p>Puede calcular lo siguiente en los campos de cadena de caracteres:
                <ul>
                    <li>Recuento: el n&uacute;mero de cadenas de caracteres no nulas.
                    </li>
                    <li>Cualquiera: esta estad&iacute;stica es una muestra aleatoria del valor de una cadena de caracteres en el campo especificado.
                    </li>
                </ul>
                Todas las estad&iacute;sticas se calculan sobre valores no nulos. La capa resultante contendr&aacute; un nuevo campo para cada estad&iacute;stica calculada. Se puede agregar cualquier n&uacute;mero de estad&iacute;sticas eligiendo un atributo y una estad&iacute;stica. 
            </p>
        </div>
    </div>
    <div id="dataStore">
        <div><h2>Seleccionar un ArcGIS Data Store en el que guardar los resultados</h2></div>
        <hr/>
        <div>
            <p>Los resultados de GeoAnalytics se almacenan en un data store y se exponen como capa de entidades en  Portal for ArcGIS. En la mayor&iacute;a de los casos, conviene almacenar los resultados en el almac&eacute;n de datos espaciotemporal y este es el predeterminado. En algunos casos, guardar los resultados en el data store relacional es una buena opci&oacute;n. A continuaci&oacute;n, se exponen motivos por los que guardar los resultados en el data store relacional es una buena idea: 
                <ul>
                    <li>Puede usar los resultados en una colaboraci&oacute;n de portal a portal.
                    </li>
                    <li>Puede habilitar capacidades de sincronizaci&oacute;n con sus resultados.
                    </li>
                </ul>
                
            </p>
            <p>Conviene no usar el data store relacional si espera que los resultados de GeoAnalytics aumenten y necesita aprovechar las capacidades del big data store espaciotemporal para manejar grandes cantidades de datos.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nombre de capa de resultados</h2></div>
        <hr/>
        <div>
            <p> El nombre de la capa que se crear&aacute;.  Si escribe en un ArcGIS Data Store, sus resultados se guardar&aacute;n en  <b>Mi contenido</b> y se agregar&aacute;n al mapa. Si escribe en un recurso compartido de archivos de big data, sus resultados se almacenar&aacute;n en el recurso compartido de archivos de big data y se agregar&aacute;n a su manifiesto. No se agregar&aacute;n al mapa. El nombre predeterminado se basa en el nombre de la herramienta y en el nombre de la capa de entrada. Si la capa ya existe, la herramienta fallar&aacute;.
            </p>
            <p>Cuando escriba en  ArcGIS Data Store (big data store espaciotemporal o relacional) con el cuadro desplegable  <b>Guardar el resultado en</b>, puede especificar el nombre de una carpeta de <b>Mi contenido</b> en la que se guardar&aacute; el resultado.
            </p>
        </div>
    </div>
</div>
</html>
