<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Determinar ruta de coste de viaje como polilínea</h2><p/>
        <h2><img src="../images/GUID-9A27DEB7-0276-483C-A12F-3E70D636550D-web.png" alt="Ilustraci&oacute;n de la herramienta Determinar ruta de coste de viaje como polil&iacute;nea"></h2>
        <hr/>
    <p>Esta herramienta calcula la ruta de polil&iacute;nea de m&iacute;nimo coste entre or&iacute;genes y destinos conocidos.
    </p>
    <p>A continuaci&oacute;n se indican algunas aplicaciones de ejemplo:
        <ul>
            <li>Hallar la ruta mejor para una nueva carretera en t&eacute;rminos de costes de construcci&oacute;n.
                

            </li>
            <li>Identificar la ruta que se debe tomar desde varias ubicaciones del &aacute;rea metropolitana (or&iacute;genes) hasta el centro comercial m&aacute;s cercano (destino).
                

            </li>
        </ul>
        
    </p>
    <p>Si se ha activado  <b>Usar extensi&oacute;n de mapa actual</b>, solo se analizar&aacute;n las ubicaciones de las capas de entrada que est&eacute;n visibles en la extensi&oacute;n de mapa actual. Si la opci&oacute;n est&aacute; desactivada, se analizar&aacute;n todas las ubicaciones de ambas capas de entrada, aunque est&eacute;n fuera de la extensi&oacute;n de mapa actual.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputSourceRasterOrFeatures">
        <div><h2>Elegir la capa de origen de entidad o ráster a partir de la cual determinar rutas</h2></div>
        <hr/>
        <div>
            <p>Un servicio de im&aacute;genes o un servicio de entidades que identifica las celdas desde las que se determina la ruta de menor coste para el destino menos costoso.
            </p>
            <p>Si la entrada es un servicio de im&aacute;genes, la entrada consta de celdas con valores v&aacute;lidos (cero es un valor v&aacute;lido) y se debe asignar NoData a las celdas restantes.
            </p>
        </div>
    </div>
    <div id="inputCostRaster">
        <div><h2>Elegir capa ráster de costes de viaje</h2></div>
        <hr/>
        <div>
            <p>R&aacute;ster que define la impedancia o el coste de hacer un movimiento planim&eacute;trico por medio de cada celda.
            </p>
            <p>El valor de cada ubicaci&oacute;n de celda representa la distancia de coste por unidad para moverse a trav&eacute;s de la celda. Cada valor de ubicaci&oacute;n de celda se multiplica por la resoluci&oacute;n de la celda mientras que tambi&eacute;n se compensa por el movimiento diagonal para obtener el coste total de pasar por medio de la celda.
            </p>
            <p>Los valores del r&aacute;ster de coste pueden ser enteros o de punto flotante, pero no pueden ser negativos o cero (no puede tener un coste negativo o cero).
            </p>
        </div>
    </div>
    <div id="inputDestinationRasterOrFeatures">
        <div><h2>Ráster o entidades de destino de entrada</h2></div>
        <hr/>
        <div>
            <p>Una entrada que define los destinos utilizados para calcular tambi&eacute;n la distancia. La capa puede ser un r&aacute;ster o una entidad.
            </p>
            <p>Si la entrada es un servicio de im&aacute;genes, la entrada consta de celdas con valores v&aacute;lidos (cero es un valor v&aacute;lido) y se debe asignar NoData a las celdas restantes.
            </p>
        </div>
    </div>
    <div id="outputPolylineName">
        <div><h2>Nombre de la capa de resultados de polilíneas</h2></div>
        <hr/>
        <div>
            <p>El nombre de la capa que se crear&aacute; en  <b>Mi contenido</b> y que se agregar&aacute; al mapa. El nombre predeterminado se basa en el nombre de la herramienta y en el nombre de la capa de entrada. Si la capa ya existe, se le pedir&aacute; que indique otro nombre.
            </p>
            <p>Puede especificar el nombre de una carpeta de  <b>Mi contenido</b> en la que se guardar&aacute; el resultado con el cuadro desplegable <b>Guardar el resultado en</b>.
            </p>
        </div>
    </div>
    <div id="pathType">
        <div><h2>Elegir el tipo de rutas a determinar</h2></div>
        <hr/>
        <div>
            <p>Define la manera en que se interpretar&aacute;n los valores y las zonas de los datos de destino de entrada en los c&aacute;lculos de la ruta de coste.
            </p>
            <ul>
                <li>Mejor simple: para todas las celdas o ubicaciones de datos de destino de entrada, la ruta de menor coste se deriva de la ubicaci&oacute;n con la m&iacute;nima de las rutas de menor coste a la ubicaci&oacute;n de origen. Esta es la configuraci&oacute;n predeterminada
                    

                </li>
                <li>A cada celda: por cada celda o ubicaci&oacute;n con valores v&aacute;lidos en los datos de destino de entrada, se determina una ruta de menor coste y se guarda en el servicio de entidades de salida. Con esta opci&oacute;n, cada celda de los datos de destino de entrada se trata de forma separada y se determina una ruta de menor coste para cada una desde la celda.
                    

                </li>
                <li>A cada zona: por cada zona en los datos de destino de entrada, se determina una ruta de menor coste y se guarda en el servicio de entidades de salida. Con esta opci&oacute;n, la ruta de menor coste de cada zona comienza en la celda o ubicaci&oacute;n con la ponderaci&oacute;n de coste-distancia m&aacute;s baja de la zona.
                    

                </li>
            </ul>
            
        </div>
    </div>
</div>
</html>
