<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Nueva representación cartográfica de valores</h2><p/>
        <h2><img src="../images/GUID-4006E442-A60B-469A-891D-5ED442F64CB8-web.png" alt="Herramienta Reasignar valores para Portal"></h2>
        <hr/>
    <p>Esta herramienta le permite cambiar o reclasificar los valores de p&iacute;xel de los datos de r&aacute;ster. Los valores de p&iacute;xel se vuelven a asignar especificando un rango de valores de p&iacute;xel para asignarlos a un valor de p&iacute;xel de salida. El valor de p&iacute;xel de salida puede ser un valor v&aacute;lido o un valor NoData, que son p&iacute;xeles que no tienen un valor conocido asociado.
    </p>
    <p>Si se ha activado  <b>Utilizar la extensi&oacute;n de mapa actual</b>, solo se volver&aacute;n a asignar aquellas celdas que est&eacute;n visibles en la extensi&oacute;n de mapa actual. Si la opci&oacute;n est&aacute; desactivada, se procesar&aacute;n todas las celdas del r&aacute;ster, aunque est&eacute;n fuera de la extensi&oacute;n de mapa actual.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Datos de entrada</h2></div>
        <hr/>
        <div>
            <p>Los datos de entrada cuyos valores se volver&aacute;n a asignar.
            </p>
        </div>
    </div>
    <div id="RemapList">
        <div><h2>Nueva representación cartográfica de valores de píxel con valores nuevos</h2></div>
        <hr/>
        <div>
            <p>Puede introducir un rango de valores especificando un valor m&iacute;nimo y m&aacute;ximo y, a continuaci&oacute;n, asignar al rango especificado a un valor de salida o un valor NoData.
            </p>
            <p>Para reasignar un nuevo rango de valores, haga clic en  <b>Agregar</b>; se agregar&aacute; una fila. Haga clic en cada valor para editar la tabla con los rangos y el valor reasignado que necesite. A la hora de especificar rangos de valores, se emplean dos reglas importantes:
                <ul>
                    <li>El valor m&iacute;nimo en el rango es inclusivo y el valor m&aacute;ximo es exclusivo.
                    </li>
                    <li>Las filas de la tabla se procesan de arriba abajo.
                    </li>
                </ul>
                
            </p>
            <p>En la tabla siguiente se muestra que el valor m&iacute;nimo est&aacute; incluido en la salida, mientras que el valor m&aacute;ximo, no.
            </p>
            <table border="1">
            <tr>
                <td>
                    <p>1
                    </p>
                </td>
                <td>
                    <p>10
                    </p>
                </td>
                <td>
                    <p>1-9
                    </p>
                </td>
            </tr>
            <tr>
                <td>
                    <p>10
                    </p>
                </td>
                <td>
                    <p>20
                    </p>
                </td>
                <td>
                    <p>10-19
                    </p>
                </td>
            </tr>
            <tr>
                <td>
                    <p>50
                    </p>
                </td>
                <td>
                    <p>51
                    </p>
                </td>
                <td>
                    <p>50
                    </p>
                </td>
            </tr>
            </table>
            <p>El orden de los rangos especificado en la tabla tambi&eacute;n es importante. La fila superior de la tabla se procesa primero y luego se procesa la fila de abajo. En las dos tablas siguientes se muestra c&oacute;mo los mismos rangos de valores generan resultados diferentes, debido al orden de las filas de la tabla.
            </p> 
            <p>La tabla que aparece a continuaci&oacute;n muestra el valor de salida cuando se ordena num&eacute;ricamente la primera columna:
            </p>
            <table border="1">
            <tr>
                <td>
                    <p>1
                    </p>
                </td>
                <td>
                    <p>15
                    </p>
                </td>
                <td>
                    <p>1-14
                    </p>
                </td>
            </tr>
            <tr>
                <td>
                    <p>10
                    </p>
                </td>
                <td>
                    <p>30
                    </p>
                </td>
                <td>
                    <p>15-29
                    </p>
                </td>
            </tr>
            <tr>
                <td>
                    <p>30
                    </p>
                </td>
                <td>
                    <p>40
                    </p>
                </td>
                <td>
                    <p>30-39
                    </p>
                </td>
            </tr>
            </table>
            <p>La tabla que aparece a continuaci&oacute;n muestra c&oacute;mo una ordenaci&oacute;n distinta de las filas produce diferentes valores de salida:
            </p> 
            <table border="1">
            <tr>
                <td>
                    <p>10
                    </p>
                </td>
                <td>
                    <p>30
                    </p>
                </td>
                <td>
                    <p>10-29
                    </p>
                </td>
            </tr>
            <tr>
                <td>
                    <p>1
                    </p>
                </td>
                <td>
                    <p>15
                    </p>
                </td>
                <td>
                    <p>1-9
                    </p>
                </td>
            </tr>
            <tr>
                <td>
                    <p>30
                    </p>
                </td>
                <td>
                    <p>40
                    </p>
                </td>
                <td>
                    <p>30-39
                    </p>
                </td>
            </tr>
            </table>
            <p>Ambas reglas se utilizan para reordenar los valores. Dado que cada fila se procesa de arriba abajo, estos valores tienen preferencia a la hora de determinar la salida, aunque se utilicen los mismos rangos.
            </p>
        </div>
    </div>
    <div id="OutputLayer">
        <div><h2>Nombre de capa de resultados</h2></div>
        <hr/>
        <div>
            <p>El nombre de la capa que se crear&aacute; en  <b>Mi contenido</b> y que se agregar&aacute; al mapa. El nombre predeterminado se basa en el nombre de la herramienta y en el nombre de la capa de entrada. Si la capa ya existe, se le pedir&aacute; que indique otro nombre.
            </p>
            <p>Puede especificar el nombre de una carpeta de  <b>Mi contenido</b> en la que se guardar&aacute; el resultado con el cuadro desplegable <b>Guardar el resultado en</b>.
            </p>
        </div>
    </div>
</div>
</html>
