<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Arvuta tihedus</h2><p/>
        <h2><img src="../images/GUID-38AD3C19-0400-4E5A-9282-BDE42F2BBFC1-web.png" alt="Arvuta tihedus"></h2>
        <hr/>
    <p>Tiheduse arvutamise t&ouml;&ouml;riist loob punktobjektidest tiheduskaardi, hajutades m&otilde;ned n&auml;htused, mis on esitatud punktide atribuutidena &uuml;le kogu kaardi. Tulemuseks on alade kiht, mis on r&uuml;hmitatud tiheduse alusel.   

    </p>
    <p>Sisendpunkti puhul peaks iga punkt kujutama mingi s&uuml;ndmuse v&otilde;i juhtumi asukohta ja tulemkiht kujutab juhtumite arvu mingi ala kohta. Uue asukoha k&otilde;rgem tihedus t&auml;hendab, et selle asukoha l&auml;heduses on rohkem punkte. Sageli v&otilde;ib tulemkihti pidada tulevaste s&uuml;ndmuste riskipiirkonnaks. Kui sisendpunktid kujutavad n&auml;iteks v&auml;lgul&ouml;&ouml;kide asukohti, v&otilde;ib tulemkihti pidada tulevaste v&auml;lgul&ouml;&ouml;kide riskipiirkonnaks.
    </p>
    <p>Seda t&ouml;&ouml;riista saab kasutada ka j&auml;rgmistel eesm&auml;rkidel:
        <ul>
            <li>Kuritegevuse tihedusega seotud kaartide loomine, et aidata politseil planeerida ressursse k&otilde;rge kuritegevusega paikadesse.
            </li>
            <li>Maakonnas asuvate haiglate tiheduse arvutamine. Tulemkiht n&auml;itab alasid, kus haiglaid on palju ja/v&otilde;i v&auml;he ning seda teavet saab kasutada selleks, et otsustada kuhu uusi haiglaid ehitada.
            </li>
            <li>Metsatulekahjude varasemate asukohtade p&otilde;hjal nende alade tuvastamine, kus metsatulekahju oht on suur.
            </li>
            <li>Suurtest kiirteedest kaugel olevate kogukondade kindlakstegemine, et planeerida uute teede ehitust.
            </li>
        </ul>
        
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Valige punktikiht, mille põhjal tihedus arvutada</h2></div>
        <hr/>
        <div>
            <p>Punktikiht, millel tihedus arvutatakse.
            </p>
            <p>Lisaks kihi valimisele kaardil saate valida ripploendi alumises servas  <b>Vali anal&uuml;&uuml;sikihte</b>, et otsida oma sisust suurandmete failiketta andmestikku v&otilde;i objektikihti.
            </p>
        </div>
    </div>
    <div id="fields">
        <div><h2>Valige tiheduse arvutamiseks üks või mitu välja (valikuline):</h2></div>
        <hr/>
        <div>
            <p>Sisestage v&auml;hemalt &uuml;ks v&auml;li, mis aitab m&auml;&auml;rata iga asukoha juhtumite arvu. Kui Teie punktid kujutavad n&auml;iteks linnu, saate linna rahvaarvu kujutavat v&auml;lja kasutada arvutusv&auml;ljana ning saadav rahvastikutiheduse kiht arvutab suurema rahvaarvuga linnade rahvastikutiheduse.
            </p>
            <p>Tihedus punktide arvu kohta arvutatakse alati. Kui &uuml;htegi v&auml;lja pole valitud, eeldatakse, et iga asukoht kujutab &uuml;hte n&auml;htust.
            </p>
        </div>
    </div>
    <div id="binType">
        <div><h2>Valige salve kuju</h2></div>
        <hr/>
        <div>
            <p>Salvede, millesse punktid on agregeeritud ja mida kasutatakse tiheduse arvutamiseks, kuju.
            </p>
            <p> <b>Ruutsalvede</b> v&otilde;i <b>kuusnurksalvede</b> abil tehtav anal&uuml;&uuml;s n&otilde;uab tasapinnalist ristkoordinaatide s&uuml;steemi. <b>Koordinaats&uuml;steemi t&ouml;&ouml;tlemise</b> saab m&auml;&auml;rata funktsiooniga <b>Anal&uuml;&uuml;sikeskkonnad</b>. Kui koordinaats&uuml;steemi t&ouml;&ouml;tlemine ei ole m&auml;&auml;ratud tasapinnaliseks ristkoordinaatide s&uuml;steemiks, kuvatakse k&auml;su <b>K&auml;ivita anal&uuml;&uuml;s</b> andmisel selle m&auml;&auml;ramist taotlev h&uuml;pikaken.
            </p>
        </div>
    </div>
    <div id="binSizing">
        <div><h2>Vali salve suurus agregeerimise jaoks</h2></div>
        <hr/>
        <div>
            <p>Loodud salvede suurus. Ruudukujulise salve puhul on suurus ruudu k&otilde;rgus. Kuusnurga puhul on suurus kuusnurga k&otilde;rgus (paralleelk&uuml;lgede vahel).
            </p>
        </div>
    </div>
    <div id="weight">
        <div><h2>Valige rakendamiseks tiheduse kaalumine</h2></div>
        <hr/>
        <div>
            <p>Tiheduse arvutamisele rakendatava kaalumise t&uuml;&uuml;p. Valikuid on kaks.
                <ul>
                    <li> <b>&Uuml;htne</b> &ndash; see arvutab suurusj&auml;rgu ala kohta.
                    </li>
                    <li> <b>Kernel</b> &ndash; rakendab kernelfunktsiooni, et sobitada sile koonusjas pind iga punktiga.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="neighborhood">
        <div><h2>Valige naabruse suurus</h2></div>
        <hr/>
        <div>
            <p>Tiheduse arvutamiseks kasutatava ala suurus. Naabruse suurus peab olema suurem kui salve suurus.
            </p>
        </div>
    </div>
    <div id="areaUnits">
        <div><h2>Valige tiheduse väljundüksused</h2></div>
        <hr/>
        <div>
            <p>Tiheduse v&auml;&auml;rtuste soovitud v&auml;ljundi &uuml;hikud. Vaikimisi on m&auml;&auml;ratud ruutkilomeetrid v&otilde;i ruutmiilid, olenevalt teie profiilis m&auml;&auml;ratud vaike&uuml;hikutest. Kui tiheduse v&auml;&auml;rtused on v&auml;ga v&auml;ikesed, saate suuremate v&auml;&auml;rtuste tagastamiseks suurendada pindala&uuml;hikuid (n&auml;iteks ruutmeetrite asemel ruutkilomeetrid). V&auml;&auml;rtused muudavad ainult tulemuse m&otilde;&otilde;tkava.  

            </p>
        </div>
    </div>
    <div id="timeSlicing">
        <div><h2>Arvuta tihedus ajasammude abil (valikuline)</h2></div>
        <hr/>
        <div>
            <p>Kui sisendpunktikihi jaoks on aeg lubatud ja selle t&uuml;&uuml;p on ajahetk, saate kasutada anal&uuml;&uuml;simiseks ajasamme. Aega kasutades saate m&auml;&auml;rata kolm parameetrit.
                <ul>
                    <li> <b>Ajasammude vahemik</b>
                    </li>
                    <li> <b>Ajasammude kordamise sagedus</b>
                    </li>
                    <li> <b>Aeg ajasammude &uuml;hildamiseks</b>
                    </li>
                </ul>
                
            </p>
            <p>Kui teil on n&auml;iteksandmed, mis esindavad aastat ja soovite seda anal&uuml;&uuml;sida , kasutades &uuml;hen&auml;dalasi samme, seadke <b>Ajasammu ajavahemiku</b> v&auml;&auml;rtuseks <code>1 n&auml;dal</code>. 
            </p>
            <p>Kui teil on n&auml;iteks andmed, mis v&auml;ljendavad ajaliselt aastat ja soovite sedaanal&uuml;&uuml;sida , kasutades kuu esimest n&auml;dalat,, seadke <b>Ajasammu intervalliks</b> <code>1 n&auml;dal</code>, <b>Ajasammude kordamise sagedus</b> ajavahemikule <code>1 kuu</code>, ja <b>Ajasammude &uuml;hildamise ajaks</b> <code>1. jaanuar kell 12.00</code>.
            </p>
        </div>
    </div>
    <div id="timeInterval">
        <div><h2>Ajasammude vahemik</h2></div>
        <hr/>
        <div>
            <p>Ajasammude genereerimiseks kasutatav ajavahemik.  <b>Ajasammude vahemikku saab kasutada nii eraldi kui ka koos parameetriga Ajasammude kordamise sagedus v&otilde;i parameetriga Aeg ajasammude &uuml;hildamiseks</b> <b></b> <b></b> .
            </p>
            <p>Kui n&auml;iteks sooviteluua ajasammud, mistoimuvad igal esmasp&auml;eval kell 9.00 kuni 10, seadke <b>Ajasammu ajavahemik</b> <code>1 tunnile</code>, <b>Ajasammude kordamise sagedus</b> <code>1 n&auml;dalale</code> ja <b>Ajasammude &uuml;hildamise aeg</b> <code>kella 9.00:00-ks esmasp&auml;eval</code>.
            </p>
        </div>
    </div>
    <div id="timeStep">
        <div><h2>Ajasammude kordamise sagedus</h2></div>
        <hr/>
        <div>
            <p> Ajasamm, mida kasutatakse ajal&otilde;igu arvutamiseks. Parameetrit <b>Ajasammude kordamise sagedus</b> saab  kasutada eraldi, parameetriga, koos <b>Ajasammude vahemik</b>, <b>koos</b> v&otilde;i koos parameetritega <b>Ajasammude vahemik</b> ja <b>Aeg ajasammude &uuml;hildamiseks</b>.
            </p>
            <p> Kui n&auml;iteks  soovite luua ajasammud, mistoimuvad igal esmasp&auml;eval kell 9.00 kuni 10, seadke <b>Ajasammu ajavahemik</b> <code>1 tunnile</code>, <b>Ajasammude kordamise sagedus</b> <code>1 n&auml;dalale</code> ja <b>Ajasammude &uuml;hildamise aeg</b> <code>kella 9.00:00-ks esmasp&auml;eval</code>.
            </p>
        </div>
    </div>
    <div id="timeReference">
        <div><h2>Aeg ajasammude ühildamiseks:</h2></div>
        <hr/>
        <div>
            <p>Kuup&auml;ev ja kellaaeg, mida kasutatakse ajal&otilde;igu &uuml;hitamiseks. Sellest ajast alustatakse ajasammuga  ajas tagasi liikumist. Juhul kui viiteaega ei valita, &uuml;hildatakse ajasamm 1. jaanuariga 1970. 
            </p>
            <p> Kui n&auml;iteks sooviteluua ajasammud, mis toimuvad igal esmasp&auml;eval kell 9.00 kuni 10, seadke <b>Ajasammu ajavahemik</b> <code>1 tunnile</code>, <b>Ajasammude kordamise sagedus</b> <code>1 n&auml;dalale</code> ja <b>Ajasammude &uuml;hildamise aeg</b> <code>kella 9.00:00-ks esmasp&auml;eval</code>.
            </p>
        </div>
    </div>
    <div id="spatialReference">
        <div><h2>Koordinaatsüsteem (wkid)</h2></div>
        <hr/>
        <div>
            <p>See on ajutine parameeter eelversioonile, et m&auml;&auml;rata t&ouml;&ouml;tlemiseks koordinaats&uuml;steem. Paljud suurandmete&nbsp;t&ouml;&ouml;riistad n&otilde;uavad t&ouml;&ouml;tlemiseks tasapinnalise ristkoordinaatide s&uuml;steemi kasutamist. Vaikimisi kasutab t&ouml;&ouml;riist sisestatud koordinaats&uuml;steemi, aga t&ouml;&ouml;tlemine nurjub, kui kasutatakse geograafilist koordinaats&uuml;steemi. Tasapinnalise ristkoordinaatide s&uuml;steemi m&auml;&auml;ramiseks sisestage WKID. N&auml;iteks  <b>Web Mercator</b> tuleb sisestada v&auml;&auml;rtusena <code>3857</code>.
            </p>
        </div>
    </div>
    <div id="dataStore">
        <div><h2>Valige andmeladu</h2></div>
        <hr/>
        <div>
            <p>GeoAnalyticsi tulemeid k&auml;sitletakse  andmelaos salvedena ning need kuvatakse portaalis   Portal for ArcGIS objektikihtidena. &Uuml;ldjuhul salvestatakse tulemid ajalisruumilisse andmelattu &ndash; see on vaikimisi valitud. M&otilde;nel juhul on , tulemid m&otilde;istlik salvestada relatsioonilisse andmelattu. Allpool on toodud m&otilde;ned p&otilde;hjused, miks oleks soovitatav tulemid   salvestada relatsioonilisse andmelattu: 
                <ul>
                    <li>Tulemeid saateportaaliskasutadaportaali koost&ouml;&ouml;ks.
                    </li>
                    <li>Saate lubada tulemitega s&uuml;nkroniseerimise funktsiooni.
                    </li>
                </ul>
                
            </p>
            <p>Relatsioonilist andmeladu pole otstarbekas kasutada, kui GeoAnalyticsi tulemite arv suureneb. Sel juhul peaksite kasutama suurt ajalisruumilist andmeladu, mis v&otilde;imaldab hallata suurt andmemahtu.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Tulemkihi nimi</h2></div>
        <hr/>
        <div>
            <p> Loodavakihi nimi.  Kui kirjutate andmelattu ArcGIS Data Store, salvestatakse teie tulemused  <b>Minu sisus</b> ja lisatakse kaardile. Kui kirjutate suurandmete failikettale, salvestatakse teie andmed suurandmete failikettale  ja lisatakse  selle manifestifailile. Seda  ei lisata kaardile. Vaikimisi nimi p&otilde;hineb t&ouml;&ouml;riista nimel ja sisendkihi nimel. Kui see kiht on juba olemas, siis t&ouml;&ouml;tlemine nurjub.
            </p>
            <p>Kui salvestate admelattu   ArcGIS Data Store (relatsioonilisse v&otilde;i ajalisruumilisse andmelattu), kasutades rippmen&uuml;&uuml;d  <b>Salvesta tulemused</b>, saate jaotises <b>Minu sisu</b> m&auml;&auml;rata selle kausta nime, kuhu tulemused salvestatakse.
            </p>
        </div>
    </div>
</div>
</html>
