<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Rikasta kihti</h2><p/>
        <h2><img src="../images/GUID-5B2D9742-AFD2-4054-8D05-ED6A80EDAF4D-web.png" alt="Rikasta kihti"></h2>
        <hr/>
    <p>See t&ouml;&ouml;vahend aitab rikastada teie andmeid, hankides juurde teavet teie l&auml;heduses olevate inimeste, paikade ja ettev&otilde;tete kohta ning v&otilde;imaldab saada t&auml;iendavaid vastuseid k&uuml;simustele, millele vastamine oleks ainult kaardi vahendusel raskendatud. N&auml;ide. Millised inimesed siin piirkonnas elavad? Millega inimesed siin piirkonnas vabal ajal tegelevad? Millised on nende harjumused ja elustiil? Millist t&uuml;&uuml;pi ettev&otilde;tted siin piirkonnas tegutsevad?
    </p>
    <p>Tulemuseks on kiht, mis sisaldab lisaks geograafilisele teabele informatsiooni ka demograafilistest n&auml;itajatest jne. Vastav uus info lisatakse v&auml;ljadena tabelisse.
    </p>
    <p>Kui ruut  <b>Kasuta praegust kaardi ulatust</b> on m&auml;rgitud, rikastatakse ainult neid sisendkihi objekte, mis on kaardil praegu n&auml;htavad.  Kui see ruut pole m&auml;rgitud, rikastatakse k&otilde;iki sisendkihis olevaid objekte ka siis, kui neid pole praegu kaardil n&auml;ha.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Vali uute andmetega rikastatav kiht</h2></div>
        <hr/>
        <div>
            <p>Uute atribuutandmetega rikastatav punkti-, joone- v&otilde;i alakiht. 
            </p>
            <p>Lisaks kaardil asuvale kihile saate valida variandi  <b>Vali anal&uuml;&uuml;sikiht</b>, mille leiate ripploendi allosast. See variant avab galerii, mida saate sirvida ja kus saate erinevatest allikatest valida anal&uuml;&uuml;sil kasutamiseks andmestikke. 
            </p>
        </div>
    </div>
    <div id="DataCollection">
        <div><h2>Rikastamise muutujad</h2></div>
        <hr/>
        <div>
            
            <p>Akna  <b>Andmebrauser</b> avamiseks kl&otilde;psake nuppu <b>Vali muutujad</b>. <b>Andmebrauser</b> aitab teil rikastamise muutujaid otsida ja valida eraldi v&otilde;i kollektsioonidena.
            </p>
            <p>Teie andmete p&otilde;hjal valitakse automaatselt piirkond. Kui teie andmed h&otilde;lmavad rohkem kui &uuml;hte riiki, saate valida m&otilde;ne muu piirkonna. 
            </p>
            <p>Rikastamise muutujad korraldatakse h&otilde;lpsaks juurdep&auml;&auml;suks andmekogude ehk kollektsioonidena. Andmekogu valimisel kuvatakse brauseris m&otilde;ni selle kollektsiooni populaarsem rikastamise muutuja. Jaotises  <b>J&auml;tka sirvimist</b> kuvatakse ka selle kollektsiooni kategooriad. Iga kategooria piires saate valida terveid alamkategooriaid v&otilde;i sirvida alamkategooriat ja valida rikastamise muutujad eraldi. Otsinguv&auml;lja kaudu saate kategooriast ka m&otilde;nda kindlat muutujat otsida.
            </p>
            <p>Rikastamise muutujate valimisel lisatakse need  <b>andmebrauseri</b> nurgas asuvasse ostukorvi. Ostukorvis saate j&auml;lgida valitud muutujate arvu.
            </p>
            <p>Iga valitud muutuja lisatakse tulemkihis v&auml;ljana.
            </p> 
        </div>
    </div>
    <div id="BufferOption">
        <div><h2>M채채ra piirkonnad anal체체siks</h2></div>
        <hr/>
        <div>
            <p>Saate m&auml;&auml;ratleda sisendpunktide v&otilde;i joonte &uuml;mber asuva ala, mida rikastatakse, kasutades selleks kas sirgjoonelist vahemaad v&otilde;i valitud liikumisviisi. Sirgjoonelise vahemaa puhul saate maksimaalse v&auml;&auml;rtusena sisestada 1000 miili (1609 kilomeetrit). Liikumisviise saab kasutada &uuml;ksnes juhul, kui teie sisendkiht sisaldab punkte. Lubatud liikumisviisid m&auml;&auml;rab teie asutuse administraator. Liikumisviisi kasutamisel m&otilde;&otilde;detakse vahemaad piki maanteid v&otilde;i jalgteid ning arvesse v&otilde;etakse kehtivaid reegleid (nt &uuml;hesuunalisi teid, keelatud p&ouml;&ouml;rdeid jne). Kui olete liikumisviisi ja m&otilde;&otilde;du valinud, sisestage kestus v&otilde;i vahemaa, milleks v&otilde;ib maksimaalselt olla 5 tundi (300 minutit) v&otilde;i 300 miili (482,8 kilomeetrit).
            </p>
            <p>Ruudu  <b>Tagasta piiratud alad</b> m&auml;rkimisel tagastatakse &uuml;laltoodud aja v&otilde;i vahemaa kaudu m&auml;&auml;ratletud pindobjektid. Kui ruutu ei m&auml;rgita, tagastatakse punktobjektid.
            </p>
        </div>
    </div>
    <div id="OutputName">
        <div><h2>Tulemkihi nimi</h2></div>
        <hr/>
        <div>
            <p>See on selle kihi nimi, mis luuakse jaotises  <b>Minu sisu</b> ja lisatakse kaardile.  Vaikenimi p&otilde;hineb t&ouml;&ouml;riista nimel ja sisendkihi nimel. Kui samanimeline kiht on juba olemas, palutakse teil sisestada m&otilde;ni muu nimi.
            </p>
            <p>Rippmen&uuml;&uuml;  <b>Salvesta tulemused</b> kaudu saate jaotises <b>Minu sisu</b> m&auml;&auml;rata selle kausta nime, kuhu tulemus salvestatakse.
            </p>
        </div>
    </div>
</div>
</html>
