<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Leia lähim</h2><p/>
        <h2><img src="../images/GUID-150C2484-7459-405A-8835-B4E72CD49738-web.png" alt="Leia l&auml;him"></h2>
        <hr/>
    <p>See t&ouml;&ouml;riist leiab l&auml;himad objektid ning raporteerib ja reastab vahemaad l&auml;hedalasuvate objektideni, L&auml;hima leidmisel v&otilde;ib t&ouml;&ouml;riist m&otilde;&otilde;tmisel kasutada kas sirgjoonelist lineaarset vahemaad v&otilde;i valitud liikumisviisi. Otsitavate l&auml;himate objektide arvu v&otilde;i soovitud otsinguulatust saate vajadusel piirata. Selle t&ouml;&ouml;riistaga saadud tulemused aitavad teil leida vastuseid n&auml;iteks j&auml;rgmistele k&uuml;simustele.
        <ul>
            <li>Milline park asub mulle k&otilde;ige l&auml;hemal?
            </li>
            <li>Millisesse haiglasse on v&otilde;imalik j&otilde;uda l&uuml;hima s&otilde;iduajaga? Kui kaua kestab s&otilde;it algusega kell 5:30 teisip&auml;eva &otilde;htusel tipptunnil?
            </li>
            <li>Milline on kahe linna vahemaa piki maanteed?
            </li>
            <li>Millised neist patsientidest elavad neist keemiatehastest kolme kilomeetri raadiuses?
            </li>
        </ul>
        
    </p>
    <p>L&auml;hima leidmise funktsioon tagastab kihi, mis sisaldab l&auml;himaid objekte ja joonekihi, mis seostab alguspunktid neile l&auml;himate asukohtadega. Joonekiht sisaldab teavet l&auml;htepunkti ja l&auml;himate asukohtade ning nendevaheliste vahemaade kohta.
    </p>
    <p>Kui ruut  <b>Kasuta praegust kaardi ulatust</b> on m&auml;rgitud, kaalutakse v&otilde;imalike alguspunktide ja potentsiaalsete l&auml;himate objektidena &uuml;ksnes neid objekte, mis on kaardil n&auml;ha.  Kui see ruut pole m&auml;rgitud, v&otilde;etakse k&otilde;ik sisendkihis olevad objektid arvesse ka siis, kui need pole praegu kaardil n&auml;ha.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="analysisLayer">
        <div><h2>Määra alguskohad</h2></div>
        <hr/>
        <div>
            <p>L&auml;hima leidmise funktsioon m&otilde;&otilde;dab siin m&auml;&auml;ratud kihi objektide (alguspunktide) vahemaa j&auml;rgmises parameetris m&auml;&auml;ratud asukohtadeni.  Kaasata saab kuni  5000 objekti iga kihi kohta. 
            </p>
        </div>
    </div>
    <div id="NearbyLocationsLayer">
        <div><h2>Leia lähimad asukohad</h2></div>
        <hr/>
        <div>
            <p>L&auml;hima leidmise funktsioon m&otilde;&otilde;dab esimeses kihis asuvate objektide vahemaa selle kihi asukohtadeni. Kaasata saab kuni  5000 asukohta iga kihi kohta. </p>
            <p>Lisaks kaardil asuvale kihile saate valida variandi  <b>Vali anal&uuml;&uuml;sikiht</b>, mille leiate ripploendi allosast. See variant avab galerii, mida saate sirvida ja kus saate erinevatest allikatest valida anal&uuml;&uuml;sil kasutamiseks andmestikke. 
            </p>
        </div>
    </div>
    <div id="MeasurementMethod">
        <div><h2>Mõõda</h2></div>
        <hr/>
        <div>
            <p>Saate valida, kas soovite l&auml;himad asukohad leida sirgjoonelise vahemaa v&otilde;i valitud liikumisviisi p&otilde;hjal. Liikumisviisid on lubatud &uuml;ksnes juhul, kui teie sisendkiht sisaldab punkte. Lubatud reisimisviisid m&auml;&auml;rab teie asutuse administraator.  Liikumisviisi kasutamisel m&otilde;&otilde;detakse vahemaad piki maanteid v&otilde;i jalgteid ning arvesse v&otilde;etakse kehtivad reeglid (nt &uuml;hesuunalised teed, keelatud p&ouml;&ouml;rdeid jne).
            </p>
            <p>Kui m&otilde;&otilde;date vahemaad joonte v&otilde;i alade vahel, leitakse vahemaa l&auml;himast punktist v&otilde;i l&auml;hima punktini piki joont v&otilde;i ala piiri. 
            </p> 
            <p>Valikute  <b>s&otilde;iduaeg</b>, <b>s&otilde;iduaeg maakohas</b>v&otilde;i <b>autoveo s&otilde;iduaeg</b>  korral saate s&otilde;iduaja m&otilde;&otilde;tmiseks mitme variandi vahel valida.
                <ul>
                    <li>
                        <p>T&uuml;hjendage ruut  <b>Kasuta liiklusinfot</b>, kui soovite l&auml;himate objektide leidmisel v&otilde;tta aluseks staatilise s&otilde;idukiiruse (nt kiirusepiirangutest l&auml;htudes), mitte muutuvatest liiklusoludest tingitud muutuvad kiirused.
                        </p>
                        <p>Selle variandi v&otilde;iksite valida juhul, kui soovite teada saada &uuml;ldiselt l&auml;himat objekti, mitte tingimata seda, mis oleks teile k&otilde;ige l&auml;hemal konkreetse p&auml;eva ja kellaaja liiklusolusid arvestades.
                        </p>
                    </li>
                    <li>
                        <p>M&auml;rkige ruut  <b>Kasuta liiklusinfot</b>, kui soovite l&auml;himate objektide leidmisel l&auml;htuda kindlast alguskellaajast ja muutuvatest liiklusoludest. Kui m&auml;rgite ka ruudu <b>Reaalajas liiklus</b>, m&auml;&auml;ratakse alguspunktist v&auml;ljumise ajaks praegune kellaaeg ning l&auml;himate objektide tuvastamisel v&otilde;etakse arvesse andurite ja voogude kaudu hangitavat teavet praeguse ja prognoositud liikluskiiruse kohta. Prognoositud liikluskiirused arvutatakse l&auml;htuvalt liikluse kiirusest reaalajas, varem m&otilde;&otilde;detud kiirustest ja muudest tingimustest (nt ilm). Liikluskiirust saab prognoosida kuni 12 tundi ette. Seega saate liugurit liigutades m&auml;&auml;rata v&auml;ljumisaja, mis on praegusest kuni 12 tundi hilisem.
                        </p>
                        <p>Reaalajas liikluse seadete abil saate v&auml;lja selgitada, milliste objektideni j&otilde;uaksite k&otilde;ige l&uuml;hema ajaga praegu v&auml;ljudes, s&otilde;itu n&auml;iteks tunni aja p&auml;rast alustades jne.
                        </p>
                    </li>
                    <li>
                        <p>Kui m&auml;rgite ruudu  <b>Kasuta liiklusinfot</b> ja valite seade <b>Liiklusinfo p&otilde;hineb tavap&auml;rastel tingimustel</b> koos kindla p&auml;eva ja kellaajaga, leiab t&ouml;&ouml;riist l&auml;himad objektid, v&otilde;ttes aluseks varasemalt viieminutise intervalliga m&otilde;&otilde;detud keskmised kiirused tavap&auml;rasel n&auml;dalal. Tulemused sisaldavad liiklusinfot, kuid ei sisalda praeguste liiklusolude ja s&uuml;ndmuste m&otilde;ju, mis v&otilde;ib s&otilde;ltuvalt p&auml;evast oluliselt varieeruda.
                        </p>
                        <p>Neid ajaloolisi liikluseandmeid saate kasutada n&auml;iteks selleks, et leida vastus k&uuml;simusele, milliste objektideni j&otilde;uab k&otilde;ige l&uuml;hema ajaga, kui v&auml;ljuda kolmap&auml;eval kell 11.30. 
                        </p>
                        <p>Teie m&auml;&auml;ratud kellaaeg viitab konkreetsele ajav&ouml;&ouml;ndile, kus teie algusobjektid asuvad. Kui m&auml;&auml;rate kellaaja 8:00 (hommikul) ning teie kaks alguspunkti asuvad erinevates ajav&ouml;&ouml;ndites, siis arvestatakse vastavalt teekonna genereerimisel m&otilde;lemas erinevas ajav&ouml;&ouml;ndis v&auml;ljumiskellaaega 8:00.
                        </p>
                    </li>
                </ul>
                V&otilde;tke arvesse, et s&otilde;iduki liikumisel l&auml;htepunktist edasi aeg kulub ja liiklusolud muutuvad. See t&ouml;&ouml;riist arvestab nende variatsioonidega, kui m&auml;rgite ruudu <b>Kasuta liiklusinfot</b>, kuid k&otilde;ik piirkonnad ei toeta liiklusteabe kasutamist. Kl&otilde;psake linki <b>Vaata k&auml;ttesaadavust</b>, et teada saada, kas antud funktsioon on teie piirkonnas k&auml;ttesaadav. 
            </p>
            <p> <b>Autoveo s&otilde;iduaeg</b> saab kasutada liiklusel p&otilde;hinevaid d&uuml;naamilisi s&otilde;idukiiruseid, kuid ainult kuni  seadusega lubatud veoauto maksimaalse s&otilde;idukiiruseni. N&auml;iteks kui reaalajas liikluses on d&uuml;naamiline kiirus t&auml;naval 60 kilomeetrit tunnis, aga veoauto lubatud s&otilde;idukiirus antud t&auml;naval on 50 kilomeetrit tunnis, kasutatakse selle t&auml;nava korral kiirust 50 kilomeetrit tunnis.
            </p>
        </div>
    </div>
    <div id="barrier_layers">
        <div><h2>Vali piirajakihid</h2></div>
        <hr/>
        <div>
            <p> &Uuml;ks v&otilde;i mitu objekti, mis toimivad allpool paiknevatel t&auml;navatel s&otilde;itmise korral ajutiste piirangute (t&otilde;ketena). Saate m&auml;&auml;rata t&otilde;kked, kasutades punkti, joone v&otilde;i hulknurga objekte.
            </p>
            <p>Punktt&otilde;kke abil saab modelleerida mahakukkunud puud, avariid, allakukkunud elektriliini v&otilde;i midagi muud, mis t&otilde;kestab antud t&auml;navaosal liikluse t&auml;ielikult. T&auml;naval on liiklemine lubatud, kuid mitte l&auml;bi t&otilde;kke. Punktt&otilde;ketena saate m&auml;&auml;rata kuni 250 objekti.
            </p>
            <p>Joont&otilde;ke keelab liiklemise igal pool, kus t&otilde;ke l&otilde;ikub t&auml;navaga. Joont&otilde;kkega saab modelleerida n&auml;iteks paraadi v&otilde;i meeleavaldust, mis t&otilde;kestab liikluse mitmel t&auml;naval&otilde;igul. Kui k&otilde;igi joont&otilde;ketega ristuvate t&auml;navaobjektide arv &uuml;letab 500, annab t&ouml;&ouml;riist veateate.
            </p>
            <p>Hulknurkt&otilde;ke keelab liiklemise igal pool, kus hulknurk l&otilde;ikub t&auml;navatega. Selle t&otilde;kket&uuml;&uuml;bi &uuml;heks kasutuskohaks on &uuml;leujutuste modelleerimine, kui &uuml;leujutus h&otilde;lmab t&auml;navav&otilde;rku ja muudab seal liiklemise v&otilde;imatuks. Kui k&otilde;igi hulknurkt&otilde;ketega ristuvate t&auml;navaobjektide arv &uuml;letab 2000, annab t&ouml;&ouml;riist veateate.
            </p>
        </div>
    </div>
    <div id="Cutoffs">
        <div><h2>Iga sisendkihi asukoha jaoks</h2></div>
        <hr/>
        <div>
            <p>L&auml;himate asukohtade otsingu piiramiseks on teil kaks varianti. Esimene variant on piirata &uuml;he alguspunkti kohta leitavate l&auml;himate asukohtade arvu. N&auml;iteks saate otsida kas &uuml;hte l&auml;himat parki, kahte k&otilde;ige l&auml;hemal asuvat parki jne. Teine v&otilde;imalus on m&auml;&auml;rata maksimaalne otsinguulatus v&otilde;i s&otilde;iduaeg.
            </p>
            <p>Kui j&auml;tate need ruudud m&auml;rkimata, on leitavate l&auml;himate asukohtade arv maksimaalselt 100 (t&ouml;&ouml;riista piirm&auml;&auml;r) ja otsinguulatus on piiramatu.
            </p>
            <p>T&ouml;&ouml;tlemiseks kuluv aeg s&otilde;ltub alguspunktide ja l&auml;himate asukohtade arvust ning maksimaalsest otsinguulatusest. Kui asukohti on rohkem ja otsinguulatus suurem, kulub anal&uuml;&uuml;simiseks rohkem aega.
            </p>
            <p>Pange t&auml;hele, et kui otsinguulatus on piiratud, v&otilde;ib juhtuda, et t&ouml;&ouml;riist ei leia selles ulatuses &uuml;htegi l&auml;himat asukohta v&otilde;i leitakse teie m&auml;&auml;ratud l&auml;himate asukohtade maksimaalsest arvust v&auml;hem asukohti.
            </p>
        </div>
    </div>
    <div id="OutputNearestLocationsLayer">
        <div><h2>Tulemkihi nimi</h2></div>
        <hr/>
        <div>
            <p>See on selle objektikihi nimi, mis luuakse jaotises  <b>Minu sisu</b> ja lisatakse kaardile. Kui objektikiht on juba olemas, palutakse teil sisestada m&otilde;ni muu nimi. See objektikiht koosneb kahest kihist: l&auml;himate asukohtadega kihist ja kihist, milles sisalduvad jooned, mis &uuml;hendavad sisendpunktid l&auml;himate asukohtadega.
            </p>
            <p>Kui valite  <b>Kaasa marsruudikihid</b>, salvestatakse tulemuse iga marsruut marsruudikihina. Marsruudikiht sisaldab teavet konkreetse marsruudi kohta (nt marsruudile m&auml;&auml;ratud peatused ja ka teejuhised). Marsruudikihtide loomine on kasulik, kui soovite &uuml;ksikuid marsruute jagada oma ettev&otilde;tte teiste liikmetega v&otilde;i neid marsruute edaspidi muuta kaardivaaturi nupu <b>Teejuhised</b> abil. Marsruudikihid kasutavad objektikihi jaoks pandud nime eesliitena ja anal&uuml;&uuml;si osana genereeritud marsruudinimi lisatakse iga marsruudikihi jaoks kordumatu nime loomiseks.
            </p>
            <p>Maksimaalselt saab luua  1000 marsruudikihti. Kui tulem sisaldab enam kui  1000 marsruuti ja ruut  <b>Kaasa marsruudikihid</b> on m&auml;rgitud, loob t&ouml;&ouml;riist ainult v&auml;ljundi objektiteenuse.
            </p>
            <p>Rippmen&uuml;&uuml;  <b>Salvesta tulemus</b> kaudu saate m&auml;&auml;rata jaotises <b>Minu sisu</b> selle kausta nime, kuhu objektikiht ja marsruudikihid salvestatakse.
            </p>
        </div>
    </div>
</div>
</html>
