<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Ühenda objektid</h2><p/>
        <h2><img src="../images/GUID-900E33CD-3789-45B5-8F0C-92D91E64D2A4-web.png" alt="&Uuml;henda objektid"></h2>
        <hr/>
    <p>Objektide &uuml;hendamise t&ouml;&ouml;vahend t&ouml;&ouml;tab kahe kihiga. T&ouml;&ouml;riist &bdquo;&Uuml;henda objektid&rdquo; &uuml;hendab &uuml;he objekti atribuudid teisega ruumiliste, ajaliste ja atribuutide seoste v&otilde;i nende kolme kombinatsiooni p&otilde;hjal. T&ouml;&ouml;riist teeb kindlaks k&otilde;ik sisendobjektid, mis vastavad m&auml;&auml;ratud &uuml;hendamistingimustele ja &uuml;hendab teise sisendkihi esimesega. Soovi korral saate &uuml;hendada k&otilde;ik objektid &uuml;hilduvate objektidega v&otilde;i summeerida &uuml;hilduvad objektid.
    </p>
    <p>T&ouml;&ouml;rista &bdquo;Liida objektid&rdquo; saab kasutada punktide, joonte, alade ja tabelitega. Ajaline &uuml;hendamine n&otilde;uab, et sisendandmed oleksid ajateadlikud ja ruumiline &uuml;hendamine n&otilde;uab, et andmed sisaldaksid geomeetriat. 
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="targetLayer">
        <div><h2>Vali sihtkiht</h2></div>
        <hr/>
        <div>
            <p>Kiht, mille tabelisse on lisatud liidetava kihi  atribuudid.
            </p>
            <p>Ruumilist  <b>l&auml;hiseost</b> kasutav anal&uuml;&uuml;s n&otilde;uab tasapinnalist ristkoordinaatide s&uuml;steemi. <b>Koordinaats&uuml;steemi t&ouml;&ouml;tlemise</b> saab m&auml;&auml;rata funktsiooniga <b>Anal&uuml;&uuml;sikeskkonnad</b>. Kui koordinaats&uuml;steemi t&ouml;&ouml;tlemine ei ole m&auml;&auml;ratud tasapinnaliseks ristkoordinaatide s&uuml;steemiks, kuvatakse k&auml;su <b>K&auml;ivita anal&uuml;&uuml;s</b> andmisel selle m&auml;&auml;ramist taotlev h&uuml;pikaken.
            </p>
            <p>Lisaks kihi valimisele kaardil saate valida ripploendi alumises servas  <b>Vali anal&uuml;&uuml;sikihte</b>, et otsida oma sisust suurandmete failiketta andmestikku v&otilde;i objektikihti.
            </p>
        </div>
    </div>
    <div id="joinLayer">
        <div><h2>Vali sihtkihiga ühendatav kiht</h2></div>
        <hr/>
        <div>
            <p>Sihtkihile lisatavate atribuutidega liidetav kiht.
            </p>
            <p>Lisaks kihi valimisele kaardil saate valida ripploendi alumises servas  <b>Vali anal&uuml;&uuml;sikihte</b>, et otsida oma sisust suurandmete failiketta andmestikku v&otilde;i objektikihti.
            </p>
        </div>
    </div>
    <div id="joinOperation">
        <div><h2>Vali liitmise toiming</h2></div>
        <hr/>
        <div>
            <p>M&auml;&auml;rab, kuidas sihtkihte ja liidetavaid kihte v&auml;ljundis k&auml;sitletakse, kui mitmel &uuml;hendataval objektil on &uuml;hendatava kihiga samasugune seos. Saadaval on kaks &uuml;hendamisv&otilde;imalust.
                <ul>
                    <li> <b>&Uuml;henda &uuml;ks &uuml;hele</b>&ndash; see toiming summeerib k&otilde;ik &uuml;hilduvad objektid iga &uuml;hendatava objektiga.
                    </li>
                    <li> <b>&Uuml;henda &uuml;ks mitmele</b> &ndash; see toiming &uuml;hendab k&otilde;ik &uuml;hilduvad objektid &uuml;hendamiskihiga.
                    </li>
                </ul>
                
            </p>
            <p>Oletame n&auml;iteks, et soovite leida k&otilde;ik kaubamajad, mis j&auml;&auml;vad turust 2 kilomeetri raadiusesse. Sellisel juhul on &uuml;hendataval kihil &uuml;ks objekt, mis t&auml;histab turgu ja &uuml;hendatavad objektid t&auml;histavad kohalikke toidupoode, millel on n&auml;iteks atribuut aastane kogul&auml;bim&uuml;&uuml;k. Objektide liitmise t&ouml;&ouml;riista abil saate teada, et sellele kriteeriumile vastavad viis toidupoodi. Kui t&auml;psustate liitmistoimingut  <b>Liida &uuml;ks mitmega</b>, saaksite tulemuseks viis objekti, kus iga rida t&auml;histab turgu ja kaubamaja. Kui kasutaksime toimingut <b>&Uuml;henda &uuml;ks &uuml;hega</b>, saaksime tulemuseks &uuml;he objekti, mis t&auml;histab turgu ja sisaldab kaubamajade teabe kokkuv&otilde;tet (nt arv 2) ning muud statistikat (nt aastast kogul&auml;bim&uuml;&uuml;ki).
            </p>
        </div>
    </div>
    <div id="joinOptions">
        <div><h2>Vali üks või mitu ühendust</h2></div>
        <hr/>
        <div>
            <p>M&auml;&auml;rab kasutatava &uuml;hendusvariandi. Kasutada saab &uuml;hte, kahte v&otilde;i kolme allj&auml;rgnevat &uuml;hendust&uuml;&uuml;pi: 
                <ul>
                    <li> <b>Ruumiline</b> &ndash; kasutab objektide &uuml;hendamiseks m&auml;&auml;ratletud ruumilist seost. See n&otilde;uab, et m&otilde;lemad kihid sisaldaksid geomeetriat.
                    </li>
                    <li> <b>Ajaline</b> &ndash; kasutab objektide &uuml;hendamiseks ajalist seost. See n&otilde;uab, et m&otilde;lemas kihis oleks aeg lubatud.
                    </li>
                    <li> <b>Atribuut</b> &ndash; kasutab objektide &uuml;hendamiseks &uuml;hesuguseid v&auml;lju.
                    </li>
                </ul>
                
            </p>
            <p>
            </p>
        </div>
    </div>
    <div id="spatialRelationship">
        <div><h2>Vali ruumiline seos</h2></div>
        <hr/>
        <div>
            <p>Ruumiline seos, mis m&auml;&auml;rab, kas objektid liidetakse. Saadaolevad seosed olenevad sellest, mis t&uuml;&uuml;pi geomeetriat (punkt, murdjoon, pol&uuml;goon) sisendobjektide jaoks kasutatakse.
                <ul>
                    <li> <b>L&otilde;ikub</b> &ndash; objektid vastendatakse, kui need l&otilde;ikuvad omavahel.
                    </li>
                    <li> <b>V&otilde;rdub</b> &ndash; objektid vastendatakse, kui neil on &uuml;hesugune geomeetria.
                    </li>
                    <li> <b>L&auml;hedal</b> &ndash; objektid vastendatakse, kui need on &uuml;ksteisest m&auml;&auml;ratud kaugusel. Sihtkiht peab olema tasapinnalises ristkoordinaatide s&uuml;steemis. Ruumilise <b>l&auml;hiseose</b> rakendamise korral peab tasapinnaliseks ristkoordinaatide s&uuml;steemiks olema funktsiooni <b>Anal&uuml;&uuml;sikeskkonnad</b> abil m&auml;&auml;ratud t&ouml;&ouml;tlev koordinaats&uuml;steem.
                    </li>
                    <li> <b>Sisaldab</b> &ndash; objektid vastendatakse, kui kiht, millega &uuml;hendatakse, sisaldub &uuml;hendatavates objektides.
                    </li>
                    <li> <b>Sisaldab</b> &ndash; objektid vastendatakse, kui kiht, millega &uuml;hendatakse, sisaldub &uuml;hendatavates objektides.
                    </li>
                    <li> <b>Puudutab</b> &ndash; objektid vastendatakse, kui nende piir puutub kokku objektiga, millega neid &uuml;hendatakse.
                    </li>
                    <li> <b>Ristub</b> &ndash; objektid vastendatakse, kui nende piirjooned ristuvad.
                    </li>
                    <li> <b>Kattub</b> &ndash; objektid vastendatakse, kui need kattuvad.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="nearSpatial">
        <div><h2></h2></div>
        <hr/>
        <div>
            <p> See vahemaa m&auml;&auml;rab raadiuse, mida rakendatakse ruumilise l&auml;hiseose korral.
            </p>
            <p>Kui teil on n&auml;iteks andmestik, mis esindab tuumaelektrijaama ja andmestik, mis esindab elamupiirkonda, siis v&otilde;ite seadistada ruumilise l&auml;hiseose vahemaa, et leida elamud, mis asuvad tuumaelektrijaamast 1 kilomeetri raadiuses.
            </p> 
        </div>
    </div>
    <div id="temporalRelationship">
        <div><h2>Vali ajaline seos</h2></div>
        <hr/>
        <div>
            <p>Ajaline seos, mis m&auml;&auml;rab, kas objektid &uuml;hendatakse. See suvand on saadaval ainult siis, kui m&otilde;lemas kihis on aeg lubatud ja saadaolevad seosed s&otilde;ltuvad sisendobjektide jaoks kasutusel olevast aja t&uuml;&uuml;bist (jooksev v&otilde;i intervall). Saadaval on allj&auml;rgnevad ajaseosed:
                <ul>
                    <li> <b>Vastab</b> &ndash; objektid vastendatakse, kui esimene objekt vastab teisele.
                    </li>
                    <li> <b>Vastab:</b> &ndash; objektid vastendatakse, kui teine objekt vastab esimestele.
                    </li>
                    <li> <b>Kattub</b> &ndash; objektid vastendatakse, kui esimene objekt kattub teisega.
                    </li>
                    <li> <b>Kaetud:</b> &ndash; objektid vastendatakse, kui teine objekt kattub esimestega.
                    </li>
                    <li> <b>Jooksul</b> &ndash; objektid vastendatakse, kui esimesed objektid toimuvad teise jooksul.
                    </li>
                    <li> <b>Sisaldab</b> &ndash; objektid vastendatakse, kui esimene objekt sisaldab teist.
                    </li>
                    <li> <b>V&otilde;rdub</b> &ndash; objektid vastendatakse, kui esimene ja teine objekt on v&otilde;rdsed.
                    </li>
                    <li> <b>L&otilde;peb</b> &ndash; objektid vastendatakse, kui esimene objekt l&otilde;petab teise.
                    </li>
                    <li> <b>L&otilde;petas:</b> &ndash; objektid vastendatakse, kui teine objekt l&otilde;petab esimesed.
                    </li>
                    <li> <b>K&auml;ivitub</b> &ndash; objektid vastendatakse, kui esimene objekt k&auml;ivitab teise.
                    </li>
                    <li> <b>K&auml;ivitaja:</b> &ndash; objektid vastendatakse, kui teine objekt k&auml;ivitab esimese.
                    </li>
                    <li> <b>L&otilde;ikub</b>&mdash;objektid vastendatakse, kui nende k&otilde;ik ajad l&otilde;ikuvad.
                    </li>
                    <li> <b>L&auml;hedal</b> &ndash; objektid &uuml;hendatakse, kui need on m&auml;&auml;ratud ajal &uuml;ksteise l&auml;hedal.
                    </li>
                    <li> <b>L&auml;hedal enne</b>&mdash;Objektid &uuml;hendatakse, kui esimene objekt on enne teist objekti ja toimub etten&auml;htud ajavahemikus.
                    </li>
                    <li> <b>L&auml;hedal p&auml;rast</b>&mdash;Objektid &uuml;hendatakse, kui esimene objekt on p&auml;rast teist objekti ja toimub etten&auml;htud ajavahemikus.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="nearTemporal">
        <div><h2></h2></div>
        <hr/>
        <div>
            
            <p>See ajaline vahemaa m&auml;&auml;rab raadiuse, mida rakendatakse ajalise l&auml;hiseose korral. Ajaline l&auml;hiseos sisaldab j&auml;rgmisi seoseid:  <b>L&auml;hedal</b>, <b>L&auml;hedal enne</b>, ja <b>L&auml;hedal p&auml;rast</b>.
            </p>
            <p>Kui teil on n&auml;iteks paadi&otilde;nnetuste kiht ja orkaani edasiliikumise GPS-radade kiht, saate vaadata paadi&otilde;nnetusi, mis asuvad tormi trajektoorist teatud ruumilisel (1 kilomeeter) ja ajalisel kaugusel (5 tundi). Selle tulemusena &uuml;hendatakse paadi&otilde;nnetused orkaanidega, mis leidsid aset ruumiliselt ja ajaliselt l&auml;hestikku.
            </p>
        </div>
    </div>
    <div id="attributeRelationship">
        <div><h2>Vali vastenduvad väljad</h2></div>
        <hr/>
        <div>
            <p>See seos vastendab &uuml;he kihi v&auml;lja v&auml;&auml;rtused teise kihi v&auml;lja v&auml;&auml;rtustega. 
            </p>
            <p>Kui teil on n&auml;iteks kogu riiki h&otilde;lmav elukoha-aadresside geograafiline kiht (sealhulgas v&auml;li  <i>ZIP</i>) ja tabelikujuline andmestik tervishoiuga seotud demograafliste andmete kohta postiindeksite kaupa (v&auml;li nimega <i>HEALTHZIP</i>), saate tervishoiu andmestiku &uuml;hendada elukohaandmetega, sobitades v&auml;lja <i>ZIP</i> kokku v&auml;ljaga <i>HEALTHZIP</i>. Tulemuseks on elukoha-aadresside kiht koos vastavate tervishoiuandmetega.
            </p>
        </div>
    </div>
    <div id="summaryFields">
        <div><h2>Lisa statistika (valikuline)</h2></div>
        <hr/>
        <div>
            <p>Arvutab statistika &uuml;hendatud objektide kohta, kui &uuml;hendamistoiming on  <b>&Uuml;henda &uuml;kshaaval</b>. Vaikimisi &uuml;hendatakse kogu statistika.
            </p>
            <p>Saate arvutada summeeritud objektide statistika. Numbriv&auml;ljadel saab arvutada j&auml;rgmised statistikad: 
                <ul>
                    <li>Koguarv &ndash; arvutatakse v&auml;&auml;rtuste, mis pole nullv&auml;&auml;rtused, hulk. See funktsioon on kasutatav numbriv&auml;ljade v&otilde;i stringide korral. V&auml;&auml;rtuste [null, 0 ja 2] koguarv on 2.
                    </li>
                    <li>Summa &ndash; v&auml;ljal olevate arvv&auml;&auml;rtuste summa. V&auml;&auml;rtuste [null, null ja 3] summa on 3.
                    </li>
                    <li>Keskmine &ndash; arvv&auml;&auml;rtuste keskmine. V&auml;&auml;rtuste [0; 2 ja null] keskmine on 1.
                    </li>
                    <li>Miinimum &ndash; numbriv&auml;lja miinimumv&auml;&auml;rtus. V&auml;&auml;rtuste [0; 2 ja null] miinimum on 0. 
                    </li>
                    <li>Maksimum &ndash; numbriv&auml;lja maksimumv&auml;&auml;rtus. V&auml;&auml;rtuste [0; 2 ja null] maksimum on 2.
                    </li>
                    <li>Vahemik &ndash; numbriv&auml;lja vahemik. Selle arvutamiseks lahutatakse maksimumv&auml;&auml;rtusest miinimumv&auml;&auml;rtus. V&auml;&auml;rtuste [0, null ja 1] vahemik on 1. V&auml;&auml;rtuste [null ja 4] vahemik on 0.
                    </li>
                    <li>Dispersioon &ndash; raja numbriv&auml;lja dispersioon. V&auml;&auml;rtuse [1] dispersiooni on null. V&auml;&auml;rtuste [null, 1,0,1,1] dispersioon on 0,25.
                    </li>
                    <li>Standardh&auml;lve &ndash; numbriv&auml;lja standardh&auml;lve. V&auml;&auml;rtuse [1] standardh&auml;lve on null. V&auml;&auml;rtuste [null, 1,0,1,1] standardh&auml;lve on 0,5. 
                    </li>
                </ul>
                
            </p>
            <p>Tekstiv&auml;ljadel saab arvutada j&auml;rgmised statistikad:
                <ul>
                    <li>Koguarv &ndash; stringide, mis pole nullv&auml;&auml;rtused, hulk.
                    </li>
                    <li>M&otilde;ni &ndash; see statistik on juhuslik valim tekstistringi v&auml;&auml;rtusest vastaval v&auml;ljal.
                    </li>
                </ul>
                K&otilde;ik statistikud arvutatakse v&auml;&auml;rtustega, mis ei ole nullv&auml;&auml;rtus. Tulemkiht sisaldab uut v&auml;lja iga arvutatud statistiku kohta. Soovitud statistika lisamiseks valige uus atribuut ja statistik.
            </p>
            <p>K&otilde;ik statistikud arvutatakse v&auml;&auml;rtustega, mis ei ole nullv&auml;&auml;rtus. Tulemkiht sisaldab uut v&auml;lja iga arvutatud statistiku kohta. Soovitud statistika lisamiseks valige uus atribuut ja statistik.
            </p>
        </div>
    </div>
    <div id="joinCondition">
        <div><h2>Sisestage tingimuslause, mille alusel objekte ühendada (valikuline)</h2></div>
        <hr/>
        <div>
            <p>Rakendab m&auml;&auml;ratud v&auml;ljadele tingimuse. &Uuml;hendatakse ainult nende v&auml;ljadega objektid, mis vastavad tingimustele.
            </p>
            <p>Kui soovite n&auml;iteks andmestikuga liita v&otilde;i &uuml;hendada ainult objektid, kus  <i>health_spending</i>  on suurem kui 20 protsenti sissetulekust <i>income</i>, liitke v&otilde;i &uuml;hendage tingimus <code>$target[&quot;health_spending&quot;] &gt; ($join[&quot;income&quot;] * .20)</code>, kasutades v&auml;lja <i>health_spending</i> esimesest andmestikust (andmestiku objektid &uuml;hendatakse) ja v&auml;lja <i>income</i> teisest andmestikust (andmestik liidetakse).
            </p>
            <p>&Uuml;hendamistingimusi saab rakendada tingimuste kalkulaatori abil.
            </p>
        </div>
    </div>
    <div id="dataStore">
        <div><h2>Vali andmeladu</h2></div>
        <hr/>
        <div>
            <p>GeoAnalyticsi tulemeid k&auml;sitletakse  andmelaos salvedena ning need kuvatakse portaalis   Portal for ArcGIS objektikihtidena. &Uuml;ldjuhul salvestatakse tulemid ajalisruumilisse andmelattu &ndash; see on vaikimisi valitud. M&otilde;nel juhul on , tulemid m&otilde;istlik salvestada relatsioonilisse andmelattu. Allpool on toodud m&otilde;ned p&otilde;hjused, miks oleks soovitatav tulemid   salvestada relatsioonilisse andmelattu: 
                <ul>
                    <li>Tulemeid saateportaaliskasutadaportaali koost&ouml;&ouml;ks.
                    </li>
                    <li>Saate lubada tulemitega s&uuml;nkroniseerimise funktsiooni.
                    </li>
                </ul>
                
            </p>
            <p>Relatsioonilist andmeladu pole otstarbekas kasutada, kui GeoAnalyticsi tulemite arv suureneb. Sel juhul peaksite kasutama suurt ajalisruumilist andmeladu, mis v&otilde;imaldab hallata suurt andmemahtu.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Tulemkihi nimi</h2></div>
        <hr/>
        <div>
            <p> Loodavakihi nimi.  Kui kirjutate andmelattu ArcGIS Data Store, salvestatakse teie tulemused  <b>Minu sisus</b> ja lisatakse kaardile. Kui kirjutate suurandmete failikettale, salvestatakse teie andmed suurandmete failikettale  ja lisatakse  selle manifestifailile. Seda  ei lisata kaardile. Vaikimisi nimi p&otilde;hineb t&ouml;&ouml;riista nimel ja sisendkihi nimel. Kui see kiht on juba olemas, siis t&ouml;&ouml;tlemine nurjub.
            </p>
            <p>Kui salvestate admelattu   ArcGIS Data Store (relatsioonilisse v&otilde;i ajalisruumilisse andmelattu), kasutades rippmen&uuml;&uuml;d  <b>Salvesta tulemused</b>, saate jaotises <b>Minu sisu</b> m&auml;&auml;rata selle kausta nime, kuhu tulemused salvestatakse.
            </p>
        </div>
    </div>
</div>
</html>
