<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Summeeri piirides</h2><p/>
        <h2><img src="../images/GUID-9B12DB3F-AA7B-41EB-87C6-D2DEC3D52DA9-web.png" alt="Summeeri piirides"></h2>
        <hr/>
    <p>See t&ouml;&ouml;riist leiab alad ja nende osad, mis on esimese sisendkihi piirides.  N&auml;ited.
        <ul>
            <li>&Uuml;leujutusalade ulatuse ja maakasutuse piirkondade v&otilde;rdluse tulemusena on leitav iga &uuml;leujutuspiirkonna alla j&auml;&auml;va konkreetse kasutatava maa-ala kogupindala. 
            </li>
            <li>Omavalitsuse piirides paiknevate katastri&uuml;ksuste keskmine maamaksu suurus asustus&uuml;ksuste kaupa.
            </li>
        </ul>
        
    </p>
    <p>Kui ruut  <b>Kasuta praegust kaardi ulatust</b> on m&auml;rgitud, anal&uuml;&uuml;sitakse &uuml;ksnes neid sisendkihi ja summeeritava kihi objekte, mis on kaardil praegu n&auml;htavad.  Kui see ruut on m&auml;rkimata, anal&uuml;&uuml;sitakse k&otilde;iki sisendkihi ja summeeritava kihi objekte ka siis, kui neid pole praegu kaardil n&auml;ha.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="sumWithinLayer">
        <div><h2>Vali alakiht, et summeerida muid objekte selle piirides</h2></div>
        <hr/>
        <div>
            <p>Alakiht, mida kasutatakse selle piiridesse j&auml;&auml;vate objektide summeerimiseks. 
            </p>
            <p>Saate valida enda antud alakihi v&otilde;i salved, mis luuakse, kui t&ouml;&ouml;riist k&auml;ivitub. Salvede loomisel  <b>ruuduna</b> m&auml;&auml;ratlevad ruudu k&otilde;rguse ja pikkuse m&auml;&auml;ratud arv ja &uuml;hikud. Kui teete valiku <b>Kuusnurk</b> m&auml;&auml;ravad arv ja &uuml;hikud paralleelk&uuml;lgede vahelise vahemaa.
            </p>
            <p>Lisaks kaardil asuvale kihile saate valida variandi  <b>Vali anal&uuml;&uuml;sikiht</b>, mille leiate ripploendi allosast. See variant avab galerii, mida saate sirvida ja kus saate erinevatest allikatest valida anal&uuml;&uuml;sil kasutamiseks andmestikke. 
            </p>
        </div>
    </div>
    <div id="Summarize">
        <div><h2>Vali kiht summeerimiseks</h2></div>
        <hr/>
        <div>
            <p>Selles kihis summeeritakse objektid, mis on &uuml;laltoodud sisendkihi piirides. 
            </p>
            <p>Lisaks kaardil asuvale kihile saate valida variandi  <b>Vali anal&uuml;&uuml;sikiht</b>, mille leiate ripploendi allosast. See variant avab galerii, mida saate sirvida ja kus saate erinevatest allikatest valida anal&uuml;&uuml;sil kasutamiseks andmestikke. 
            </p>
        </div>
    </div>
    <div id="StatisticsPoint">
        <div><h2>Lisa summeerimiseks kihi statistika</h2></div>
        <hr/>
        <div>
            <p>Teil on v&otilde;imalik soovi korral arvutada arvuliste atribuutide alusel statistika punktide kohta, mis j&auml;&auml;vad objekti piiridesse. 
            </p>
            <p>Kui ruut  <b>Punktide arv</b> on m&auml;rgitud, arvutatakse ala piiridesse j&auml;&auml;vate punktide koguarv.  Lisaks sellele saate arvutada arvuliste atribuutide statistika nende punktide kohta, mis on iga ala piirides.
            </p>
            <ul>
                <li> <b>Summa</b> &ndash; m&auml;&auml;ratud v&auml;lja koguv&auml;&auml;rtus.
                </li>
                <li> <b>Keskmine</b> &ndash; m&auml;&auml;ratud v&auml;lja keskv&auml;&auml;rtus.
                </li>
                <li> <b>Miinimum</b> &ndash; m&auml;&auml;ratud v&auml;lja v&auml;ikseim v&auml;&auml;rtus.
                </li>
                <li> <b>Maksimum</b> &ndash; m&auml;&auml;ratud v&auml;lja suurim v&auml;&auml;rtus.
                </li>
                <li> <b>Standardh&auml;lve </b> &ndash; m&auml;&auml;ratud v&auml;lja v&auml;&auml;rtuste standardh&auml;lve.
                </li>
            </ul>
            
            <p>Kui summeeritav kiht ei sisalda arvuv&auml;lju, pole lisastatistika saadaval.
            </p>
        </div>
    </div>
    <div id="StatisticsLine">
        <div><h2>Lisa statistika</h2></div>
        <hr/>
        <div>
            <p>Teil on v&otilde;imalik valikuliselt arvutada numbriliste atribuutide alusel statistikuid summeeritavate joonte kaudu. 
            </p>
            <p>Kui ruut  <b>Joonte kogupikkus</b> on m&auml;rgitud, arvutatakse ala piiridesse j&auml;&auml;vate joonte kogupikkus.  Lisaks sellele saate arvutada arvuliste atribuutide statistika nende joonte kohta, mis on iga ala piirides.
            </p>
            <ul>
                <li> <b>Summa</b> &ndash; m&auml;&auml;ratud v&auml;lja koguv&auml;&auml;rtus.
                </li>
                <li> <b>Keskmine</b> &ndash; m&auml;&auml;ratud v&auml;lja keskv&auml;&auml;rtus.
                </li>
                <li> <b>Miinimum</b> &ndash; m&auml;&auml;ratud v&auml;lja v&auml;ikseim v&auml;&auml;rtus.
                </li>
                <li> <b>Maksimum</b> &ndash; m&auml;&auml;ratud v&auml;lja suurim v&auml;&auml;rtus.
                </li>
                <li> <b>Standardh&auml;lve </b> &ndash; m&auml;&auml;ratud v&auml;lja v&auml;&auml;rtuste standardh&auml;lve.
                </li>
            </ul>
            
            <p>Kui summeeritav kiht ei sisalda arvuv&auml;lju, pole lisastatistika saadaval.
            </p>
        </div>
    </div>
    <div id="StatisticsPolygon">
        <div><h2>Lisa statistika</h2></div>
        <hr/>
        <div>
            <p>Teil on v&otilde;imalik valikuliselt arvutada numbriliste atribuutide alusel statistikuid summeeritavate objektide kaudu. 
            </p>
            <p>Kui ruut  <b>Summeeri pindala, kasutades</b> on m&auml;rgitud, arvutatakse esimese sisendkihi ala piiridesse j&auml;&auml;vate objektide kogupindala.  Lisaks sellele saate arvutada arvuliste atribuutide statistika nende objektide kohta, mis on iga ala piirides.
            </p>
            <ul>
                <li> <b>Summa</b> &ndash; m&auml;&auml;ratud v&auml;lja koguv&auml;&auml;rtus.
                </li>
                <li> <b>Keskmine</b> &ndash; m&auml;&auml;ratud v&auml;lja keskv&auml;&auml;rtus.
                </li>
                <li> <b>Miinimum</b> &ndash; m&auml;&auml;ratud v&auml;lja v&auml;ikseim v&auml;&auml;rtus.
                </li>
                <li> <b>Maksimum</b> &ndash; m&auml;&auml;ratud v&auml;lja suurim v&auml;&auml;rtus.
                </li>
                <li> <b>Standardh&auml;lve </b> &ndash; m&auml;&auml;ratud v&auml;lja v&auml;&auml;rtuste standardh&auml;lve.
                </li>
            </ul>
            
            <p>Kui summeeritav kiht ei sisalda arvuv&auml;lju, pole lisastatistika saadaval.
            </p>
        </div>
    </div>
    <div id="StatisticsNoLayer">
        <div><h2>Lisa statistika</h2></div>
        <hr/>
        <div>
            <p>P&auml;rast summeritava kihi valimist saate soovi korral arvutada mis tahes punktide, joonte v&otilde;i pindade statistika sisendpindade kihi piires. 
            </p>
            <ul>
                <li> <b>Summa</b> &ndash; m&auml;&auml;ratud v&auml;lja koguv&auml;&auml;rtus.
                </li>
                <li> <b>Keskmine</b> &ndash; m&auml;&auml;ratud v&auml;lja keskv&auml;&auml;rtus.
                </li>
                <li> <b>Miinimum</b> &ndash; m&auml;&auml;ratud v&auml;lja v&auml;ikseim v&auml;&auml;rtus.
                </li>
                <li> <b>Maksimum</b> &ndash; m&auml;&auml;ratud v&auml;lja suurim v&auml;&auml;rtus.
                </li>
                <li> <b>Standardh&auml;lve </b> &ndash; m&auml;&auml;ratud v&auml;lja v&auml;&auml;rtuste standardh&auml;lve.
                </li>
            </ul>
            
            <p>Olenevalt summeritavate objektide t&uuml;&uuml;bist saate arvutada punktide koguarvu, joonte kogupikkuse v&otilde;i kogupindala.
            </p>
            <p>Kui summeeritav kiht ei sisalda arvuv&auml;lju, pole lisastatistika saadaval.
            </p>
        </div>
    </div>
    <div id="GroupBy">
        <div><h2>Vali v채li, mille j채rgi r체hmitada</h2></div>
        <hr/>
        <div>
            <p>See on funktsiooni  <b>Summeeri</b> atribuut, mida saate kasutada statistika leidmiseks iga unikaalse atribuutv&auml;&auml;rtuse kaupa. Oletame n&auml;iteks, et esimene sisendkiht sisaldab linna piire ja summeerimisobjektideks on maat&uuml;kid.  &Uuml;ks maat&uuml;kkide atribuutidest on <i>Status</i> mis sisaldab kahte v&auml;&auml;rtust: VAKANTNE ja H&Otilde;IVATUD. Vakantsete ja h&otilde;ivatud maat&uuml;kkide kogupindala arvutamiseks linna piirides kasutage atribuudi <i>Status</i> alusel grupeerimist. Iga grupi statistika ja piiraja-objektide alla j&auml;&auml;vate pindade arv kuvatakse tulemkihi h&uuml;pikaknas.
            </p>
        </div>
    </div>
    <div id="MinorityMajority">
        <div><h2>Lisa v채hemus, enamus</h2></div>
        <hr/>
        <div>
            <p>See m&auml;rkeruut on aktiveeritud, kui valite r&uuml;hmitatava v&auml;lja. Kui soovite v&auml;lja selgitada, millised atribuudiv&auml;&auml;rtused on esimeses sisendkihis igas grupis iga piiraja piirides v&auml;hemuses (k&otilde;ige v&auml;hem domineerivad) v&otilde;i enamuses (k&otilde;ige rohkem domineerivad), valige  <b>Lisa v&auml;hemus, enamus</b>.   Ruudu <b>Lisa v&auml;hemus, enamus</b> m&auml;rkimisel lisatakse tulemkihile kaks uut v&auml;lja.   Kui m&auml;rgite ka ruudu <b>Lisa protsendid</b>, lisatakse tulemkihile veel kaks v&auml;lja, mis sisaldavad iga r&uuml;hma kohta v&auml;hemuse ja enamuse atribuudiv&auml;&auml;rtuste protsente.
            </p>
            <ul>
                <li>Punktide summeerimisel arvutatakse v&auml;hemuse ja enamuse v&auml;&auml;rtused sisendalakihi piiratud alades olevate punktide arvu j&auml;rgi.  
                </li>
                <li>Joonte summeerimisel arvutatakse v&auml;hemuse ja enamuse v&auml;&auml;rtused sisendalakihi piiratud alades olevate joonte pikkuse j&auml;rgi.  
                </li>
                <li>Alade summeerimisel arvutatakse v&auml;hemuse ja enamuse v&auml;&auml;rtused sisendalakihi piiratud alades olevate alade j&auml;rgi.  
                </li>
            </ul>
            
        </div>
    </div>
    <div id="PercentShape">
        <div><h2>Lisa protsendid</h2></div>
        <hr/>
        <div>
            <p>Kui valite v&auml;lja, mille alusel r&uuml;hmitada, on see ruut lubatud. Valige  <b>Lisa protsendid</b>, kui soovite igas r&uuml;hmas leida iga atribuudiv&auml;&auml;rtuse protsendi.  Tulemtabelile lisatakse uus v&auml;li, mis sisaldab igas r&uuml;hmas k&otilde;igi atribuudiv&auml;&auml;rtuste protsente. Kui m&auml;rgite ka ruudu <b>Lisa v&auml;hemus, enamus</b>, lisatakse tulemkihile kaks t&auml;iendavat v&auml;lja, mis sisaldavad iga r&uuml;hma kohta v&auml;hemuse ja enamuse atribuudiv&auml;&auml;rtuste protsente.
            </p>
        </div>
    </div>
    <div id="ResultLayerName">
        <div><h2>Tulemkihi nimi</h2></div>
        <hr/>
        <div>
            <p>See on selle kihi nimi, mis luuakse jaotises  <b>Minu sisu</b> ja lisatakse kaardile.  Vaikenimi p&otilde;hineb t&ouml;&ouml;riista nimel ja sisendkihi nimel. Kui samanimeline kiht on juba olemas, palutakse teil sisestada m&otilde;ni muu nimi.
            </p>
            <p>Rippmen&uuml;&uuml;  <b>Salvesta tulemused</b> kaudu saate jaotises <b>Minu sisu</b> m&auml;&auml;rata selle kausta nime, kuhu tulemus salvestatakse.
            </p>
        </div>
    </div>
</div>
</html>
