<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="bdToolbox">
        <p> A geoanalitika elosztja az elemz&eacute;si feladatot itt: ArcGIS GeoAnalytics Server. &Iacute;gy t&ouml;bb g&eacute;p erej&eacute;t kihaszn&aacute;lva t&ouml;bb adatot elemezhet gyorsabban. Jelenleg az al&aacute;bbi eszk&ouml;z&ouml;k &eacute;rhetők el: <ul>
                <li> Pontok &ouml;sszevon&aacute;sa
                </li>
                <li> T&ouml;bbv&aacute;ltoz&oacute;s t&aacute;bl&aacute;zat fel&eacute;p&iacute;t&eacute;se
                </li>
                <li> Adathalmaz le&iacute;r&aacute;sa
                </li>
                <li> Vektoros elemek &ouml;sszekapcsol&aacute;sa
                </li>
                <li> Nyomvonal-rekonstrukci&oacute;
                </li>
                <li> Attrib&uacute;tumok &ouml;sszefoglal&aacute;sa
                </li>
                <li> Ter&uuml;leten bel&uuml;li &ouml;sszegz&eacute;s
                </li>
                <li> Geok&oacute;dol&aacute;si helysz&iacute;nek t&aacute;bl&aacute;zatb&oacute;l
                </li>
                <li> Bőv&iacute;t&eacute;s t&ouml;bbv&aacute;ltoz&oacute;s r&aacute;csh&aacute;l&oacute;b&oacute;l
                </li>
                <li> Incidensek &eacute;szlel&eacute;se
                </li>
                <li> Hasonl&oacute; helyek keres&eacute;se
                </li>
                <li> Sűrűs&eacute;g sz&aacute;m&iacute;t&aacute;sa
                </li>
                <li> Pontklaszterek keres&eacute;se
                </li>
                <li> Hot spotok keres&eacute;se
                </li>
                <li> Erdő alap&uacute; oszt&aacute;lyoz&aacute;s &eacute;s regresszi&oacute;
                </li>
                <li> Generaliz&aacute;lt line&aacute;ris regresszi&oacute;
                </li>
                <li> Buffer l&eacute;trehoz&aacute;sa
                </li>
                <li> Adat hozz&aacute;fűz&eacute;se
                </li>
                <li> Mező kisz&aacute;m&iacute;t&aacute;sa
                </li>
                <li> M&aacute;sol&aacute;s az adatt&aacute;rba
                </li>
                <li> Fedv&eacute;nyműveletek
                </li>
                <li> Hat&aacute;rok &ouml;sszeolvaszt&aacute;sa
                </li>
                <li> R&eacute;tegek &ouml;sszeilleszt&eacute;se
                </li>
                <li> Kiv&aacute;g&aacute;si r&eacute;teg 
                </li>
            </ul>
            
        </p>
        <p>A geoanalitika elsősorban nagy mennyis&eacute;gű adatot elemez, kiemelten figyelve a t&eacute;rbeli &eacute;s időbeli mint&aacute;kat. 
        </p>
    </div>
    <div id="SummarizeDataCategory" class="largesize">
        <h2>Summarize Data</h2>
        <hr/>
        <p> The Summarize Data toolset contains tools that calculate total counts, lengths, areas, and basic descriptive statistics of features and their attributes within areas or near other features.
            <ul>
                <li> <b>Aggregate Points</b> calculates statistics about points that fall within specified areas or bins.
                </li>
                <li> <b>Build Multi-Variable Grid</b> generates a grid of square or hexagonal bins and calculates values for each bin based on the proximity of each input layer.
                </li>
                <li> <b>Describe Dataset</b> calculates a summary of your input, and can optionally generate a sample of your input layer.
                </li>
                <li> <b>Join Features</b> calculates statistics about features that share a spatial, temporal, or attribute relationship with other features.
                </li>
                <li> <b>Reconstruct Tracks</b> calculates statistics about points or polygons that belong to the same track and reconstructs inputs into tracks.
                </li>
                <li> <b>Summarize Attributes</b> calculates statistics about feature or tabular data that share attributes.
                </li>
                <li> <b>Summarize Within</b> calculates statistics for area features and attributes that overlap each other.
                </li>
            </ul>
            
        </p>
    </div>
        <div id="AggregatePointsTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Pontok összevonása</h2></td>
                    <td>
                    <img src="../images/GUID-6C1620D9-D176-41FA-8283-833D8B1CCCFC-web.png" class="titleImage" alt="Pontok &ouml;sszevon&aacute;sa">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Ez az eszk&ouml;z egy pont-t&iacute;pus&uacute; vektoros elemeket tartalmaz&oacute; r&eacute;teg &eacute;s vagy egy ter&uuml;let vektoros elemeket tartalmaz&oacute; r&eacute;teg vagy meghat&aacute;rozott t&aacute;vols&aacute;ggal defini&aacute;lt gyűjtők haszn&aacute;lat&aacute;val meghat&aacute;rozza, hogy mely pontok esnek az egyes ter&uuml;leteken vagy gyűjtők&ouml;n bel&uuml;l, &eacute;s kisz&aacute;m&iacute;tja az &ouml;sszes pont statisztikai adatait az egyes ter&uuml;leteken vagy gyűjtők&ouml;n bel&uuml;l. Ezzel az eszk&ouml;zzel időszeleteket is haszn&aacute;lhat. 
            </p>
            <p>Ilyenre p&eacute;ld&aacute;k a k&ouml;vetkezők:
                <ul>
                    <li>A bűnt&eacute;nyek pontszerűen megadott hely&eacute;t alapul v&eacute;ve kisz&aacute;m&iacute;thatja a megy&eacute;nk&eacute;nt vagy m&aacute;s k&ouml;zigazgat&aacute;si k&ouml;rzetenk&eacute;nt előfordult bűnt&eacute;nyek sz&aacute;m&aacute;t.
                    </li>
                    <li>Megkeresheti a franchise &uuml;zletek &aacute;ltal el&eacute;rt legnagyobb &eacute;s legkisebb havi bev&eacute;telt 100 kilom&eacute;teres gyűjtőket haszn&aacute;lva.
                    </li>
                </ul>
                
            </p>
            <br/>
        </div>
        <div id="BuildMultiVariableGridTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Többváltozós táblázat felépítése</h2></td>
                    <td>
                    <img src="../images/GUID-B78AB95A-E412-4983-ADBA-3678BF207A79-web.png" class="titleImage" alt="Az Adat hozz&aacute;fűz&eacute;se munkafolyamat&aacute;nak diagramja">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>A T&ouml;bbv&aacute;ltoz&oacute;s t&aacute;bl&aacute;zat fel&eacute;p&iacute;t&eacute;se eszk&ouml;z n&eacute;gysz&ouml;g vagy hatsz&ouml;g alak&uacute; gyűjtőket tartalmaz&oacute; r&aacute;csh&aacute;l&oacute;t hoz l&eacute;tre, &eacute;s mindegyik gyűjtőh&ouml;z v&aacute;ltoz&oacute;kat sz&aacute;m&iacute;t egy vagy t&ouml;bb bemenő r&eacute;teg k&ouml;zels&eacute;ge alapj&aacute;n.
            </p>
            <p>Ilyenre p&eacute;ld&aacute;k a k&ouml;vetkezők:
                <ul>
                    <li>Tegy&uuml;k fel, hogy adva van t&ouml;bb, t&ouml;megk&ouml;zleked&eacute;si infrastrukt&uacute;r&aacute;t tartalmaz&oacute; r&eacute;teg. A v&aacute;ros melyik r&eacute;sze a legnehezebben el&eacute;rhető t&ouml;megk&ouml;zleked&eacute;ssel?
                    </li>
                    <li>Tegy&uuml;k fel, hogy adva vannak v&iacute;zi utakat tartalmaz&oacute; r&eacute;tegek. Mi a neve az egyes helyekhez legk&ouml;zelebb eső v&iacute;zt&ouml;megnek az Egyes&uuml;lt &Aacute;llamokban?
                    </li>
                    <li>Tegy&uuml;k fel, hogy adva van egy, a h&aacute;ztart&aacute;sok j&ouml;vedelm&eacute;t tartalmaz&oacute; r&eacute;teg. Az Egyes&uuml;lt &Aacute;llamokban hol a legnagyobb a j&ouml;vedelmek vari&aacute;ci&oacute;ja a k&ouml;rnyező 50 m&eacute;rf&ouml;lden bel&uuml;l?
                    </li>
                </ul>
                
            </p>
            <br/>
        </div>
        <div id="DescribeDatasetTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Adathalmaz leírása</h2></td>
                    <td>
                    <img src="../images/GUID-972BB93A-AEF8-4701-9890-7AE52391CA69-web.png" class="titleImage" alt="Adathalmaz munkafolyamat le&iacute;r&aacute;sa diagram">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Bemeneti vektoros elemek &ouml;sszegz&eacute;se statisztik&aacute;kkal, mintar&eacute;tegekkel &eacute;s vizualiz&aacute;l&aacute;ssal. Kimenetnek v&aacute;laszthat egy mintar&eacute;teget vagy egy kiterjed&eacute;si r&eacute;teget.
            </p>
            <p>Erre p&eacute;ld&aacute;k a k&ouml;vetkezők:
                <ul>
                    <li>Hivatkoz&aacute;s a kisz&aacute;m&iacute;tott &ouml;sszes&iacute;tő statisztik&aacute;kra annak meg&aacute;llap&iacute;t&aacute;s&aacute;ra, milyen &eacute;rt&eacute;keket tartalmaz az adathalmaz.
                    </li>
                    <li>A teljes adathalmaz rajzol&aacute;sa helyett hozzon l&eacute;tre egy r&eacute;szcsoport-r&eacute;teget a vektoros elemek &eacute;s attrib&uacute;tumaik vizualiz&aacute;l&aacute;s&aacute;ra, amikor azok hozz&aacute;ad&aacute;sra ker&uuml;lnek a t&eacute;rk&eacute;phez.
                    </li>
                    <li>Takar&iacute;tson meg időt &eacute;s forr&aacute;sokat, &eacute;s mielőtt a teljes adathalmazon futtatna elemz&eacute;st, futtasson elemz&eacute;st egy mintar&eacute;tegen.
                    </li>
                </ul>
                
            </p>
            <br/>
        </div>
        <div id="JoinFeaturesTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Vektoros elemek összekapcsolása</h2></td>
                    <td>
                    <img src="../images/GUID-900E33CD-3789-45B5-8F0C-92D91E64D2A4-web.png" class="titleImage" alt="Vektoros elemek &ouml;sszekapcsol&aacute;sa">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Vektoros r&eacute;tegeket vagy t&aacute;bl&aacute;zatos adatokat haszn&aacute;lva vektoros elemeket &eacute;s rekordokat kapcsolhat &ouml;ssze a bemenő r&eacute;tegek vagy t&aacute;bl&aacute;zatok k&ouml;z&ouml;tti egyedi kapcsolatok alapj&aacute;n.  Az &ouml;sszekapcsol&aacute;sokat t&eacute;rbeli, időbeli &eacute;s attrib&uacute;tumok k&ouml;z&ouml;tti kapcsolatok hat&aacute;rozz&aacute;k meg, &eacute;s ak&aacute;r &ouml;sszes&iacute;tő statisztik&aacute;k is sz&aacute;m&iacute;that&oacute;k.  
            </p>
            <p>Ilyenre p&eacute;ld&aacute;k a k&ouml;vetkezők:
                <ul>
                    <li>Tegy&uuml;k fel, hogy rendelkez&eacute;sre &aacute;llnak bűncselekm&eacute;nyek helyei &eacute;s időpontjai; kapcsolja &ouml;ssze a bűncselekm&eacute;nyek adatait &ouml;nmagukkal, t&eacute;rbeli kapcsolatot meghat&aacute;rozva olyan bűncselekm&eacute;nyek k&ouml;z&ouml;tt, amelyek egym&aacute;st&oacute;l 1 kilom&eacute;ter t&aacute;vols&aacute;gon bel&uuml;l &eacute;s 1 &oacute;r&aacute;n bel&uuml;l t&ouml;rt&eacute;ntek, &eacute;s &aacute;llap&iacute;tsa meg, hogy t&ouml;rt&eacute;nt-e egym&aacute;shoz t&eacute;rben &eacute;s időben k&ouml;zeli bűncselekm&eacute;nyek sorozata.
                    </li>
                    <li>Tegy&uuml;k fel, hogy rendelkez&eacute;sre &aacute;ll egy ir&aacute;ny&iacute;t&oacute;sz&aacute;mokhoz kapcsolt demogr&aacute;fiai adatokat tartalmaz&oacute; t&aacute;bl&aacute;zat &eacute;s lak&oacute;&eacute;p&uuml;leteket le&iacute;r&oacute; ter&uuml;let vektoros elemek; kapcsolja &ouml;ssze a demogr&aacute;fiai inform&aacute;ci&oacute;kat a lakc&iacute;mekkel, hogy a lakc&iacute;mek is rendelkezzenek ugyanezekkel az inform&aacute;ci&oacute;kkal.
                    </li>
                </ul>
                
            </p>
            <br/>
        </div>
        <div id="ReconstructTracksTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Nyomvonal-rekonstrukció</h2></td>
                    <td>
                    <img src="../images/GUID-80807DB7-0CA7-4FD8-9702-B4486285D4FC-web.png" class="titleImage" alt="Nyomvonal-rekonstrukci&oacute;">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Ez az eszk&ouml;z  <code>időpillanatot</code> le&iacute;r&oacute;, pontszerű vagy polygon vektoros elemek időb&eacute;lyeggel ell&aacute;tott r&eacute;teg&eacute;t haszn&aacute;lva meghat&aacute;rozza, hogy a bemeneti vektoros elemek k&ouml;z&uuml;l melyek tartoznak egy nyomvonalhoz, &eacute;s időbeli sorrendbe rendezi a bemeneteket. Lehetős&eacute;g van a bemeneti vektoros elemek statisztik&aacute;inak kisz&aacute;m&iacute;t&aacute;s&aacute;ra is az egyes nyomvonalakon bel&uuml;l.
            </p>
            <p>Ilyenre p&eacute;ld&aacute;k a k&ouml;vetkezők:
                <ul>
                    <li>Egy hurrik&aacute;nra vonatkoz&oacute;an adott helyekből &eacute;s időpontokb&oacute;l sz&aacute;m&iacute;tsa ki a hurrik&aacute;n &aacute;tlagos sz&eacute;lsebess&eacute;g&eacute;t &eacute;s legnagyobb sz&eacute;lnyom&aacute;s&aacute;t.
                    </li>
                    <li>Haj&oacute;kra vonatkoz&oacute; GPS-m&eacute;r&eacute;sekből rekonstru&aacute;lja vonal form&aacute;j&aacute;ban a haj&oacute; &uacute;tvonalait. 
                    </li>
                </ul>
                
            </p>
            <br/>
        </div>
        <div id="SummarizeAttributesTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Attribútumok összefoglalása</h2></td>
                    <td>
                    <img src="../images/GUID-F64B533F-B0BB-4519-9F31-BCF814084999-web.png" class="titleImage" alt="Attrib&uacute;tumok &ouml;sszefoglal&aacute;sa diagram">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Ez az eszk&ouml;z vektoros elemek vagy t&aacute;bl&aacute;zatos adatok alapj&aacute;n &ouml;sszes&iacute;tő statisztik&aacute;kat k&eacute;sz&iacute;t meghat&aacute;rozott mezőkh&ouml;z. 
            </p>
            <p>Ilyenre p&eacute;ld&aacute;k a k&ouml;vetkezők:
                <ul>
                    <li>Tegy&uuml;k fel, hogy a(z)  <i>COMPANY_NAME</i> mezőben rendelkez&eacute;sre &aacute;llnak &eacute;lelmiszerboltok helyei; &ouml;sszes&iacute;tse a boltokat a v&aacute;llalat neve alapj&aacute;n, &eacute;s sz&aacute;m&iacute;tson kis statisztik&aacute;kat mindegyik v&aacute;llalathoz.
                    </li>
                    <li>Tegy&uuml;k fel, hogy a(z)  <i>COMPANY_NAME</i> &eacute;s <i>COUNTY</i> mezőkkel rendelkező t&aacute;bl&aacute;zatban rendelkez&eacute;sre &aacute;llnak &eacute;lelmiszerboltok helyei; &ouml;sszes&iacute;tse a boltokat a v&aacute;llalat neve &eacute;s a megye alapj&aacute;n, &eacute;s sz&aacute;m&iacute;tson kis statisztik&aacute;kat mindegyik v&aacute;llalathoz &eacute;s megy&eacute;hez.
                    </li>
                </ul>
                
            </p>
            <br/>
        </div>
        <div id="SummarizeWithinTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Területen belüli összegzés</h2></td>
                    <td>
                    <img src="../images/GUID-9B12DB3F-AA7B-41EB-87C6-D2DEC3D52DA9-web.png" class="titleImage" alt="Ter&uuml;leten bel&uuml;li &ouml;sszegz&eacute;s">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Megkeresi azokat a ter&uuml;leteket (&eacute;s ter&uuml;letr&eacute;szeket), ahol k&eacute;t r&eacute;teg &aacute;tfedi egym&aacute;st, &eacute;s kisz&aacute;m&iacute;tja a fedv&eacute;ny statisztikai adatait. 
            </p>
            <p>Ilyenre p&eacute;ld&aacute;k a k&ouml;vetkezők:
                <ul>
                    <li>V&iacute;zgyűjtő ter&uuml;leteket &eacute;s egy felsz&iacute;nhaszn&aacute;lati t&iacute;pusokat tartalmaz&oacute; r&eacute;teg eset&eacute;n kisz&aacute;m&iacute;thatja a f&ouml;ldter&uuml;letek nagys&aacute;g&aacute;t felsz&iacute;nhaszn&aacute;lati t&iacute;pusonk&eacute;nt mindegyik v&iacute;zgyűjtő ter&uuml;letre. 
                    </li>
                    <li>Egy megye parcell&aacute;it &eacute;s telep&uuml;l&eacute;shat&aacute;rait tartalmaz&oacute; r&eacute;teg eset&eacute;n &ouml;sszes&iacute;theti a telep&uuml;l&eacute;seken bel&uuml;li szabad parcell&aacute;k &aacute;tlagos &eacute;rt&eacute;keit.
                    </li>
                </ul>
                
            </p>
            <br/>
        </div>
    <div id="FindLocationsCategory" class="regularsize">
        <h2>Helyek keresése</h2>
        <hr/>
        <p>Ezekkel az eszk&ouml;z&ouml;kkel az &Ouml;n &aacute;ltal megadott k&uuml;l&ouml;nf&eacute;le krit&eacute;riumokat kiel&eacute;g&iacute;tő ter&uuml;letek azonos&iacute;that&oacute;k.   
            <ul>
                <li>Az  <b>Incidensek &eacute;szlel&eacute;se</b> időb&eacute;lyeggel ell&aacute;tott r&eacute;tegek seg&iacute;ts&eacute;g&eacute;vel &aacute;llap&iacute;tja meg, hogy melyik vektoros elemek felelnek meg egy meghat&aacute;rozott felt&eacute;telnek.
                </li>
                <li>A  <b>Geok&oacute;dol&aacute;si helysz&iacute;nek t&aacute;bl&aacute;zatb&oacute;l</b> c&iacute;meket koordin&aacute;t&aacute;kk&aacute; alak&iacute;t.
                </li>
                <li>A  <b>Hasonl&oacute; helyek keres&eacute;se</b> a megadott krit&eacute;riumokon alapul&oacute; egy vagy t&ouml;bb vonatkoztat&aacute;si helyhez hasonl&oacute; helyeket keres.
                </li>
            </ul>
            
        </p>
    </div>
        <div id="DetectIncidentsTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Incidensek észlelése</h2></td>
                    <td>
                    <img src="../images/GUID-E2A3AB39-5151-4972-A988-EBC91C41EB1F-web.png" class="titleImage" alt="Incidensek &eacute;szlel&eacute;se">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Ez az eszk&ouml;z pontok, vonalak, ter&uuml;letek vagy t&aacute;bl&aacute;zatok időb&eacute;lyeggel ell&aacute;tott, egy időpillanatot le&iacute;r&oacute; r&eacute;teg&eacute;vel dolgozik.   Az eszk&ouml;z nyomvonalnak nevezett, sorba rendezett vektoros elemeket haszn&aacute;lva meg&aacute;llap&iacute;tja, hogy melyik vektoros elemek &eacute;rdeklőd&eacute;sre sz&aacute;mot tart&oacute; incidensek. Az incidensek fogalm&aacute;t az &Ouml;n &aacute;ltal meghat&aacute;rozott felt&eacute;telek szabj&aacute;k meg. 
            </p>
            <p>Ilyenre p&eacute;ld&aacute;k a k&ouml;vetkezők:
                <ul>
                    <li>4. kateg&oacute;ri&aacute;j&uacute; hurrik&aacute;nok felismer&eacute;se hurrik&aacute;nok m&eacute;rt adataib&oacute;l a sz&eacute;lsebess&eacute;g attrib&uacute;tum alapj&aacute;n.
                    </li>
                    <li>Egy haj&oacute; mozg&aacute;s&aacute;nak GPS-m&eacute;r&eacute;seit haszn&aacute;lva a haj&oacute; sebess&eacute;g&eacute;t le&iacute;r&oacute; mezőből keresse meg azokat a m&eacute;r&eacute;seket, amelyek &eacute;rt&eacute;ke nagyobb, mint az előző &ouml;t m&eacute;r&eacute;s &aacute;tlag&aacute;nak 1,5-szerese.
                    </li>
                </ul>
                
            </p>
            <br/>
        </div>
        <div id="GeocodeLocationsfromTableTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Geokódolási helyszínek táblázatból</h2></td>
                    <td>
                    <img src="../images/GUID-E4194410-7BBF-4349-98C9-22781D35183E-web.png" class="titleImage" alt="Geok&oacute;dol&aacute;si helysz&iacute;nek t&aacute;bl&aacute;zatb&oacute;l">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>A c&iacute;meket koordin&aacute;t&aacute;kk&aacute; alak&iacute;tja &aacute;t. Ezt az eszk&ouml;zt big data-f&aacute;jlmegoszt&oacute; t&aacute;bl&aacute;zatokon haszn&aacute;lja.
            </p>
            <br/>
        </div>
        <div id="FindSimilarLocationsTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Hasonló helyek keresése</h2></td>
                    <td>
                    <img src="../images/GUID-6262A84E-9087-4E48-930E-E9B89FECC836-web.png" class="titleImage" alt="Hasonl&oacute; helyek keres&eacute;se">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Az eszk&ouml;z hasonl&oacute; helyeket keres a megadott krit&eacute;riumok alapj&aacute;n &uacute;gy, hogy megm&eacute;ri a vizsg&aacute;lt lehets&eacute;ges keres&eacute;si r&eacute;teg helyeinek egy vagy t&ouml;bb vonatkoztat&aacute;si helyhez val&oacute; hasonl&oacute;s&aacute;g&aacute;t. 
            </p>
            <p>Ilyenre p&eacute;ld&aacute;k a k&ouml;vetkezők: 
                <ul>
                    <li>Keresse meg az egym&aacute;shoz legink&aacute;bb hasonl&iacute;t&oacute; t&iacute;z boltot az alkalmazottak sz&aacute;m&aacute;t &eacute;s az &eacute;ves &aacute;rbev&eacute;telt vizsg&aacute;lva.
                    </li>
                    <li>Keresse meg az egym&aacute;shoz legink&aacute;bb hasonl&iacute;t&oacute; 100 v&aacute;rost a n&eacute;pess&eacute;g, az &eacute;ves n&ouml;veked&eacute;s &eacute;s az ad&oacute;bev&eacute;telek k&ouml;z&ouml;tti kapcsolatot vizsg&aacute;lva.
                    </li>
                </ul>
                
            </p>
            <br/>
        </div>
    <div id="AnalyzePatternsCategory" class="largesize">
        <h2>Mintázatok elemzése</h2>
        <hr/>
        <p>  Az al&aacute;bbi eszk&ouml;z&ouml;k seg&iacute;tenek azonos&iacute;tani, mennyis&eacute;gileg meghat&aacute;rozni &eacute;s megjelen&iacute;teni az adatok t&eacute;rbeli mint&aacute;zatait.
            <ul>
                <li>A  <b>Sűrűs&eacute;g sz&aacute;m&iacute;t&aacute;sa</b> bizonyos jelens&eacute;gek ismert mennyis&eacute;geit ter&iacute;ti sz&eacute;t a t&eacute;rk&eacute;pen.
                </li>
                <li>A  <b>Hot spotok keres&eacute;se</b> meghat&aacute;rozza a statisztikailag szignifik&aacute;ns klaszterez&eacute;st az adatok t&eacute;rbeli mint&aacute;zat&aacute;ban.
                </li>
                <li>A  <b>Pontklaszterek keres&eacute;se</b> pontszerű vektoros elemek klasztereit keresi a k&ouml;rnyező zajban a t&eacute;rbeli eloszl&aacute;suk alapj&aacute;n.
                </li>
                <li>Az  <b>Erdő alap&uacute; oszt&aacute;lyoz&aacute;s &eacute;s regresszi&oacute; eszk&ouml;z</b> modelleket hoz l&eacute;tre, &eacute;s előrejelz&eacute;seket gener&aacute;l Leo Breiman v&eacute;letlen erdő algoritmus&aacute;nak adapt&aacute;ci&oacute;j&aacute;t alkalmazva, amely egy fel&uuml;gyelt g&eacute;pi tanul&aacute;si m&oacute;dszer
                </li>
                <li>A  <b>Generaliz&aacute;lt line&aacute;ris regresszi&oacute;</b> előrejelz&eacute;seket hoz l&eacute;tre, vagy egy f&uuml;ggő v&aacute;ltoz&oacute;t modellez magyar&aacute;z&oacute; v&aacute;ltoz&oacute;khoz val&oacute; kapcsolata tekintet&eacute;ben.
                </li>
            </ul>
            
        </p>
    </div>
        <div id="CalculateDensityTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Sűrűség számítása</h2></td>
                    <td>
                    <img src="../images/GUID-38AD3C19-0400-4E5A-9282-BDE42F2BBFC1-web.png" class="titleImage" alt="Sűrűs&eacute;g sz&aacute;m&iacute;t&aacute;sa">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>A Sűrűs&eacute;g sz&aacute;m&iacute;t&aacute;sa eszk&ouml;z sűrűs&eacute;gt&eacute;rk&eacute;pet hoz l&eacute;tre pont-t&iacute;pus&uacute; vektoros elemekből egy bizonyos (a pontok attrib&uacute;tumai &aacute;ltal k&eacute;pviselt) jelens&eacute;g ismert mennyis&eacute;geit kiterjesztve a t&eacute;rk&eacute;pen. Az eredm&eacute;ny a sűrűs&eacute;get &aacute;br&aacute;zol&oacute; ter&uuml;leteket tartalmaz&oacute; r&eacute;teg.
            </p>
            <p>Ilyenre p&eacute;ld&aacute;k a k&ouml;vetkezők:
                <ul>
                    <li>A megy&eacute;ben tal&aacute;lhat&oacute; k&oacute;rh&aacute;zak sűrűs&eacute;g&eacute;nek kisz&aacute;m&iacute;t&aacute;sa.  Az eredm&eacute;nyr&eacute;teg mutatja azokat a ter&uuml;leteket, ahol magas &eacute;s alacsony a k&oacute;rh&aacute;zak el&eacute;rhetős&eacute;ge, &eacute;s ez az inform&aacute;ci&oacute; felhaszn&aacute;lhat&oacute; annak eld&ouml;nt&eacute;s&eacute;re, hogy hol &eacute;p&uuml;ljenek &uacute;j k&oacute;rh&aacute;zak.
                    </li>
                    <li>Olyan ter&uuml;letek azonos&iacute;t&aacute;sa, ahol magas az erdőtűz kock&aacute;zata a kor&aacute;bbi helysz&iacute;ne alapj&aacute;n.
                    </li>
                    <li>A nagyobb fő&uacute;tvonalakt&oacute;l t&aacute;vol &eacute;lő k&ouml;z&ouml;ss&eacute;gek hely&eacute;nek meghat&aacute;roz&aacute;sa, annak megtervez&eacute;s&eacute;hez, hogy hol &eacute;p&uuml;ljenek &uacute;j utak.
                    </li>
                </ul>
                
            </p>
            <br/>
        </div>
        <div id="FindPointClustersTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Pontklaszterek keresése</h2></td>
                    <td>
                    <img src="../images/GUID-40DA7286-67EA-4333-91C5-4CD527C21B4A-web.png" class="titleImage" alt="Pontklaszterek keres&eacute;se">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>A Pontklaszterek keres&eacute;se eszk&ouml;z pontszerű vektoros elemek klasztereit keresi a k&ouml;rnyező zajban a t&eacute;rbeli eloszl&aacute;suk alapj&aacute;n.
            </p>
            <p>Erre p&eacute;ld&aacute;k a k&ouml;vetkezők:
                <ul>
                    <li>Keresse meg a k&aacute;rtevők &aacute;ltal el&aacute;rasztott h&aacute;ztart&aacute;sok klasztereit a c&eacute;lzott irt&aacute;s előseg&iacute;t&eacute;s&eacute;hez.  
                    </li>
                    <li>K&eacute;sz&iacute;tsen t&aacute;j&eacute;koztat&aacute;st &eacute;s seg&iacute;tse a ment&eacute;si &eacute;s evaku&aacute;l&aacute;si munk&aacute;t a klaszeterek m&eacute;rete &eacute;s elhelyezked&eacute;se alapj&aacute;n f&ouml;ldrajzi helyhez kapcsolt tweetek seg&iacute;ts&eacute;g&eacute;vel term&eacute;szeti katasztr&oacute;f&aacute;k &eacute;s terroristat&aacute;mad&aacute;sok ut&aacute;n.
                    </li>
                </ul>
                
            </p>
            <br/>
        </div>
        <div id="FindHotSpotsTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Hot spotok keresése</h2></td>
                    <td>
                    <img src="../images/GUID-6D600155-AA9B-4F02-AD8B-2E84150AB743-web.png" class="titleImage" alt="Hot spotok keres&eacute;se">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>A Hot spotok keres&eacute;se eszk&ouml;zzel meghat&aacute;rozhat&oacute;, hogy l&eacute;teznek-e statisztikailag szignifik&aacute;ns klaszterek az adatok t&eacute;rbeli mint&aacute;zat&aacute;ban. 
                <ul>
                    <li>Val&oacute;ban klaszterezettek a kiv&aacute;lasztott pontok (bűnt&eacute;nyek, f&aacute;k, k&ouml;zleked&eacute;si balesetek)?  Hogyan tudhatja biztosan?
                    </li>
                    <li>Val&oacute;ban statisztikailag szignifik&aacute;ns hot spotra bukkant (kiad&aacute;sok, gyermekhaland&oacute;s&aacute;g, k&ouml;vetkezetesen magas vizsgapontsz&aacute;mok), vagy m&aacute;st sugallna a t&eacute;rk&eacute;p, ha megv&aacute;ltoztatn&aacute; a jelk&eacute;pez&eacute;s m&oacute;dj&aacute;t?
                    </li>
                </ul>
                A Hot spotok keres&eacute;se eszk&ouml;z seg&iacute;t megb&iacute;zhat&oacute; v&aacute;laszt tal&aacute;lni az ilyen k&eacute;rd&eacute;sekre.
            </p>
            <br/>
        </div>
        <div id="ForestBasedClassificationAndRegressionTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Erdő alapú osztályozás és regresszió</h2></td>
                    <td>
                    <img src="../images/GUID-AD37EC59-C890-49AC-BD28-2E87F99A08E9-web.png" class="titleImage" alt="Erdő alap&uacute; oszt&aacute;lyoz&aacute;s &eacute;s regresszi&oacute; munkafolyamat&aacute;nak diagramja">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Az Erdő alap&uacute; oszt&aacute;lyoz&aacute;s &eacute;s regresszi&oacute; eszk&ouml;z modelleket hoz l&eacute;tre, &eacute;s előrejelz&eacute;seket gener&aacute;l Leo Breiman v&eacute;letlen erdő algoritmus&aacute;nak adapt&aacute;ci&oacute;j&aacute;t alkalmazva, amely egy fel&uuml;gyelt g&eacute;pi tanul&aacute;si m&oacute;dszer
            </p>
            <p>Erre p&eacute;ld&aacute;k a k&ouml;vetkezők:
                <ul>
                    <li>Ha vannak adataink a tengerifű előfordul&aacute;s&aacute;r&oacute;l, tov&aacute;bb&aacute; vannak attrib&uacute;tumk&eacute;nt reprezent&aacute;lt k&ouml;rnyezeti magyar&aacute;z&oacute; v&aacute;ltoz&oacute;ink (amelyeket  t&ouml;bbv&aacute;ltoz&oacute;s r&aacute;csh&aacute;l&oacute;b&oacute;l bőv&iacute;tett&uuml;nk, kisz&aacute;m&iacute;tva az &aacute;r ir&aacute;ny&aacute;val ellent&eacute;tes ir&aacute;nyban tal&aacute;lhat&oacute; gy&aacute;rak &eacute;s nagy kik&ouml;tők t&aacute;vols&aacute;g&aacute;t), akkor előrejelz&eacute;st tudunk k&eacute;sz&iacute;teni a tengerifű j&ouml;vőbeli előfordul&aacute;s&aacute;r&oacute;l a k&ouml;rnyezeti magyar&aacute;z&oacute; v&aacute;ltoz&oacute;k j&ouml;vőre t&ouml;rt&eacute;nő kivet&iacute;t&eacute;s&eacute;vel.
                          
                    </li>
                    <li>Tegy&uuml;k fel, hogy vannak term&eacute;sre vonatkoz&oacute; adataink az orsz&aacute;g k&uuml;l&ouml;nb&ouml;ző r&eacute;szein tal&aacute;lhat&oacute; t&ouml;bb sz&aacute;z farm vonatkoz&aacute;s&aacute;ban, valamint vannak egy&eacute;b attrib&uacute;tumaink a farmok vonatkoz&aacute;s&aacute;ban (munkv&aacute;llal&oacute;k sz&aacute;ma, f&ouml;ldter&uuml;let stb). Ezen adatok haszn&aacute;lat&aacute;val olyan vektoros elemeket hozhatunk l&eacute;tre, amelyek azokat a farmokat reprezent&aacute;lj&aacute;k, ahol nincs term&eacute;sadat (de az &ouml;sszes t&ouml;bbi v&aacute;ltoz&oacute; megvan), &eacute;s előrejelz&eacute;st k&eacute;sz&iacute;thet&uuml;nk a term&eacute;sről.
                    </li>
                    <li>Lak&aacute;sokra vonatkoz&oacute; &eacute;rt&eacute;keket jelezhet&uuml;nk előre a foly&oacute; &eacute;vben eladott lak&aacute;sok &aacute;ra alapj&aacute;n. Az adatok alapj&aacute;n (lak&aacute;sok elad&aacute;si &aacute;ra, h&aacute;l&oacute;szob&aacute;k sz&aacute;ma, iskol&aacute;kt&oacute;l val&oacute; t&aacute;vols&aacute;g, nagyobb fő&uacute;tvonalakt&oacute;l val&oacute; t&aacute;vols&aacute;g, &aacute;tlagj&ouml;vedelem, bűncselekm&eacute;nyek sz&aacute;ma) előrejelezhetj&uuml;k a hasonl&oacute; lak&aacute;sok elad&aacute;si &aacute;r&aacute;t.
                         
                    </li>
                </ul>
                
            </p>
            <br/>
        </div>
        <div id="GeneralizedLinearRegressionTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Generalizált lineáris regresszió</h2></td>
                    <td>
                    <img src="../images/GUID-4E435A7B-8EC1-4020-9D92-DE88E8E8BBB1-web.png" class="titleImage" alt="Generaliz&aacute;lt line&aacute;ris regresszi&oacute; munkafolyamat diagramja">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>A Generaliz&aacute;lt line&aacute;ris regresszi&oacute; eszk&ouml;z  előrejelz&eacute;seket hoz l&eacute;tre, vagy egy f&uuml;ggő v&aacute;ltoz&oacute;t modellez magyar&aacute;z&oacute; v&aacute;ltoz&oacute;khoz val&oacute; kapcsolata tekintet&eacute;ben.  Az eszk&ouml;z haszn&aacute;lhat&oacute; folytonos (OLS), bin&aacute;ris (logisztikus modell) &eacute;s sz&aacute;m&iacute;t&aacute;si modellek (Poisson-modell) illeszt&eacute;s&eacute;re.
            </p>
            <p>Erre p&eacute;ld&aacute;k a k&ouml;vetkezők:
                <ul>
                    <li>Milyen demogr&aacute;fiai jellemzők j&aacute;rulnak hozz&aacute; a t&ouml;megk&ouml;zleked&eacute;s haszn&aacute;lat&aacute;nak magas szintj&eacute;hez?
                    </li>
                    <li>Van &ouml;sszef&uuml;gg&eacute;s a vandalizmus &eacute;s a bet&ouml;r&eacute;sek k&ouml;z&ouml;tt?
                    </li>
                    <li>Milyen v&aacute;ltoz&oacute;kkal lehet hat&eacute;konyan megj&oacute;solni a 911-es seg&eacute;lyh&iacute;v&oacute;hoz befut&oacute; h&iacute;v&aacute;sok sz&aacute;m&aacute;t?  A j&ouml;vőre t&ouml;rt&eacute;nő kivet&iacute;t&eacute;sek alapj&aacute;n mekkora sz&uuml;ks&eacute;glet v&aacute;rhat&oacute; a v&eacute;szhelyzeti v&aacute;laszad&aacute;si forr&aacute;sokra?
                    </li>
                    <li>Milyen v&aacute;ltoz&oacute;kkal f&uuml;gg &ouml;ssze az alacsony sz&uuml;let&eacute;ssz&aacute;m?
                    </li>
                </ul>
                
            </p>
            <br/>
        </div>
    <div id="UseProximityCategory" class="smallsize">
        <h2>Közelség használata</h2>
        <hr/>
        <p>Ezek az eszk&ouml;z&ouml;k seg&iacute;tenek v&aacute;laszt adni a t&eacute;rbeli elemz&eacute;sn&eacute;l leggyakrabban feltett k&eacute;rd&eacute;sek egyik&eacute;re: Mi mihez van k&ouml;zel?
            <ul>
                <li>A  <b>Buffer l&eacute;trehoz&aacute;sa</b> eszk&ouml;z vektoros elemektől meghat&aacute;rozott t&aacute;vols&aacute;gra l&eacute;vő ter&uuml;letek hoz l&eacute;tre.
                </li>
            </ul>
            
        </p>
    </div>
        <div id="CreateBuffersTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Buffer létrehozása</h2></td>
                    <td>
                    <img src="../images/GUID-6E648C49-37F9-4673-82D5-DB646921A828-web.png" class="titleImage" alt="Buffer l&eacute;trehoz&aacute;sa">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>A buffer egy pontszerű, vonalas vagy polygon t&iacute;pus&uacute; vektoros elemtől egy meghat&aacute;rozott t&aacute;vols&aacute;got lefedő ter&uuml;let.
            </p>
            <p>Ilyenre p&eacute;ld&aacute;k a k&ouml;vetkezők:
                <ul>
                    <li>Line&aacute;ris foly&oacute;t reprezent&aacute;l&oacute; vektoros elemeket haszn&aacute;lva k&eacute;sz&iacute;tsen mindegyik v&iacute;zfoly&aacute;shoz az adott v&iacute;zfoly&aacute;s sz&eacute;less&eacute;g&eacute;nek 50-szeres&eacute;t kitevő buffert, &eacute;s hat&aacute;rozza meg az &aacute;rt&eacute;r hat&aacute;rvonal&aacute;t.
                    </li>
                    <li>Orsz&aacute;gokat le&iacute;r&oacute; ter&uuml;letekből k&eacute;sz&iacute;tsen mindegyik orsz&aacute;ghoz 200 tengeri m&eacute;rf&ouml;ldnek megfelelő buffert, &eacute;s hat&aacute;rozza meg a tengeri hat&aacute;rvonalat.  
                    </li>
                </ul>
                
            </p>
            <br/>
        </div>
    <div id="ManageDataCategory" class="largesize">
        <h2>Manage Data</h2>
        <hr/>
        <p>These tools are used for the day-to-day management of geographic and tabular data. 
            <ul>
                <li> <b>Append Data</b> appends features to an existing hosted feature layer.
                </li>
                <li> <b>Calculate Field</b> creates a new field or modifies an existing field and creates a new layer in your contents.
                </li>
                <li> <b>Clip Layer</b> copies features that intersect a defined area of interest. 
                </li>
                <li> <b>Copy to Data Store</b> copies data to your ArcGIS Data Store and creates a layer in your contents. 
                </li>
                <li> <b>Dissolve Boundaries</b> merges areas that share a common boundary or attribute value.
                </li>
                <li> <b>Merge Layers</b> copies all features from two layers into a single result layer.
                </li>
                <li> <b>Overlay Layers</b> combines two or more layers into a single layer.
                </li>
            </ul>
            
        </p>
    </div>
        <div id="CopyToDataStoreTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Másolás az adattárba</h2></td>
                    <td>
                    <img src="../images/GUID-4030C721-25E4-41C0-A240-B18E869FC434-web.png" class="titleImage" alt="M&aacute;sol&aacute;s az adatt&aacute;rba">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Egy bemenő vektoros r&eacute;teget vagy t&aacute;bl&aacute;zatot egy  ArcGIS Data Store adatt&aacute;rba m&aacute;sol, &eacute;s egy r&eacute;teget hoz l&eacute;tre a saj&aacute;t tartalomban az  ArcGIS Enterprise alkalmaz&aacute;sban. </p>
            <p>Ilyenre p&eacute;ld&aacute;k a k&ouml;vetkezők:
                <ul>
                    <li> <code>.csv</code>-f&aacute;jlok gyűjtem&eacute;ny&eacute;nek m&aacute;sol&aacute;sa big data-f&aacute;jlmegoszt&oacute;ba a t&eacute;rbeli-időbeli adatt&aacute;rba megjelen&iacute;t&eacute;s &eacute;rdek&eacute;ben.
                    </li>
                    <li>Az aktu&aacute;lis t&eacute;rk&eacute;pkiterjed&eacute;s t&eacute;rbeli-időbeli adatt&aacute;rban t&aacute;rolt vektoros elemeinek m&aacute;sol&aacute;sa a rel&aacute;ci&oacute;s adatt&aacute;rba.
                    </li>
                </ul>
                
            </p>
            <br/>
        </div>
        <div id="CalculateFieldTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Mező kiszámítása</h2></td>
                    <td>
                    <img src="../images/GUID-059C9BE7-7B00-49C8-9917-B0EAEA3DA19D-web.png" class="titleImage" alt="Mező kisz&aacute;m&iacute;t&aacute;sa">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>&Eacute;rt&eacute;keket sz&aacute;m&iacute;t ki egy &uacute;j vagy l&eacute;tező mezőh&ouml;z, &eacute;s egy r&eacute;teget hoz l&eacute;tre a saj&aacute;t tartalomban az  ArcGIS Enterprise alkalmaz&aacute;sban. </p>
            <p>Ilyenre p&eacute;ld&aacute;k a k&ouml;vetkezők:
                <ul>
                    <li>Egy l&eacute;tező,  <i>total</i> nevű mező m&oacute;dos&iacute;t&aacute;sa a(z) <i>total_2016</i>, <i>total_2017</i> &eacute;s <i>total_2018</i> mezőkben szereplő bev&eacute;telek &ouml;sszeg&eacute;re.
                    </li>
                    <li>Egy &uacute;j mező l&eacute;trehoz&aacute;sa a vesz&eacute;lyess&eacute;gi szintek besorol&aacute;s&aacute;ra a(z)  <i>windspeed</i> &eacute;s <i>pollutant</i> &eacute;rt&eacute;kekhez hasonl&oacute; mező&eacute;rt&eacute;kek alapj&aacute;n.
                    </li>
                </ul>
                
            </p>
            <br/>
        </div>
        <div id="ClipLayerTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Kivágási réteg</h2></td>
                    <td>
                    <img src="../images/GUID-3F6A1ED7-A7F5-4F5C-BB2A-5D94403F2230-web.png" class="titleImage" alt="Kiv&aacute;g&aacute;si r&eacute;teg">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Meghat&aacute;rozott vizsg&aacute;lati ter&uuml;letekről kiv&aacute;g bemeneti vektoros elemeket. Kimeneti eredm&eacute;ny: a bemeneti vektoros elemek r&eacute;szcsoportja. 
            </p>
            <p>Erre p&eacute;ld&aacute;k a k&ouml;vetkezők: 
                <ul>
                    <li>Hozzon l&eacute;tre r&eacute;szcsoportot azokb&oacute;l a vesz&eacute;lyeztetett &eacute;p&uuml;letekből, amelyek &aacute;rt&eacute;ri ter&uuml;leten tal&aacute;lhat&oacute;k.
                    </li>
                    <li>Hat&aacute;rozza meg, mely főutak haladnak &aacute;t a potenci&aacute;lis fejleszt&eacute;si ter&uuml;leteken.
                    </li>
                </ul>
                
            </p>
            <br/>
        </div>
        <div id="DissolveBoundariesTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Határok összeolvasztása</h2></td>
                    <td>
                    <img src="../images/GUID-7B5F69B0-3625-404F-8B52-2B562766C0BB-web.png" class="titleImage" alt="Hat&aacute;rok &ouml;sszeolvaszt&aacute;sa">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Olyan ter&uuml;leti vektoros elemek &ouml;sszeilleszt&eacute;se, amelyek metszenek egy k&ouml;z&ouml;s mező&eacute;rt&eacute;ket, vagy osztoznak azon, &ouml;sszef&uuml;ggő vagy t&ouml;bb r&eacute;szből &aacute;ll&oacute; vektoros elemekl&eacute;trehoz&aacute;s&aacute;ra.
            </p>
            <p>Erre p&eacute;ld&aacute;k a k&ouml;vetkezők:
                <ul>
                    <li>A Hawaii-szigetek hat&aacute;rainak &ouml;sszeolvaszt&aacute;s&aacute;val hozzon l&eacute;tre egy vektoros elemet, amely Hawaii &aacute;llamot reprezent&aacute;lja.
                    </li>
                    <li>Illesszen &ouml;ssze talajt&iacute;pus szempontj&aacute;b&oacute;l hasonl&oacute; vizsg&aacute;lati ter&uuml;leteket, hogy kimenetk&eacute;nt egy &ouml;ssszef&uuml;ggő talajt&iacute;pus-adathalmazt kapjon.
                    </li>
                </ul>
                
            </p>
            <br/>
        </div>
        <div id="OverlayLayersTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Fedvényműveletek</h2></td>
                    <td>
                    <img src="../images/GUID-00A64703-4E97-4398-AE5C-F1885375BC30-web.png" class="titleImage" alt="Fedv&eacute;nyműveletek">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>K&eacute;t vagy t&ouml;bb r&eacute;teget egyes&iacute;t egyetlen r&eacute;tegben.  A fedv&eacute;nyek seg&iacute;ts&eacute;g&eacute;vel a legalapvetőbb f&ouml;ldrajzi k&eacute;rd&eacute;sek egyike v&aacute;laszolhat&oacute; meg: Mi tal&aacute;lhat&oacute; min? 
            </p>
            <p>Ilyenre p&eacute;ld&aacute;k a k&ouml;vetkezők:
                <ul>
                    <li>Milyen parcell&aacute;k tal&aacute;lhat&oacute;k a 100 &eacute;v visszat&eacute;r&eacute;si idejű &aacute;rt&eacute;ren bel&uuml;l? (Bel&uuml;l, vagy m&aacute;sk&eacute;pp fogalmazva rajta.)
                          
                    </li>
                    <li>Milyen felsz&iacute;nhaszn&aacute;lat t&iacute;pus tartozik az egyes talajt&iacute;pusokhoz?
                         
                    </li>
                    <li>Milyen kutak tal&aacute;lhat&oacute;k elhagyott katonai b&aacute;zisokon?
                    </li>
                </ul>
                
            </p>
            <br/>
        </div>
        <div id="AppendDataTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Adat hozzáfűzése</h2></td>
                    <td>
                    <img src="../images/GUID-8C95EAE0-904A-42C4-8C3D-303E74FD6DD7-web.png" class="titleImage" alt="Az Adat hozz&aacute;fűz&eacute;se munkafolyamat&aacute;nak diagramja">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Vektoros elemeket fűz egy megl&eacute;vő t&aacute;rolt r&eacute;teghez a saj&aacute;t tartalomban az  ArcGIS Enterprise alkalmaz&aacute;sban. </p>
            <p>Ilyenre p&eacute;ld&aacute;k a k&ouml;vetkezők:
                <ul>
                    <li>A 2018_&aacute;rbev&eacute;tel vektoros r&eacute;teg friss&iacute;t&eacute;se minden h&oacute;napban, amint a besz&aacute;mol&oacute;k el&eacute;rhetőv&eacute; v&aacute;lnak.
                    </li>
                    <li>Hurrik&aacute;nok k&ouml;vet&eacute;s&eacute;re haszn&aacute;lt, 2016. &eacute;s 2017. &eacute;vi adathalmazok hozz&aacute;fűz&eacute;se a hurrik&aacute;nok t&ouml;rzsadathalmaz&aacute;hoz.
                    </li>
                    <li>Adathalmazok gyűjt&eacute;se t&ouml;bb, elt&eacute;rő s&eacute;m&aacute;val rendelkező forr&aacute;sb&oacute;l, &eacute;s hozz&aacute;fűz&eacute;s egyedi mezőlek&eacute;pez&eacute;s seg&iacute;ts&eacute;g&eacute;vel.
                    </li>
                </ul>
                
            </p>
            <br/>
        </div>
        <div id="MergeLayersTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Rétegek összeillesztése</h2></td>
                    <td>
                    <img src="../images/GUID-BDDD6517-4EE7-4EEC-AE15-15DD9B709131-web.png" class="titleImage" alt="R&eacute;tegek &ouml;sszeilleszt&eacute;se">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>K&eacute;t vektoros r&eacute;teget &ouml;sszeillesztve hoz l&eacute;tre egy eredm&eacute;nyr&eacute;teget. Alap&eacute;rtelmez&eacute;sben az egyes&iacute;t&eacute;si r&eacute;teg &ouml;sszes mezőj&eacute;t tartalmazza, vagy megadhat egy&eacute;ni &ouml;sszeilleszt&eacute;si szab&aacute;lyokat az eredm&eacute;nys&eacute;ma defini&aacute;l&aacute;s&aacute;ra.  
            </p>
            <p>Erre p&eacute;ld&aacute;k a k&ouml;vetkezők:
                <ul>
                    <li>Van h&aacute;rom r&eacute;teg, amelyek Anglia, Wales &eacute;s Sk&oacute;cia demogr&aacute;fiai adatait tartalmazz&aacute;k, &eacute;s ezeket &ouml;sszeillesztve szeretn&eacute;k egyetlen r&eacute;teget k&eacute;sz&iacute;teni Nagy-Britanni&aacute;r&oacute;l.
                    </li>
                    <li>K&eacute;t r&eacute;teg &ouml;sszeilleszt&eacute;se, amelyek tartalmazz&aacute;k a szomsz&eacute;dos telep&uuml;l&eacute;sek csomaginform&aacute;ci&oacute;j&aacute;t, csak azokat a mezőket megtartva, amelyeknek a k&eacute;t r&eacute;tegben ugyanaz a neve &eacute;s a t&iacute;pusa.
                    </li>
                </ul>
                
            </p>
            <br/>
        </div>
    <div id="EnrichLocationsCategory" class="smallsize">
        <h2>Adatbővítés</h2>
        <hr/>
        <p>Ezek az eszk&ouml;z&ouml;k seg&iacute;tenek megismerni a ter&uuml;letek jelleg&eacute;t.
            <ul>
                <li>A  <b>Bőv&iacute;t&eacute;s t&ouml;bbv&aacute;ltoz&oacute;s r&aacute;csh&aacute;l&oacute;b&oacute;l</b>t&ouml;bbv&aacute;ltoz&oacute;s r&aacute;csh&aacute;l&oacute;b&oacute;l sz&aacute;rmaz&oacute; attrib&uacute;tumokat kapcsol &ouml;ssze egy pontszerű r&eacute;teggel.
                </li>
            </ul>
            
        </p>
    </div>
        <div id="EnrichFromMultiVariableGridTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Bővítés többváltozós rácshálóból</h2></td>
                    <td>
                    <img src="../images/GUID-AC3885D9-F068-4C09-8B7F-5694E77D9F65-web.png" class="titleImage" alt="Bőv&iacute;t&eacute;s t&ouml;bbv&aacute;ltoz&oacute;s r&aacute;csh&aacute;l&oacute;b&oacute;l">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Hat&eacute;konyan kapcsol &ouml;ssze t&ouml;bbv&aacute;ltoz&oacute;s r&aacute;csh&aacute;l&oacute;b&oacute;l sz&aacute;rmaz&oacute; attrib&uacute;tumokat egy pontszerű r&eacute;teggel, &iacute;gy lehetőv&eacute; t&eacute;ve inform&aacute;ci&oacute;k nagy &eacute;s k&uuml;l&ouml;nb&ouml;ző gyűjtem&eacute;ny&eacute;nek pontadathoz t&ouml;rt&eacute;nő gyors hozz&aacute;ad&aacute;s&aacute;t tov&aacute;bbi t&eacute;rbeli elemz&eacute;sekhez val&oacute; felhaszn&aacute;l&aacute;s c&eacute;lj&aacute;ra. 
            </p>
            <p>Erre p&eacute;ld&aacute;k a k&ouml;vetkezők:
                <ul>
                    <li>Ha van egy t&ouml;bb milli&oacute; &aacute;ramkimarad&aacute;si incidenst tartalmaz&oacute; r&eacute;teg, bőv&iacute;tse az incidens vektoros elemeit a tipikus haszn&aacute;latra, a k&ouml;rnyezeti kock&aacute;zatokra &eacute;s az infrastruktur&aacute;lis felt&eacute;telekre vonatkoz&oacute; inform&aacute;ci&oacute;kkal, hogy tanulm&aacute;nyozhassa ezen t&eacute;nyezők &eacute;s az &aacute;ramkimarad&aacute;s gyakoris&aacute;ga k&ouml;z&ouml;tti &ouml;sszef&uuml;gg&eacute;seket. 
                    </li>
                </ul>
                
            </p>
            <br/>
        </div>
</div>
</html>
