<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Sűrűség számítása</h2><p/>
        <h2><img src="../images/GUID-38AD3C19-0400-4E5A-9282-BDE42F2BBFC1-web.png" alt="Sűrűs&eacute;g sz&aacute;m&iacute;t&aacute;sa"></h2>
        <hr/>
    <p>A Sűrűs&eacute;g sz&aacute;m&iacute;t&aacute;sa eszk&ouml;z sűrűs&eacute;gt&eacute;rk&eacute;pet hoz l&eacute;tre pont-t&iacute;pus&uacute; vektoros elemekből egy bizonyos (a pontok attrib&uacute;tumai &aacute;ltal k&eacute;pviselt) jelens&eacute;g ismert mennyis&eacute;geit kiterjesztve a t&eacute;rk&eacute;pen. Az eredm&eacute;ny a legkev&eacute;sb&eacute; sűrűtől a legsűrűbbig terjedő kateg&oacute;ri&aacute;kba sorolt ter&uuml;leteket tartalmaz&oacute; r&eacute;teg.   

    </p>
    <p>Pont bemenet eset&eacute;n az egyes pontok feleljenek meg egy bizonyos esem&eacute;ny vagy incidens hely&eacute;nek, &eacute;s az eredm&eacute;ny r&eacute;teg megjelen&iacute;ti az egys&eacute;gnyi ter&uuml;letre eső incidensek sz&aacute;m&aacute;t.  Az &uacute;j helyen a nagyobb sűrűs&eacute;g&eacute;rt&eacute;k azt jelenti, hogy t&ouml;bb pont tal&aacute;lhat&oacute; az adott hely k&ouml;zel&eacute;ben.  Sok esetben az eredm&eacute;ny r&eacute;teg j&ouml;vőbeni esem&eacute;nyek kock&aacute;zat&aacute;t megjelen&iacute;tő felsz&iacute;nk&eacute;nt &eacute;rtelmezhető. Ha p&eacute;ld&aacute;ul a bemenő pontok vill&aacute;mcsap&aacute;sok hely&eacute;nek felelnek meg, akkor az eredm&eacute;ny r&eacute;teg a j&ouml;vőbeni vill&aacute;mcsap&aacute;sok kock&aacute;zat&aacute;t megjelen&iacute;tő felsz&iacute;nk&eacute;nt &eacute;rtelmezhető.
    </p>
    <p>Az eszk&ouml;z ezenk&iacute;v&uuml;l az al&aacute;bbiakra is haszn&aacute;lhat&oacute;:
        <ul>
            <li>Bűncselekm&eacute;nyek sűrűs&eacute;gi t&eacute;rk&eacute;p&eacute;nek l&eacute;trehoz&aacute;sa, seg&iacute;tve ezzel a rendőrs&eacute;gnek az erőforr&aacute;sokat azokra a ter&uuml;letekre csoportos&iacute;tani, ahol nagy ar&aacute;ny&uacute; a bűn&ouml;z&eacute;s.
            </li>
            <li>A megy&eacute;ben tal&aacute;lhat&oacute; k&oacute;rh&aacute;zak sűrűs&eacute;g&eacute;nek kisz&aacute;m&iacute;t&aacute;sa.  Az eredm&eacute;ny r&eacute;teg mutatja azokat a ter&uuml;leteket, ahol magas &eacute;s alacsony a k&oacute;rh&aacute;zak el&eacute;rhetős&eacute;ge, &eacute;s ez az inform&aacute;ci&oacute; felhaszn&aacute;lhat&oacute; annak eld&ouml;nt&eacute;s&eacute;re, hogy hol &eacute;p&uuml;ljenek &uacute;j k&oacute;rh&aacute;zak.
            </li>
            <li>Olyan ter&uuml;letek azonos&iacute;t&aacute;sa, ahol magas az erdőtűz kock&aacute;zata a kor&aacute;bbi helysz&iacute;ne alapj&aacute;n.
            </li>
            <li>A nagyobb fő&uacute;tvonalakt&oacute;l t&aacute;vol &eacute;lő k&ouml;z&ouml;ss&eacute;gek hely&eacute;nek meghat&aacute;roz&aacute;sa, annak megtervez&eacute;s&eacute;hez, hogy hol &eacute;p&uuml;ljenek &uacute;j utak.
            </li>
        </ul>
        
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Válassza ki azt a pontréteget, amelyből ki szeretné számítani a sűrűséget</h2></div>
        <hr/>
        <div>
            <p>A pontr&eacute;teg, amelyből ki szeretn&eacute; sz&aacute;m&iacute;tani a sűrűs&eacute;get.
            </p>
            <p>Ahelyett, hogy egy r&eacute;teget v&aacute;laszt a t&eacute;rk&eacute;p&eacute;ről, v&aacute;laszthatja a leg&ouml;rd&uuml;lő lista alj&aacute;n l&eacute;vő  <b>Eredm&eacute;nyr&eacute;teg kiv&aacute;laszt&aacute;sa</b> lehetős&eacute;get is, ha a saj&aacute;t tartalomban szeretne big data-f&aacute;jlmegoszt&oacute; adathalmazt vagy vektoros r&eacute;teget keresni.
            </p>
        </div>
    </div>
    <div id="fields">
        <div><h2>Válasszon egy vagy több mezőt a sűrűség kiszámításához (opcionális)</h2></div>
        <hr/>
        <div>
            <p>Adja meg az egyes helyeken bek&ouml;vetkezett balesetek sz&aacute;m&aacute;t meghat&aacute;roz&oacute; mezőt vagy mezőket.  V&aacute;rosokat k&eacute;pviselő pontok eset&eacute;n p&eacute;ld&aacute;ul a v&aacute;ros n&eacute;pess&eacute;g&eacute;nek megfelelő mezőt haszn&aacute;lhat sz&aacute;ml&aacute;l&oacute; mezők&eacute;nt, &eacute;s az eredm&eacute;ny&uuml;l kapott n&eacute;psűrűs&eacute;g r&eacute;teg nagyobb n&eacute;psűrűs&eacute;get fog sz&aacute;ml&aacute;lni a nagyobb n&eacute;pess&eacute;gű v&aacute;rosok k&ouml;zel&eacute;ben.
            </p>
            <p>Az eszk&ouml;z mindig kisz&aacute;m&iacute;tja a pontok darabsz&aacute;m&aacute;nak sűrűs&eacute;g&eacute;t.   Ha nincs kiv&aacute;lasztva mező, akkor az eszk&ouml;z felt&eacute;telezi, hogy az egyes helyek egyetlen &eacute;rt&eacute;ket k&eacute;pviselnek.
            </p>
        </div>
    </div>
    <div id="binType">
        <div><h2>Válassza ki a gyűjtő alakját</h2></div>
        <hr/>
        <div>
            <p>Azoknak a gyűjtőknek az alakja, amelyekbe a pontokat &ouml;sszes&iacute;ti, &eacute;s amelyeket a sűrűs&eacute;g kisz&aacute;m&iacute;t&aacute;s&aacute;hoz haszn&aacute;l.
            </p>
            <p>A  <b>N&eacute;gysz&ouml;g</b> vagy <b>Hatsz&ouml;g</b> alak&uacute; gyűjtőkkel v&eacute;gzett elemz&eacute;shez vet&uuml;leti koordin&aacute;ta-rendszer sz&uuml;ks&eacute;ges. A <b>Feldolgoz&aacute;si koordin&aacute;ta-rendszert</b> az <b>Elemz&eacute;si k&ouml;rnyezetekben</b> &aacute;ll&iacute;thatja be. Ha a feldolgoz&aacute;si koordin&aacute;ta-rendszer nem vet&uuml;leti koordin&aacute;ta-rendszerre van &aacute;ll&iacute;tva, az eszk&ouml;z ennek be&aacute;ll&iacute;t&aacute;s&aacute;t k&eacute;ri az <b>elemz&eacute;s futtat&aacute;sakor</b> .
            </p>
        </div>
    </div>
    <div id="binSizing">
        <div><h2>Válassza ki az összevonási gyűjtőméretet</h2></div>
        <hr/>
        <div>
            <p>A l&eacute;trehozott gyűjtők m&eacute;rete. N&eacute;gysz&ouml;g alak&uacute; gyűjtő eset&eacute;n a m&eacute;ret a n&eacute;gysz&ouml;g magass&aacute;g&aacute;t jel&ouml;li. Hatsz&ouml;g alak&uacute; gyűjtő eset&eacute;n a m&eacute;ret a hatsz&ouml;g (p&aacute;rhuzamos oldalakt&oacute;l m&eacute;rt) magass&aacute;g&aacute;t jel&ouml;li.
            </p>
        </div>
    </div>
    <div id="weight">
        <div><h2>Válassza ki az alkalmazandó sűrűségsúlyozást</h2></div>
        <hr/>
        <div>
            <p>A sűrűs&eacute;g sz&aacute;m&iacute;t&aacute;sakor alkalmazott s&uacute;lyoz&aacute;s t&iacute;pusa. K&eacute;tf&eacute;le lehetős&eacute;g k&ouml;z&uuml;l v&aacute;laszthat:
                <ul>
                    <li> <b>Egys&eacute;ges</b> &ndash; ter&uuml;letenk&eacute;nt sz&aacute;m&iacute;t nagys&aacute;grendet.
                    </li>
                    <li> <b>Kernel</b> &ndash; egy kernelf&uuml;ggv&eacute;ny seg&iacute;ts&eacute;g&eacute;vel illeszt kisim&iacute;tott k&uacute;pfel&uuml;letet minden egyes pontra.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="neighborhood">
        <div><h2>Válassza ki a szomszédság méretét</h2></div>
        <hr/>
        <div>
            <p>A sűrűs&eacute;g sz&aacute;m&iacute;t&aacute;s&aacute;hoz haszn&aacute;lt ter&uuml;let m&eacute;rete. A szomsz&eacute;ds&aacute;g m&eacute;ret&eacute;nek nagyobbnak kell lennie a gyűjtő m&eacute;ret&eacute;n&eacute;l.
            </p>
        </div>
    </div>
    <div id="areaUnits">
        <div><h2>Válassza ki a kimeneti mértékegységeket a sűrűséghez</h2></div>
        <hr/>
        <div>
            <p>A sűrűs&eacute;g&eacute;rt&eacute;kek k&iacute;v&aacute;nt kimeneti m&eacute;rt&eacute;kegys&eacute;gei. Alap&eacute;rtelmez&eacute;s szerint n&eacute;gyzetkilom&eacute;terre vagy n&eacute;gyzetm&eacute;rf&ouml;ldre van &aacute;ll&iacute;tva a profilban meghat&aacute;rozott alap&eacute;rtelmezett m&eacute;rt&eacute;kegys&eacute;gtől f&uuml;ggően. Ha a sűrűs&eacute;g&eacute;rt&eacute;kek nagyon kicsik, n&ouml;velheti a ter&uuml;leti m&eacute;rt&eacute;kegys&eacute;gek nagys&aacute;grendj&eacute;t (p&eacute;ld&aacute;ul n&eacute;gyzetm&eacute;terről n&eacute;gyzetkilom&eacute;terre), hogy nagyobb &eacute;rt&eacute;keket kapjon. Az &eacute;rt&eacute;kek csak az eredm&eacute;nyek m&eacute;retar&aacute;ny&aacute;t m&oacute;dos&iacute;tj&aacute;k.  

            </p>
        </div>
    </div>
    <div id="timeSlicing">
        <div><h2>Sűrűség számítása időbeli lépések használatával (opcionális)</h2></div>
        <hr/>
        <div>
            <p>Ha az idő enged&eacute;lyezve van a bemeneti pontr&eacute;tegen, &eacute;s azonnali t&iacute;pus&uacute;, akkor időbeli l&eacute;ptet&eacute;st haszn&aacute;lva is elemezhet.  Idő haszn&aacute;latakor h&aacute;rom param&eacute;ter &aacute;ll&iacute;that&oacute; be:
                <ul>
                    <li> <b>Időbeli l&eacute;p&eacute;s intervalluma</b>
                    </li>
                    <li> <b>Az időbeli l&eacute;p&eacute;s ism&eacute;tl&eacute;s&eacute;nek gyakoris&aacute;ga</b>
                    </li>
                    <li> <b>Az időbeli l&eacute;p&eacute;sek igaz&iacute;t&aacute;s&aacute;hoz haszn&aacute;lt idő</b>
                    </li>
                </ul>
                
            </p>
            <p>Ha p&eacute;ld&aacute;ul időben egy &eacute;vet le&iacute;r&oacute; adatok &aacute;llnak rendelkez&eacute;sre, &eacute;s ezt heti l&eacute;p&eacute;seket haszn&aacute;lva szeretn&eacute; elemezni, &aacute;ll&iacute;tsa az  <b>Időbeli l&eacute;p&eacute;s intervalluma</b> param&eacute;tert <code>1 h&eacute;tre</code>. 
            </p>
            <p>Ha p&eacute;ld&aacute;ul időben egy &eacute;vet le&iacute;r&oacute; adatok &aacute;llnak rendelkez&eacute;sre, &eacute;s ezt a h&oacute;nap első het&eacute;t haszn&aacute;lva szeretn&eacute; elemezni, &aacute;ll&iacute;tsa az  <b>Időbeli l&eacute;p&eacute;s intervalluma</b> param&eacute;tert <code>1 h&eacute;tre</code>, <b>Az időbeli l&eacute;p&eacute;s ism&eacute;tl&eacute;s&eacute;nek gyakoris&aacute;ga</b> param&eacute;tert <code>1 h&oacute;napra</code>, &eacute;s <b>Az időbeli l&eacute;p&eacute;sek igaz&iacute;t&aacute;s&aacute;hoz haszn&aacute;lt idő</b> param&eacute;tert <code>Janu&aacute;r 1., 12:00 &oacute;r&aacute;ra</code>.
            </p>
        </div>
    </div>
    <div id="timeInterval">
        <div><h2>Időbeli lépés intervalluma</h2></div>
        <hr/>
        <div>
            <p>Az időbeli l&eacute;p&eacute;sek l&eacute;trehoz&aacute;s&aacute;hoz haszn&aacute;lt időintervallum. Az  <b>Időbeli l&eacute;p&eacute;s intervalluma</b> param&eacute;ter haszn&aacute;lhat&oacute; &ouml;nmag&aacute;ban, illetve <b>Az időbeli l&eacute;p&eacute;s ism&eacute;tl&eacute;s&eacute;nek gyakoris&aacute;ga</b> vagy <b>Az időbeli l&eacute;p&eacute;sek igaz&iacute;t&aacute;s&aacute;hoz haszn&aacute;lt idő</b> param&eacute;terrel egy&uuml;tt.
            </p>
            <p>Ha p&eacute;ld&aacute;ul olyan időbeli l&eacute;p&eacute;seket szeretne l&eacute;trehozni, amelyek minden h&eacute;tfő 9:00 &oacute;r&aacute;t&oacute;l 10:00 &oacute;r&aacute;ig tartanak, &aacute;ll&iacute;tsa az  <b>Időbeli l&eacute;p&eacute;s intervalluma</b> param&eacute;tert <code>1 &oacute;r&aacute;ra</code>, <b>Az időbeli l&eacute;p&eacute;s ism&eacute;tl&eacute;s&eacute;nek gyakoris&aacute;ga</b> param&eacute;tert <code>1 h&eacute;tre</code>, &eacute;s <b>Az időbeli l&eacute;p&eacute;sek igaz&iacute;t&aacute;s&aacute;hoz haszn&aacute;lt idő</b> param&eacute;tert <code>9:00:00 &oacute;r&aacute;ra egy h&eacute;tfői napon</code>.
            </p>
        </div>
    </div>
    <div id="timeStep">
        <div><h2>Az időbeli lépés ismétlésének gyakorisága</h2></div>
        <hr/>
        <div>
            <p> Egy időbeli l&eacute;p&eacute;s kisz&aacute;m&iacute;t&aacute;s&aacute;hoz haszn&aacute;lt l&eacute;p&eacute;s. <b>Az időbeli l&eacute;p&eacute;s ism&eacute;tl&eacute;s&eacute;nek gyakoris&aacute;ga</b> param&eacute;ter haszn&aacute;lhat&oacute; &ouml;nmag&aacute;ban, az <b>Időbeli l&eacute;p&eacute;s intervalluma</b>, a <b>Referenciaidő</b> param&eacute;terrel, illetve az <b>Időbeli l&eacute;p&eacute;s intervalluma</b> &eacute;s <b>Az időbeli l&eacute;p&eacute;sek igaz&iacute;t&aacute;s&aacute;hoz haszn&aacute;lt idő</b> param&eacute;terek egy&uuml;ttes&eacute;vel.
            </p>
            <p> Ha p&eacute;ld&aacute;ul olyan időbeli l&eacute;p&eacute;seket szeretne l&eacute;trehozni, amelyek minden h&eacute;tfő 9:00 &oacute;r&aacute;t&oacute;l 10:00 &oacute;r&aacute;ig tartanak, &aacute;ll&iacute;tsa az <b>Időbeli l&eacute;p&eacute;s intervalluma</b> param&eacute;tert <code>1 &oacute;r&aacute;ra</code>, <b>Az időbeli l&eacute;p&eacute;s ism&eacute;tl&eacute;s&eacute;nek gyakoris&aacute;ga</b> param&eacute;tert <code>1 h&eacute;tre</code>, &eacute;s <b>Az időbeli l&eacute;p&eacute;sek igaz&iacute;t&aacute;s&aacute;hoz haszn&aacute;lt idő</b> param&eacute;tert <code>9:00:00 &oacute;r&aacute;ra egy h&eacute;tfői napon</code>.
            </p>
        </div>
    </div>
    <div id="timeReference">
        <div><h2>Az időbeli lépések igazításához használt idő</h2></div>
        <hr/>
        <div>
            <p>Az időszeletek igaz&iacute;t&aacute;s&aacute;hoz haszn&aacute;lt d&aacute;tum &eacute;s időpont. Az időbeli l&eacute;ptet&eacute;s enn&eacute;l az időpontn&aacute;l kezdődik, &eacute;s visszafel&eacute; folytat&oacute;dik. Ha nincs kiv&aacute;lasztva referenciaidő, az időbeli l&eacute;ptet&eacute;s 1970. janu&aacute;r 1-hez illeszkedik. 
            </p>
            <p> Ha p&eacute;ld&aacute;ul olyan időbeli l&eacute;p&eacute;seket szeretne l&eacute;trehozni, amelyek minden h&eacute;tfő 9:00 &oacute;r&aacute;t&oacute;l 10:00 &oacute;r&aacute;ig tartanak, &aacute;ll&iacute;tsa az <b>Időbeli l&eacute;p&eacute;s intervalluma</b> param&eacute;tert <code>1 &oacute;r&aacute;ra</code>, <b>Az időbeli l&eacute;p&eacute;s ism&eacute;tl&eacute;s&eacute;nek gyakoris&aacute;ga</b> param&eacute;tert <code>1 h&eacute;tre</code>, &eacute;s <b>Az időbeli l&eacute;p&eacute;sek igaz&iacute;t&aacute;s&aacute;hoz haszn&aacute;lt idő</b> param&eacute;tert <code>9:00:00 &oacute;r&aacute;ra egy h&eacute;tfői napon</code>.
            </p>
        </div>
    </div>
    <div id="spatialReference">
        <div><h2>SpatialReference (WKID)</h2></div>
        <hr/>
        <div>
            <p>Ez az előzetes kiad&aacute;s egy ideiglenes param&eacute;tere az alkalmazott t&eacute;rbeli referencia be&aacute;ll&iacute;t&aacute;s&aacute;hoz. Sz&aacute;mos big data eszk&ouml;z vet&uuml;leti koordin&aacute;ta-rendszer alkalmaz&aacute;s&aacute;t k&iacute;v&aacute;nja meg t&eacute;rbeli referenciak&eacute;nt a feldolgoz&aacute;shoz. Az eszk&ouml;z alap&eacute;rtelmez&eacute;s szerint a bemeneti koordin&aacute;ta-rendszert haszn&aacute;lja, de eredm&eacute;nytelen lesz, ha az f&ouml;ldrajzi koordin&aacute;ta-rendszer. Vet&uuml;leti koordin&aacute;ta-rendszer be&aacute;ll&iacute;t&aacute;s&aacute;hoz adja meg a WKID-t. A  <b>Web Mercator</b> eset&eacute;n p&eacute;ld&aacute;ul <code>3857</code>-et kell be&iacute;rni.
            </p>
        </div>
    </div>
    <div id="dataStore">
        <div><h2>Adattár választása</h2></div>
        <hr/>
        <div>
            <p>A geoanalitikai eredm&eacute;nyek ment&eacute;se egy adatt&aacute;rban t&ouml;rt&eacute;nik, &eacute;s a(z)  Portal for ArcGIS vektoros r&eacute;tegeik&eacute;nt szerepelnek. Az eredm&eacute;nyeket t&ouml;bbnyire a t&eacute;rbeli-időbeli adatt&aacute;rban aj&aacute;nlott t&aacute;rolni, &eacute;s az alap&eacute;rtelmezett be&aacute;ll&iacute;t&aacute;s is ez. Egyes esetekben j&oacute; v&aacute;laszt&aacute;s lehet az eredm&eacute;nyek ment&eacute;se a rel&aacute;ci&oacute;s adatt&aacute;rban. Az al&aacute;bbi &eacute;rvek sz&oacute;lnak az eredm&eacute;nyek rel&aacute;ci&oacute;s adatt&aacute;rban t&ouml;rt&eacute;nő t&aacute;rol&aacute;sa mellett: 
                <ul>
                    <li>Az eredm&eacute;nyek port&aacute;lok k&ouml;z&ouml;tti egy&uuml;ttműk&ouml;d&eacute;sben haszn&aacute;lhat&oacute;k.
                    </li>
                    <li>Enged&eacute;lyezheti az eredm&eacute;nyekkel val&oacute; szinkroniz&aacute;l&aacute;si lehetős&eacute;geket
                    </li>
                </ul>
                
            </p>
            <p>Nem aj&aacute;nlott a rel&aacute;ci&oacute;s adatt&aacute;r haszn&aacute;lata, ha a geoanalitikai eredm&eacute;nyek mennyis&eacute;g&eacute;nek n&ouml;veked&eacute;se v&aacute;rhat&oacute;, &eacute;s ki kell haszn&aacute;lni a t&eacute;rbeli-időbeli big data-adatt&aacute;r k&eacute;pess&eacute;geit a nagy adatmennyis&eacute;g kezel&eacute;s&eacute;re.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Eredmény réteg neve</h2></div>
        <hr/>
        <div>
            <p> A l&eacute;trehozand&oacute; r&eacute;teg neve.  Ha egy ArcGIS Data Store helyre &iacute;r, akkor  eredm&eacute;nyei a  <b>Saj&aacute;t tartalom</b> alatt lesznek elmentve, &eacute;s hozz&aacute; lesznek adva a t&eacute;rk&eacute;phez. Ha egy big data f&aacute;jlmegoszt&oacute;ba &iacute;r, akkor eredm&eacute;nyei a big data f&aacute;jlmegoszt&oacute;ba lesznek elmentve, &eacute;s hozz&aacute; lesznek adva annak jegyz&eacute;kf&aacute;jlj&aacute;hoz. Nem lesznek hozz&aacute;adva a t&eacute;rk&eacute;phez. Az alap&eacute;rtelmezett n&eacute;v az eszk&ouml;z nev&eacute;től &eacute;s a bemenő r&eacute;teg nev&eacute;től f&uuml;gg. Ha a r&eacute;teg m&aacute;r l&eacute;tezik, akkor a művelet sikertelen lesz.
            </p>
            <p>Ha   ArcGIS Data Store (rel&aacute;ci&oacute;s vagy t&eacute;rbeli-időbeli big data adatt&aacute;rba) &iacute;r az  <b>Eredm&eacute;ny ment&eacute;si helye</b> leg&ouml;rd&uuml;lő mező haszn&aacute;lat&aacute;val, akkor megadhatja a <b>Saj&aacute;t tartalom</b> mapp&aacute;j&aacute;nak nev&eacute;t, ahov&aacute; az eszk&ouml;z menti az eredm&eacute;nyt.
            </p>
        </div>
    </div>
</div>
</html>
