<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Kivágási réteg</h2><p/>
        <h2><img src="../images/GUID-3F6A1ED7-A7F5-4F5C-BB2A-5D94403F2230-web.png" alt="Kiv&aacute;g&aacute;si r&eacute;teg"></h2>
        <hr/>
    <p>A Kiv&aacute;g&aacute;si r&eacute;teg eszk&ouml;z olyan bemeneti pontszerű, vonalas vagy ter&uuml;let vektoros elemeket v&aacute;g ki, amelyek &aacute;tfed&eacute;sben vannak a kiv&aacute;g&aacute;si ter&uuml;letekkel. A kimenet a bemeneti adatok r&eacute;szcsoportja lesz, a vizsg&aacute;lati ter&uuml;letek alapj&aacute;n. P&eacute;ld&aacute;k az eszk&ouml;z hasznoss&aacute;g&aacute;ra:
        <ul>
            <li>Milyen nagy foly&oacute;k vannak Nebraszka &aacute;llamban?
                  
            </li>
            <li>Mely h&aacute;zak tal&aacute;lhat&oacute;k &aacute;rt&eacute;ri ter&uuml;leten?
            </li>
            <li>Mely hurrik&aacute;nok puszt&iacute;tottak 2011-ben?
                 
            </li>
        </ul>
        
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Válassza ki a kivágni kívánt vektoros elemeket</h2></div>
        <hr/>
        <div>
            <p>A pont, vonal vagy ter&uuml;let r&eacute;teg, amely kiv&aacute;g&aacute;sra ker&uuml;l. &Ouml;n ezekből a vektoros elemekből r&eacute;szcsoportot hoz l&eacute;tre.
            </p>
            <p>Ahelyett, hogy egy r&eacute;teget v&aacute;laszt a t&eacute;rk&eacute;p&eacute;ről, v&aacute;laszthatja a leg&ouml;rd&uuml;lő lista alj&aacute;n l&eacute;vő  <b>Eredm&eacute;nyr&eacute;teg kiv&aacute;laszt&aacute;sa</b> lehetős&eacute;get is, ha a saj&aacute;t tartalomban szeretne big data-f&aacute;jlmegoszt&oacute; adathalmazt vagy vektoros r&eacute;teget keresni.
            </p>
        </div>
    </div>
    <div id="clipLayer">
        <div><h2>Válassza ki a területet, amelyre a kivágás kerül</h2></div>
        <hr/>
        <div>
            <p>A ter&uuml;letr&eacute;teg, amelybe a program kiv&aacute;gja a bemeneti r&eacute;teg vektoros elemeket.  Ezek a ter&uuml;letek hat&aacute;rozz&aacute;k meg a r&eacute;szcsoport hat&aacute;rait.
            </p>
            <p>Ahelyett, hogy egy r&eacute;teget v&aacute;laszt a t&eacute;rk&eacute;p&eacute;ről, v&aacute;laszthatja a leg&ouml;rd&uuml;lő lista alj&aacute;n l&eacute;vő  <b>Eredm&eacute;nyr&eacute;teg kiv&aacute;laszt&aacute;sa</b> lehetős&eacute;get is, ha a saj&aacute;t tartalomban szeretne big data-f&aacute;jlmegoszt&oacute; adathalmazt vagy vektoros r&eacute;teget keresni.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Eredményréteg neve</h2></div>
        <hr/>
        <div>
            <p> A l&eacute;trehozand&oacute; r&eacute;teg neve.  Ha egy ArcGIS Data Store helyre &iacute;r, akkor  eredm&eacute;nyei a  <b>Saj&aacute;t tartalom</b> alatt lesznek elmentve, &eacute;s hozz&aacute; lesznek adva a t&eacute;rk&eacute;phez. Ha egy big data f&aacute;jlmegoszt&oacute;ba &iacute;r, akkor eredm&eacute;nyei a big data f&aacute;jlmegoszt&oacute;ba lesznek elmentve, &eacute;s hozz&aacute; lesznek adva annak jegyz&eacute;kf&aacute;jlj&aacute;hoz. Nem lesznek hozz&aacute;adva a t&eacute;rk&eacute;phez. Az alap&eacute;rtelmezett n&eacute;v az eszk&ouml;z nev&eacute;től &eacute;s a bemenő r&eacute;teg nev&eacute;től f&uuml;gg. Ha a r&eacute;teg m&aacute;r l&eacute;tezik, akkor a művelet sikertelen lesz.
            </p>
            <p>Ha   ArcGIS Data Store (rel&aacute;ci&oacute;s vagy t&eacute;rbeli-időbeli big data adatt&aacute;rba) &iacute;r az  <b>Eredm&eacute;ny ment&eacute;si helye</b> leg&ouml;rd&uuml;lő mező haszn&aacute;lat&aacute;val, akkor megadhatja a <b>Saj&aacute;t tartalom</b> mapp&aacute;j&aacute;nak nev&eacute;t, ahov&aacute; az eszk&ouml;z menti az eredm&eacute;nyt.
            </p>
        </div>
    </div>
</div>
</html>
