<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Útiköltség-útvonal meghatározása polyline-ként</h2><p/>
        <h2><img src="../images/GUID-9A27DEB7-0276-483C-A12F-3E70D636550D-web.png" alt="Az &Uacute;tik&ouml;lts&eacute;g-&uacute;tvonal meghat&aacute;roz&aacute;sa polyline-k&eacute;nt eszk&ouml;z illusztr&aacute;ci&oacute;ja"></h2>
        <hr/>
    <p>Ez az eszk&ouml;z a legkisebb k&ouml;lts&eacute;ggel j&aacute;r&oacute; polyline-&uacute;tvonalat hat&aacute;rozza meg kiindul&oacute;pontok &eacute;s ismert c&eacute;lpontok k&ouml;z&ouml;tt.
    </p>
    <p>Az alkalmaz&aacute;s&aacute;ra az al&aacute;bbi p&eacute;ld&aacute;k hozhat&oacute;k:
        <ul>
            <li>Egy &uacute;j &uacute;t legjobb &uacute;tvonal&aacute;nak megkeres&eacute;se &eacute;p&iacute;t&eacute;si k&ouml;lts&eacute;geket illetően.
                

            </li>
            <li>A k&ouml;vetendő &uacute;tvonal meghat&aacute;roz&aacute;sa sz&aacute;mos k&uuml;lv&aacute;rosi helysz&iacute;nről (kiindul&oacute;pont) a legk&ouml;zelebbi bev&aacute;s&aacute;rl&oacute;k&ouml;zpontig (c&eacute;l&aacute;llom&aacute;s).
                

            </li>
        </ul>
        
    </p>
    <p>Az  <b>Aktu&aacute;lis t&eacute;rk&eacute;pkiterjed&eacute;s haszn&aacute;lata</b> bejel&ouml;l&eacute;s&eacute;vel az elemz&eacute;s csak azokat a bemenő r&eacute;tegeken l&eacute;vő helyeket foglalja mag&aacute;ban, amelyek l&aacute;that&oacute;k az aktu&aacute;lis t&eacute;rk&eacute;pkiterjed&eacute;sen. Ha nincs bejel&ouml;lve, akkor mindk&eacute;t bemenő r&eacute;teg &ouml;sszes hely&eacute;t elemzi, akkor is, ha azok k&iacute;v&uuml;l esnek az aktu&aacute;lis t&eacute;rk&eacute;pkiterjed&eacute;sen.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputSourceRasterOrFeatures">
        <div><h2>Válassza ki a raszteres vagy vektoros kiindulópont-réteget, ahonnan az útvonalakat meg kívánja határozni</h2></div>
        <hr/>
        <div>
            <p>Egy k&eacute;pszolg&aacute;ltat&aacute;s vagy vektoros adatszolg&aacute;ltat&aacute;s, amely azonos&iacute;tja azokat a cell&aacute;kat, ahonnan indulva meghat&aacute;roz&aacute;sra ker&uuml;l a legkev&eacute;sb&eacute; k&ouml;lts&eacute;ges &uacute;tvonal a legkisebb k&ouml;lts&eacute;ggel j&aacute;r&oacute; c&eacute;l&aacute;llom&aacute;sig.
            </p>
            <p>Ha a bemenet k&eacute;pszolg&aacute;ltat&aacute;s, a bemenet &eacute;rv&eacute;nyes &eacute;rt&eacute;kekkel rendelkező cell&aacute;kb&oacute;l &aacute;ll (a nulla &eacute;rv&eacute;nyes &eacute;rt&eacute;k), m&iacute;g a t&ouml;bbi cell&aacute;hoz a NoData &eacute;rt&eacute;ket kell rendelni.
            </p>
        </div>
    </div>
    <div id="inputCostRaster">
        <div><h2>Raszteres útiköltségréteg kiválasztása</h2></div>
        <hr/>
        <div>
            <p>Az egyes cell&aacute;kon t&ouml;rt&eacute;nő, s&iacute;krajzi &eacute;rtelemben vett &aacute;thalad&aacute;s impedanci&aacute;j&aacute;t vagy k&ouml;lts&eacute;g&eacute;t meghat&aacute;roz&oacute; raszter.
            </p>
            <p>Az egyes cellahelyeken szereplő &eacute;rt&eacute;kek az adott cell&aacute;n t&ouml;rt&eacute;nő &aacute;thalad&aacute;s egys&eacute;gnyi t&aacute;vols&aacute;gra eső k&ouml;lts&eacute;g&eacute;t jelentik. Az eszk&ouml;z a cell&aacute;n t&ouml;rt&eacute;nő &aacute;thalad&aacute;s teljes k&ouml;lts&eacute;g&eacute;nek kisz&aacute;m&iacute;t&aacute;s&aacute;hoz megszorozza az egyes cellahelyek &eacute;rt&eacute;k&eacute;t a cellafelbont&aacute;ssal, &eacute;s &aacute;tl&oacute;s mozg&aacute;s eset&eacute;n kompenz&aacute;lja az &eacute;rt&eacute;ket.
            </p>
            <p>A k&ouml;lts&eacute;graszter &eacute;rt&eacute;kei lehetnek integer vagy lebegőpontos &eacute;rt&eacute;kek, de nem lehetnek negat&iacute;vak vagy null&aacute;k (a k&ouml;lts&eacute;g nem lehet negat&iacute;v vagy nulla).
            </p>
        </div>
    </div>
    <div id="inputDestinationRasterOrFeatures">
        <div><h2>Bemeneti raszteres vagy vektoros célállomások</h2></div>
        <hr/>
        <div>
            <p>A t&aacute;vols&aacute;g sz&aacute;m&iacute;t&aacute;s&aacute;hoz haszn&aacute;lt c&eacute;l&aacute;llom&aacute;sokat meghat&aacute;roz&oacute; bemenet. A r&eacute;teg lehet raszteres vagy vektoros.
            </p>
            <p>Ha a bemenet k&eacute;pszolg&aacute;ltat&aacute;s, a bemenet &eacute;rv&eacute;nyes &eacute;rt&eacute;kekkel rendelkező cell&aacute;kb&oacute;l &aacute;ll (a nulla &eacute;rv&eacute;nyes &eacute;rt&eacute;k), m&iacute;g a t&ouml;bbi cell&aacute;hoz a NoData &eacute;rt&eacute;ket kell rendelni.
            </p>
        </div>
    </div>
    <div id="outputPolylineName">
        <div><h2>Eredményül kapott polyline réteg neve</h2></div>
        <hr/>
        <div>
            <p>A  <b>Saj&aacute;t tartalom</b> alatt l&eacute;trej&ouml;vő &eacute;s a t&eacute;rk&eacute;phez hozz&aacute;adott r&eacute;teg neve. Az alap&eacute;rtelmezett n&eacute;v az eszk&ouml;z nev&eacute;től &eacute;s a bemenő r&eacute;teg nev&eacute;től f&uuml;gg. Ha a r&eacute;teg m&aacute;r l&eacute;tezik, akkor a program megk&eacute;ri, hogy adjon meg egy m&aacute;sik nevet.
            </p>
            <p>Az Eredm&eacute;ny ment&eacute;si helye leg&ouml;rd&uuml;lő mezőben megadhatja a  <b>Saj&aacute;t tartalom</b>mapp&aacute;j&aacute;nak nev&eacute;t, ahov&aacute; az eszk&ouml;z <b>menti az eredm&eacute;nyt</b>.
            </p>
        </div>
    </div>
    <div id="pathType">
        <div><h2>A meghatározandó útvonalak típusának kiválasztása</h2></div>
        <hr/>
        <div>
            <p>Meghat&aacute;rozza a bemeneti c&eacute;l&aacute;llom&aacute;sadatok k&ouml;z&ouml;tt szereplő &eacute;rt&eacute;kek &eacute;s z&oacute;n&aacute;k &eacute;rtelmez&eacute;s&eacute;nek m&oacute;dj&aacute;t a k&ouml;lts&eacute;g&uacute;tvonal sz&aacute;m&iacute;t&aacute;sakor.
            </p>
            <ul>
                <li>Legjobb egyed&uuml;l&aacute;ll&oacute; &ndash; a bemeneti c&eacute;l&aacute;llom&aacute;sadatok k&ouml;z&ouml;tt szereplő &ouml;sszes cella vagy hely eset&eacute;n a legkev&eacute;sb&eacute; k&ouml;lts&eacute;ges &uacute;tvonalat a kiindul&oacute;pontba tart&oacute; legkev&eacute;sb&eacute; k&ouml;lts&eacute;ges &uacute;tvonalak minimum&aacute;val rendelkező helyből sz&aacute;rmaztatja. Ez az alap&eacute;rtelmez&eacute;s
                    

                </li>
                <li>Mindegyik cell&aacute;ba &ndash; a bemeneti c&eacute;l&aacute;llom&aacute;sadatok k&ouml;z&ouml;tt szereplő, &eacute;rv&eacute;nyes &eacute;rt&eacute;kekkel rendelkező &ouml;sszes cella vagy hely eset&eacute;n meghat&aacute;rozza a legkev&eacute;sb&eacute; k&ouml;lts&eacute;ges &uacute;tvonalat, &eacute;s menti a kimeneti vektoros adatszolg&aacute;ltat&aacute;sba. Ezt a lehetős&eacute;get v&aacute;lasztva a bemeneti c&eacute;l&aacute;llom&aacute;sadatok k&ouml;z&ouml;tt szereplő cell&aacute;k mindegyik&eacute;t k&uuml;l&ouml;n kezeli, &eacute;s mindegyik kiindul&oacute;cell&aacute;hoz meghat&aacute;rozza a legkev&eacute;sb&eacute; k&ouml;lts&eacute;ges &uacute;tvonalat.
                    

                </li>
                <li>Mindegyik z&oacute;n&aacute;ba &ndash; a bemeneti c&eacute;l&aacute;llom&aacute;sadatok k&ouml;z&ouml;tt szereplő &ouml;sszes z&oacute;na eset&eacute;n meghat&aacute;rozza a legkev&eacute;sb&eacute; k&ouml;lts&eacute;ges &uacute;tvonalat, &eacute;s menti a kimeneti vektoros adatszolg&aacute;ltat&aacute;sba. Ezt a lehetős&eacute;get v&aacute;lasztva az egyes z&oacute;n&aacute;k legkev&eacute;sb&eacute; k&ouml;lts&eacute;ges &uacute;tvonala a z&oacute;n&aacute;ban a legkisebb k&ouml;lts&eacute;gs&uacute;lyozott t&aacute;vols&aacute;ggal rendelkező cell&aacute;n&aacute;l vagy helyn&eacute;l kezdődik.
                    

                </li>
            </ul>
            
        </div>
    </div>
</div>
</html>
