<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Objektumok felismerése deep learning használatával</h2><p/>
        <h2><img src="../images/GUID-EE76A33E-0B8F-48EE-94F8-782FAD241D72-web.png" alt="Objektumok felismer&eacute;se deep learning haszn&aacute;lat&aacute;val"></h2>
        <hr/>
    <p>Ez az eszk&ouml;z tan&iacute;tott deep learning modellt futtat egy bemeneti raszteren egy olyan vektoroselem-oszt&aacute;ly l&eacute;trehoz&aacute;s&aacute;ra, amely a tartalmazza a tal&aacute;lt objektumokat. A vektoros elemek lehetnek az objektum k&ouml;r&uuml;l tal&aacute;lhat&oacute;, hat&aacute;rol&oacute; mezők vagy soksz&ouml;gek, &eacute;s lehetnek pontok az objektumok k&ouml;z&eacute;ppontjaiban.
    </p>
    <p>Ha az  <b>Aktu&aacute;lis t&eacute;rk&eacute;pkiterjed&eacute;s haszn&aacute;lata</b> ki van v&aacute;lasztva, a program csak az aktu&aacute;lis t&eacute;rk&eacute;p-kiterjed&eacute;sen l&aacute;that&oacute; raszterter&uuml;letet elemzi. Ha nincs kiv&aacute;lasztva, akkor az eg&eacute;sz rasztert elemzi, akkor is, ha az k&iacute;v&uuml;l esik az aktu&aacute;lis t&eacute;rk&eacute;p-kiterjed&eacute;sen.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputRaster">
        <div><h2>Válassza ki az objektumok felismeréséhez használt képet</h2></div>
        <hr/>
        <div>
            <p>V&aacute;lassza ki az objektumok felismer&eacute;s&eacute;hez haszn&aacute;lt bemeneti k&eacute;pet.
            </p> 
        </div>
    </div>
    <div id="model">
        <div><h2>Válassza ki a pixelek felismeréséhez használt deep learning modellt</h2></div>
        <hr/>
        <div>
            <p>Bemeneti deep learning csomag ( <code>.dlpk</code>) elem.
            </p>
            <p>A deep learning csomag ebből &aacute;ll: Esri modelldefin&iacute;ci&oacute;s JSON-f&aacute;jl ( <code>.emd</code>), deep learning bin&aacute;ris modellf&aacute;jl, valamint opcion&aacute;lisan az alkalmazand&oacute; Python raszterfunkci&oacute;.
            </p>
        </div>
    </div>
    <div id="modelArguments">
        <div><h2>Adja meg a deep learning modell argumentumait</h2></div>
        <hr/>
        <div>
            <p>A funkci&oacute;argumentumokat a Python raszterfunkci&oacute; oszt&aacute;lyhivatkoz&aacute;sban a bemeneti modell defini&aacute;lja. Itt lehet list&aacute;zni a kieg&eacute;sz&iacute;tő deep learning param&eacute;tereket &eacute;s argumentumokat k&iacute;s&eacute;rletekhez &eacute;s finom&iacute;t&aacute;sokhoz, mint p&eacute;ld&aacute;ul konfidenciak&uuml;sz&ouml;b&ouml;t az &eacute;rz&eacute;kenys&eacute;g &aacute;ll&iacute;t&aacute;s&aacute;hoz.
            </p>
            <p>Az argumentumok nev&eacute;t az eszk&ouml;z t&ouml;lti fel a Python modulb&oacute;l kiolvasva (raszterelemző szerver).
            </p>
        </div>
    </div>
    <div id="runNMS">
        <div><h2>Ismétlődő vektoros elemek eltávolítása a kimenetből (választható)</h2></div>
        <hr/>
        <div>
            <p>Nem maxim&aacute;lis tilt&aacute;st alkalmaz, ahol ism&eacute;tlődő objektumokat azonos&iacute;t, &eacute;s az alacsonyabb konfidencia-&eacute;rt&eacute;kkel rendelkező ism&eacute;tlődő vektoros elemet t&aacute;vol&iacute;tja el. 
                <ul>
                    <li>Nincs kiv&aacute;lasztva&mdash;Az &ouml;sszes felismert objektum benne lesz a kimeneti vektoroselem-oszt&aacute;lyban. Ez az alap&eacute;rtelmez&eacute;s.
                        

                    </li>
                    <li>Ki van v&aacute;lasztva&mdash;Elt&aacute;vol&iacute;tja a felismert ism&eacute;tlődő objektumokat.
                        

                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="confidenceScoreField">
        <div><h2>Konfidencia pontszáma mező</h2></div>
        <hr/>
        <div>
            <p>Az a mező a vektoros szolg&aacute;ltat&aacute;sban, amely a konfidencia pontsz&aacute;mot tartalmazza kimenetk&eacute;nt, az objektum-felismer&eacute;si m&oacute;dszer seg&iacute;ts&eacute;g&eacute;vel.
            </p>
            <p>Ezt a param&eacute;tert meg kell adni, ha a  <b>Nem maxim&aacute;lis tilt&aacute;s</b> param&eacute;ter ki van v&aacute;lasztva.
            </p>
        </div>
    </div>
    <div id="classValueField">
        <div><h2>Osztály értéke mező</h2></div>
        <hr/>
        <div>
            <p>Az oszt&aacute;ly &eacute;rt&eacute;ke mező a kimeneti vektoros szolg&aacute;ltat&aacute;sban. Ha nincs megadva, az eszk&ouml;z a(z)  <i>Classvalue</i> &eacute;s <i>Value</i> standard oszt&aacute;ly&eacute;rt&eacute;k mezőket alkalmazza. Ha ezek a mezők nem l&eacute;teznek, minden vektoros elemet &uacute;gy kezel a program, mint azonos objektumoszt&aacute;lyhoz tartoz&oacute;t.
            </p>
        </div>
    </div>
    <div id="maxOverlapRatio">
        <div><h2>Maximális átfedési arány</h2></div>
        <hr/>
        <div>
            <p>Maxim&aacute;lis &aacute;tfed&eacute;si ar&aacute;ny k&eacute;t &aacute;tfed&eacute;sben l&eacute;vő vektoros elem eset&eacute;n, meghat&aacute;roz&aacute;sa: a metszetter&uuml;let &eacute;s az uni&oacute;ter&uuml;let ar&aacute;nya. Az alap&eacute;rtelmezett &eacute;rt&eacute;k 0.
            </p>
        </div>
    </div>
    <div id="outputObjects">
        <div><h2>Eredményréteg neve</h2></div>
        <hr/>
        <div>
            <p>A  <b>Saj&aacute;t tartalom</b> alatt l&eacute;trej&ouml;vő &eacute;s a t&eacute;rk&eacute;phez hozz&aacute;adott r&eacute;teg neve. Az alap&eacute;rtelmezett n&eacute;v az eszk&ouml;z nev&eacute;től &eacute;s a bemenő r&eacute;teg nev&eacute;től f&uuml;gg. Ha a r&eacute;teg m&aacute;r l&eacute;tezik, akkor a program megk&eacute;ri, hogy adjon meg egy m&aacute;sik nevet.
            </p>
            <p>Az Eredm&eacute;ny ment&eacute;si helye leg&ouml;rd&uuml;lő mezőben megadhatja a  <b>Saj&aacute;t tartalom</b>mapp&aacute;j&aacute;nak nev&eacute;t, ahov&aacute; az eszk&ouml;z <b>menti az eredm&eacute;nyt</b>.
            </p>
        </div>
    </div>
</div>
</html>
