<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Határok összeolvasztása</h2><p/>
        <h2><img src="../images/GUID-7B5F69B0-3625-404F-8B52-2B562766C0BB-web.png" alt="Hat&aacute;rok &ouml;sszeolvaszt&aacute;sa"></h2>
        <hr/>
    <p>Az egym&aacute;st &aacute;tfedő vagy k&ouml;z&ouml;s hat&aacute;rvonallal, ill. k&ouml;z&ouml;s attrib&uacute;tum&eacute;rt&eacute;kekkel rendelkező  ter&uuml;letek &ouml;sszeolvasztva egyetlen ter&uuml;letet alkotnak.
    </p>
    <p>Az &ouml;sszeolvasztani k&iacute;v&aacute;nt hat&aacute;rvonalakat egy mező meghat&aacute;roz&aacute;s&aacute;val szab&aacute;lyozhatja. Ha p&eacute;ld&aacute;ul van egy megy&eacute;ket tartalmaz&oacute; r&eacute;tege, &eacute;s mindegyik megy&eacute;nek van  <pre>State_Name</pre> attrib&uacute;tuma, akkor a <pre>State_Name</pre> attrib&uacute;tum haszn&aacute;lat&aacute;val &ouml;sszeolvaszthatja a hat&aacute;rokat.  A szomsz&eacute;dos megy&eacute;k azonos <pre>State_Name</pre>&eacute;rt&eacute;k eset&eacute;n egyes&iacute;thetők.  Az eredm&eacute;ny egy &aacute;llamhat&aacute;rokat tartalmaz&oacute; r&eacute;teg.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Terület réteg kiválasztása a határvonalak összeolvasztásához</h2></div>
        <hr/>
        <div>
            <p>A ter&uuml;let vektoros elemeket tartalmaz&oacute;, &ouml;sszeolvasztand&oacute; r&eacute;teg. 
            </p>
            <p>Ahelyett, hogy egy r&eacute;teget v&aacute;laszt a t&eacute;rk&eacute;p&eacute;ről, v&aacute;laszthatja a leg&ouml;rd&uuml;lő lista alj&aacute;n l&eacute;vő  <b>Eredm&eacute;nyr&eacute;teg kiv&aacute;laszt&aacute;sa</b> lehetős&eacute;get is, ha a saj&aacute;t tartalomban szeretne big data-f&aacute;jlmegoszt&oacute; adathalmazt vagy vektoros r&eacute;teget keresni.
            </p>
        </div>
    </div>
    <div id="dissolveFields">
        <div><h2>Összeolvasztási módszer kiválasztása</h2></div>
        <hr/>
        <div>
            <p>Meghat&aacute;rozza a mezők &ouml;sszeolvaszt&aacute;s&aacute;hoz alkalmazand&oacute; m&oacute;dszert.
            </p>
            <p>A ter&uuml;let vektoros elemek egyes&iacute;t&eacute;s&eacute;hez k&eacute;t m&oacute;dszer k&ouml;z&uuml;l v&aacute;laszthat:
                <ul>
                    <li> <b>Egym&aacute;st &aacute;tfedő vagy szomsz&eacute;dos ter&uuml;letek</b> &ndash; K&eacute;t vagy t&ouml;bb, egym&aacute;st &aacute;tfedő hat&aacute;rvonalakkal rendelkező ter&uuml;let &ouml;sszeolvad egy ter&uuml;lett&eacute;.  Ezenk&iacute;v&uuml;l a szomsz&eacute;dos (azaz k&ouml;z&ouml;s hat&aacute;rvonalon osztoz&oacute;) ter&uuml;letek &ouml;sszeolvadnak egy ter&uuml;lett&eacute;.
                    </li>
                    <li> <b>Azonos mező&eacute;rt&eacute;kű ter&uuml;letek</b> &ndash; K&eacute;t vagy t&ouml;bb ter&uuml;let &ouml;sszeolvad egy ter&uuml;lett&eacute;, amennyiben azonos a mező&eacute;rt&eacute;k&uuml;k.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="multipart">
        <div><h2>Csoportosított vektoros elemek létrehozása</h2></div>
        <hr/>
        <div>
            <p>A csoportos&iacute;tott vektoros elem egy egyn&eacute;l t&ouml;bb r&eacute;szből &aacute;ll&oacute; hely vagy dolog &aacute;br&aacute;zol&aacute;sa, amely azonban egyetlen vektoros elemk&eacute;nt van defini&aacute;lva, mivel egyetlen attrib&uacute;tumk&eacute;szletre hivatkozik. Az &aacute;llamok r&eacute;teg&eacute;ben p&eacute;ld&aacute;ul Hawaii t&ouml;bb r&eacute;szből &aacute;ll&oacute; vektoros elemnek tekinthető, mivel a k&uuml;l&ouml;n&aacute;ll&oacute; geometriai r&eacute;szei egyetlen &aacute;llamnak minős&uuml;lnek.
            </p>
            <p> <b>Csoportos&iacute;tott vektoros elemek l&eacute;trehoz&aacute;sa</b> k&eacute;tf&eacute;le m&oacute;don t&ouml;rt&eacute;nhet:
                <ul>
                    <li>Igaz (kijel&ouml;lt)&mdash; a kimeneti szolg&aacute;ltat&aacute;s csoportos&iacute;tott vektoros elemeket tartalmazhat.
                    </li>
                    <li>Hamis (kijel&ouml;letlen)&mdash; a kimeneti szolg&aacute;ltat&aacute;s csak egy r&eacute;szből &aacute;ll&oacute; vektoros elemeket tartalmaz, &eacute;s minden r&eacute;szhez k&uuml;l&ouml;n&aacute;ll&oacute; vektoros elemek lesznek l&eacute;trehozva. Ez az alap&eacute;rtelmez&eacute;s.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="summaryFields">
        <div><h2>Statisztika hozzáadása (opcionális)</h2></div>
        <hr/>
        <div>
            <p>Ter&uuml;letek egyes&iacute;t&eacute;sekor azok attrib&uacute;tum&eacute;rt&eacute;keit k&ouml;nnyen &eacute;rtelmezhető statisztik&aacute;kkal &ouml;sszegezheti.  Ha p&eacute;ld&aacute;ul  <pre>State_Name</pre> alapj&aacute;n megy&eacute;k k&ouml;z&ouml;tti hat&aacute;rvonalat olvaszt &ouml;ssze, &eacute;s az egyes megy&eacute;k rendelkeznek <i>Population</i> mezővel, akkor <pre>Population</pre> &ouml;sszeget sz&aacute;molhat az &aacute;llamra vonatkoztatva.
            </p>
            <p> Statisztik&aacute;kat sz&aacute;m&iacute;that &ouml;sszes&iacute;tett vektoros elemeken. Numerikus mezők&ouml;n a k&ouml;vetkező statisztik&aacute;k sz&aacute;m&iacute;that&oacute;k:
                <ul>
                    <li>Sz&aacute;m &ndash; a nem null &eacute;rt&eacute;kek darabsz&aacute;m&aacute;t sz&aacute;m&iacute;tja ki. Numerikus mezők&ouml;n vagy karakterl&aacute;ncokon haszn&aacute;lhat&oacute;. A [null, 0, 2] darabsz&aacute;ma 2.
                    </li>
                    <li>&Ouml;sszeg &ndash; egy mezőben l&eacute;vő numerikus &eacute;rt&eacute;kek &ouml;sszege. A [null, null, 3] &ouml;sszege 3.
                    </li>
                    <li>&Aacute;tlag &ndash; a numerikus &eacute;rt&eacute;kek &aacute;tlaga. A [0, 2, null] &aacute;tlaga 1.
                    </li>
                    <li>Min &ndash; egy numerikus mező legkisebb &eacute;rt&eacute;ke. A [0, 2, null] minimuma 0. 
                    </li>
                    <li>Max &ndash; egy numerikus mező legnagyobb &eacute;rt&eacute;ke. A [0, 2, null] maximuma 2.
                    </li>
                    <li>Terjedelem &ndash; egy numerikus mező terjedelme. Ennek kisz&aacute;m&iacute;t&aacute;s&aacute;hoz az eszk&ouml;z a legkisebb &eacute;rt&eacute;keket vonja ki a legnagyobb &eacute;rt&eacute;kből. A [0, null, 1] terjedelme 1. A [null, 4] terjedelme 0.
                    </li>
                    <li>Variancia &ndash; egy numerikus mező varianci&aacute;ja egy k&ouml;vet&eacute;sben. Az [1] varianci&aacute;ja null &eacute;rt&eacute;kű. A [null, 1, 0, 1, 1] varianci&aacute;ja 0,25.
                    </li>
                    <li>Sz&oacute;r&aacute;s &ndash; egy numerikus mező sz&oacute;r&aacute;sa. Az [1] sz&oacute;r&aacute;sa null &eacute;rt&eacute;kű. A [null, 1, 0, 1, 1] sz&oacute;r&aacute;sa 0,5. 
                    </li>
                </ul>
                
            </p>
            <p>Karakterl&aacute;nc t&iacute;pus&uacute; mezők&ouml;n a k&ouml;vetkező statisztik&aacute;k sz&aacute;m&iacute;that&oacute;k:
                <ul>
                    <li>Sz&aacute;m &ndash; a nem null karakterl&aacute;ncok darabsz&aacute;ma.
                    </li>
                    <li>B&aacute;rmelyik &ndash; ez a statisztika a megadott mezőben l&eacute;vő karakterl&aacute;nc egy v&eacute;letlenszerű mint&aacute;ja.
                    </li>
                </ul>
                Mindegyik statisztika sz&aacute;m&iacute;t&aacute;sa nem null &eacute;rt&eacute;keken t&ouml;rt&eacute;nik. Az eredm&eacute;ny&uuml;l kapott r&eacute;teg kisz&aacute;m&iacute;tott statisztikai adatonk&eacute;nt egy-egy &uacute;j mezőt fog tartalmazni. Attrib&uacute;tum &eacute;s statisztika kiv&aacute;laszt&aacute;s&aacute;val tetszőleges sz&aacute;m&uacute; statisztika hozz&aacute;adhat&oacute;. 
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Eredményréteg neve</h2></div>
        <hr/>
        <div>
            <p> A l&eacute;trehozand&oacute; r&eacute;teg neve.  Ha egy ArcGIS Data Store helyre &iacute;r, akkor  eredm&eacute;nyei a  <b>Saj&aacute;t tartalom</b> alatt lesznek elmentve, &eacute;s hozz&aacute; lesznek adva a t&eacute;rk&eacute;phez. Ha egy big data f&aacute;jlmegoszt&oacute;ba &iacute;r, akkor eredm&eacute;nyei a big data f&aacute;jlmegoszt&oacute;ba lesznek elmentve, &eacute;s hozz&aacute; lesznek adva annak jegyz&eacute;kf&aacute;jlj&aacute;hoz. Nem lesznek hozz&aacute;adva a t&eacute;rk&eacute;phez. Az alap&eacute;rtelmezett n&eacute;v az eszk&ouml;z nev&eacute;től &eacute;s a bemenő r&eacute;teg nev&eacute;től f&uuml;gg. Ha a r&eacute;teg m&aacute;r l&eacute;tezik, akkor a művelet sikertelen lesz.
            </p>
            <p>Ha   ArcGIS Data Store (rel&aacute;ci&oacute;s vagy t&eacute;rbeli-időbeli big data adatt&aacute;rba) &iacute;r az  <b>Eredm&eacute;ny ment&eacute;si helye</b> leg&ouml;rd&uuml;lő mező haszn&aacute;lat&aacute;val, akkor megadhatja a <b>Saj&aacute;t tartalom</b> mapp&aacute;j&aacute;nak nev&eacute;t, ahov&aacute; az eszk&ouml;z menti az eredm&eacute;nyt.
            </p>
        </div>
    </div>
</div>
</html>
