<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Legközelebbi keresése</h2><p/>
        <h2><img src="../images/GUID-150C2484-7459-405A-8835-B4E72CD49738-web.png" alt="Legk&ouml;zelebbi keres&eacute;se"></h2>
        <hr/>
    <p>Ez az eszk&ouml;z megkeresi a legk&ouml;zelebbi vektoros elemeket, &eacute;s &ouml;sszegzi &eacute;s rangsorolja a k&ouml;zeli vektoros elemektől val&oacute; t&aacute;vols&aacute;got. Az eszk&ouml;z l&eacute;gvonalbeli t&aacute;vols&aacute;g m&eacute;r&eacute;s&eacute;vel vagy a kiv&aacute;lasztott utaz&aacute;si m&oacute;d haszn&aacute;lat&aacute;val k&eacute;pes megkeresni a legk&ouml;zelebbi elemet. Lehetős&eacute;g van a keresett legk&ouml;zelebbi vektoros elemek sz&aacute;ma vagy a keres&eacute;si tartom&aacute;ny szűk&iacute;t&eacute;s&eacute;re. Az eszk&ouml;zzel kapott eredm&eacute;nyek seg&iacute;ts&eacute;g&eacute;vel v&aacute;laszt kaphat az al&aacute;bbi &eacute;s hasonl&oacute; k&eacute;rd&eacute;sekre:
        <ul>
            <li>Hol tal&aacute;lhat&oacute; a legk&ouml;zelebbi park?
            </li>
            <li>Melyik k&oacute;rh&aacute;zba &eacute;rhetek el a legr&ouml;videbb időn bel&uuml;l? Mennyi ideig tartana az utaz&aacute;s kedd d.u. 5:30, azaz cs&uacute;csforgalmon bel&uuml;li indul&aacute;s eset&eacute;n?
            </li>
            <li>Mekkora a t&aacute;vols&aacute;g k&ouml;z&uacute;ton a megadott nagyv&aacute;rosok k&ouml;z&ouml;tt?
            </li>
            <li>A betegek k&ouml;z&uuml;l kik laknak a megadott vegyi &uuml;zemektől k&eacute;t m&eacute;rf&ouml;ld&ouml;n bel&uuml;l?
            </li>
        </ul>
        
    </p>
    <p>A Legk&ouml;zelebbi keres&eacute;se eszk&ouml;z a legk&ouml;zelebbi vektoros elemeket tartalmaz&oacute; r&eacute;teget &eacute;s egy vonal r&eacute;teget ad eredm&eacute;ny&uuml;l, amely &ouml;sszek&ouml;ti a kiindul&aacute;si helyeket a legk&ouml;zelebbi helyekkel. A vonal r&eacute;teg tartalmazza a kiindul&aacute;si helyre &eacute;s a legk&ouml;zelebbi helyekre vonatkoz&oacute; inform&aacute;ci&oacute;t &eacute;s a k&ouml;z&ouml;tt&uuml;k l&eacute;vő t&aacute;vols&aacute;got.
    </p>
    <p>Az  <b>Aktu&aacute;lis t&eacute;rk&eacute;p kiterjed&eacute;s haszn&aacute;lata</b> bejel&ouml;l&eacute;s&eacute;vel a program csak az aktu&aacute;lis t&eacute;rk&eacute;p kiterjed&eacute;sen l&aacute;that&oacute; vektoros elemeket tekinti kiindul&aacute;si &eacute;s potenci&aacute;lisan legk&ouml;zelebbi vektoros elemnek.  Ha nincs bejel&ouml;lve, akkor a bemeneti r&eacute;teg &ouml;sszes vektoros elem&eacute;t figyelembe veszi, akkor is, ha azok k&iacute;v&uuml;l esnek az aktu&aacute;lis t&eacute;rk&eacute;p kiterjed&eacute;sen.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="analysisLayer">
        <div><h2>Kiindulási hely megadása</h2></div>
        <hr/>
        <div>
            <p>A Legk&ouml;zelebbi keres&eacute;se eszk&ouml;z megm&eacute;ri a t&aacute;vols&aacute;got az itt megadott r&eacute;teg vektoros elemei (a kiindul&aacute;si helyek) &eacute;s a k&ouml;vetkező param&eacute;terben megadott r&eacute;teg helyei k&ouml;z&ouml;tt.  Az eszk&ouml;z legfeljebb  5000 vektoros elemet t&aacute;mogat az egyes r&eacute;tegeken. 
            </p>
        </div>
    </div>
    <div id="NearbyLocationsLayer">
        <div><h2>Legközelebbi helyek keresésének helye</h2></div>
        <hr/>
        <div>
            <p>A Legk&ouml;zelebbi keres&eacute;se eszk&ouml;z megm&eacute;ri a t&aacute;vols&aacute;got az első r&eacute;teg vektoros elemei &eacute;s az ezen a r&eacute;tegen megadott vektoros elemek k&ouml;z&ouml;tt. Az eszk&ouml;z legfeljebb  5000 helyet t&aacute;mogat az egyes r&eacute;tegeken. </p>
            <p>A t&eacute;rk&eacute;p egy r&eacute;teg&eacute;nek kiv&aacute;laszt&aacute;sa mellett v&aacute;laszthatja a leg&ouml;rd&uuml;lő lista alj&aacute;n tal&aacute;lhat&oacute;  <b>Elemz&eacute;si r&eacute;teg kiv&aacute;laszt&aacute;sa</b> lehetős&eacute;get is. Ennek a lehetős&eacute;gnek a v&aacute;laszt&aacute;sakor egy gal&eacute;ria ny&iacute;lik meg, amelyben k&uuml;l&ouml;nb&ouml;ző forr&aacute;sokb&oacute;l sz&aacute;rmaz&oacute; adathalmazok k&ouml;z&uuml;l v&aacute;logathat, &eacute;s ezeket felhaszn&aacute;lhatja az elemz&eacute;s&eacute;ben. 
            </p>
        </div>
    </div>
    <div id="MeasurementMethod">
        <div><h2>Mérés</h2></div>
        <hr/>
        <div>
            <p>V&aacute;lasszon, hogy l&eacute;gvonalbeli t&aacute;vols&aacute;g vagy a kiv&aacute;lasztott utaz&aacute;si m&oacute;d alapj&aacute;n szeretn&eacute;-e megkeresni a legk&ouml;zelebbi helyeket. Az utaz&aacute;si m&oacute;dok csak akkor enged&eacute;lyezettek, ha a első bemenő r&eacute;teg pontokat tartalmaz. Az el&eacute;rhető utaz&aacute;si m&oacute;dokat a szervezet rendszergazd&aacute;ja hat&aacute;rozza meg.  Az utaz&aacute;si m&oacute;dok egyik&eacute;nek haszn&aacute;latakor az eszk&ouml;z utak vagy gyalogutak ment&eacute;n, a vonatkoz&oacute; szab&aacute;lyok, mint p&eacute;ld&aacute;ul egyir&aacute;ny&uacute; utak, megfordul&aacute;si tilalom stb. betart&aacute;s&aacute;val v&eacute;gzi a m&eacute;r&eacute;seket.
            </p>
            <p>Vonalak vagy ter&uuml;letek k&ouml;z&ouml;tti m&eacute;r&eacute;s eset&eacute;n az eszk&ouml;z a vonal vagy a ter&uuml;let hat&aacute;rvonala ment&eacute;n hat&aacute;rozza meg a legk&ouml;zelebbi pontt&oacute;l val&oacute; t&aacute;vols&aacute;got. 
            </p> 
            <p>Az  <b>Utaz&aacute;si idő</b>, <b>Vid&eacute;ki utaz&aacute;si idő</b>, vagy <b>Tehersz&aacute;ll&iacute;t&aacute;si idő</b> lehetős&eacute;g kiv&aacute;laszt&aacute;sakor v&aacute;laszthat, hogyan k&iacute;v&aacute;nja m&eacute;rni az utaz&aacute;si időt.
                <ul>
                    <li>
                        <p>A  <b>Forgalom haszn&aacute;lata</b> jel&ouml;l&eacute;s megsz&uuml;ntet&eacute;s&eacute;vel a legk&ouml;zelebbi vektoros elemeket &aacute;lland&oacute; halad&aacute;si sebess&eacute;g, p&eacute;ld&aacute;ul sebess&eacute;gkorl&aacute;toz&aacute;sok alapul v&eacute;tel&eacute;vel hat&aacute;rozhatja meg, a v&aacute;ltoz&oacute; k&ouml;zleked&eacute;si helyzet okozta v&aacute;ltoz&oacute; sebess&eacute;g helyett.
                        </p>
                        <p>V&aacute;lassza ezt a lehetős&eacute;get, ha szeretn&eacute; megtudni, hogy mi van a legk&ouml;zelebb &aacute;ltal&aacute;ban, de nem mindenk&eacute;ppen, ha az adott nap &eacute;s napszak k&ouml;zleked&eacute;si helyzet&eacute;t is figyelembe veszi.
                        </p>
                    </li>
                    <li>
                        <p>A  <b>Forgalom haszn&aacute;lata</b> jel&ouml;lőn&eacute;gyzet bejel&ouml;l&eacute;s&eacute;vel megadott indul&aacute;si idő &eacute;s v&aacute;ltoz&oacute; k&ouml;zleked&eacute;si helyzet alapj&aacute;n megkeresheti a legk&ouml;zelebbi vektoros elemeket. Ha a <b>Val&oacute;s idejű forgalom</b> lehetős&eacute;get is bejel&ouml;li, akkor a kiindul&aacute;si helyeken az indul&aacute;si idő az aktu&aacute;lis idő lesz, &eacute;s a legk&ouml;zelebbi vektoros elemek meghat&aacute;roz&aacute;sa &eacute;rz&eacute;kelők &eacute;s h&iacute;rfolyamok &aacute;ltal szolg&aacute;ltatott, aktu&aacute;lis &eacute;s a v&aacute;rhat&oacute; forgalmon alapul&oacute; sebess&eacute;g alapj&aacute;n t&ouml;rt&eacute;nik. Az eszk&ouml;z a v&aacute;rhat&oacute; forgalmon alapul&oacute; sebess&eacute;get val&oacute;s idejű forgalom szerinti, kor&aacute;bbi sebess&eacute;gek &eacute;s aktu&aacute;lis esem&eacute;nyek, p&eacute;ld&aacute;ul az időj&aacute;r&aacute;s alapj&aacute;n sz&aacute;m&iacute;tja ki. A forgalom v&aacute;rhat&oacute; sebess&eacute;ge 12 &oacute;r&aacute;val jelezhető előre, azaz a cs&uacute;szka elh&uacute;z&aacute;s&aacute;val 12 &oacute;r&aacute;val &aacute;ll&iacute;thatja előr&eacute;bb az indul&aacute;si időt.
                        </p>
                        <p>A fenti val&oacute;s idejű forgalmi be&aacute;ll&iacute;t&aacute;sok haszn&aacute;lat&aacute;val megkeresheti az azonnali indul&aacute;ssal, egy &oacute;r&aacute;n bel&uuml;li indul&aacute;ssal stb. a legr&ouml;videbb időn bel&uuml;l el&eacute;rhető vektoros elemeket.
                        </p>
                    </li>
                    <li>
                        <p>A  <b>Forgalom haszn&aacute;lata</b> bejel&ouml;l&eacute;s&eacute;vel &eacute;s a <b>Időszak jellemző viszonyain alapul&oacute; forgalom</b> v&aacute;laszt&aacute;s&aacute;val kiv&aacute;laszthatja a napot &eacute;s az időpontot, az eszk&ouml;z pedig megkeresi a legk&ouml;zelebbi vektoros elemeket a kor&aacute;bbi &aacute;tlagsebess&eacute;gek alapj&aacute;n egy szok&aacute;sos h&eacute;t &ouml;tperces intervallumaira vet&iacute;tve. Az eredm&eacute;nyek tartalmazz&aacute;k a forgalmat, de kiszűrve az aktu&aacute;lis k&ouml;zleked&eacute;si helyzet &eacute;s az olyan esem&eacute;nyek hat&aacute;s&aacute;t, amelyek jelentősen elt&eacute;rhetnek a szok&aacute;sost&oacute;l.
                        </p>
                        <p>A kor&aacute;bbi forgalmi be&aacute;ll&iacute;t&aacute;sok haszn&aacute;lat&aacute;val v&aacute;laszt kaphat p&eacute;ld&aacute;ul arra a k&eacute;rd&eacute;sre, hogy &bdquo;Melyik vektoros elemek &eacute;rhetők e leggyorsabban a kiindul&aacute;si vektoros elemeket szerda d.e. 11:30 &oacute;rakor elhagyva?&rdquo; 
                        </p>
                        <p>A be&aacute;ll&iacute;tott idő annak az időz&oacute;n&aacute;nak felel meg, amelyben a kiindul&aacute;si vektoros elemek tal&aacute;lhat&oacute;k. Ha teh&aacute;t p&eacute;ld&aacute;ul d.e. 8:00 &oacute;r&aacute;ra &aacute;ll&iacute;tja az időt, &eacute;s k&eacute;t kiindul&aacute;si vektoros elemet ad meg, az egyik New York, a m&aacute;sik Los Angeles, akkor a legk&ouml;zelebbi helyek keres&eacute;se d.e. 8:00 &oacute;ra indul&aacute;si időpont felt&eacute;telez&eacute;s&eacute;vel t&ouml;rt&eacute;nik. keleti idő szerinti d.e. 8:00 &oacute;rai indul&aacute;si idővel, a m&aacute;sik a csendes-&oacute;ce&aacute;ni idő szerinti d.e. 8:00 &oacute;rai indul&aacute;si idővel.
                        </p>
                    </li>
                </ul>
                &Uuml;gyeljen arra, hogy mik&ouml;zben a j&aacute;rmű kifel&eacute; halad egy pontt&oacute;l, az idő m&uacute;lt&aacute;val a k&ouml;zleked&eacute;si helyzet v&aacute;ltozik. Ez az eszk&ouml;z figyelembe veszi ezeket a vari&aacute;ci&oacute;kat, ha r&aacute;kattint a <b>Forgalom haszn&aacute;lata</b> lehetős&eacute;gre; azonban nem minden r&eacute;gi&oacute; t&aacute;mogatja a forgalmat. Az eszk&ouml;zben az <b>El&eacute;rhetős&eacute;g megtekint&eacute;se</b> hivatkoz&aacute;sra kattintva megtekintheti, hogy el&eacute;rhető-e a minta ter&uuml;leten. 
            </p>
            <p>A  <b>Tehersz&aacute;ll&iacute;t&aacute;si idő</b> k&eacute;pes forgalmon alapul&oacute; dinamikus utaz&aacute;si sebess&eacute;get haszn&aacute;lni, de legfeljebb a teheraut&oacute;k t&ouml;rv&eacute;nyben megengedett maxim&aacute;lis sebess&eacute;ghat&aacute;r&aacute;ig. Ha p&eacute;ld&aacute;ul a dinamikus sebess&eacute;g egy k&ouml;z&uacute;ton a val&oacute;s idejű forgalom alapj&aacute;n 65 m&eacute;rf&ouml;ld/&oacute;ra, de a teherg&eacute;pj&aacute;rművekre &eacute;rv&eacute;nyes sebess&eacute;gkorl&aacute;toz&aacute;s az adott k&ouml;z&uacute;ton 55 m&eacute;rf&ouml;ld/&oacute;ra, akkor a sz&aacute;m&iacute;t&aacute;s az 55 m&eacute;rf&ouml;ld/&oacute;ra sebess&eacute;get veszi figyelembe ezen a k&ouml;z&uacute;ton.
            </p>
        </div>
    </div>
    <div id="barrier_layers">
        <div><h2>Határrétegek kiválasztása</h2></div>
        <hr/>
        <div>
            <p> Egy vagy t&ouml;bb olyan funkci&oacute;, ami ideiglenes korl&aacute;toz&aacute;sk&eacute;nt műk&ouml;dik (hat&aacute;rk&eacute;nt), amikor az &eacute;rintett utc&aacute;kon k&ouml;zlekedik. A korl&aacute;tokat a pontok, vonalak vagy polygon tulajdons&aacute;gaival hat&aacute;rozhatja meg.
            </p>
            <p>Egy korl&aacute;t pont lehet egy let&ouml;r&ouml;tt fa&aacute;g, egy k&ouml;zleked&eacute;si baleset, egy leszakadt elektromos vezet&eacute;k, vagy b&aacute;rmi, ami egy adott helyen teljes m&eacute;rt&eacute;kben megakad&aacute;lyozza az utcai k&ouml;zleked&eacute;st. A k&ouml;zleked&eacute;s enged&eacute;lyezett az utc&aacute;n, de a korl&aacute;t ponton t&uacute;l m&aacute;r nem. Legfeljebb 250 olyan funkci&oacute;t hat&aacute;rozhat meg, ami hat&aacute;rk&eacute;nt műk&ouml;dhet.
            </p>
            <p>A korl&aacute;t vonal megakad&aacute;lyozza a k&ouml;zleked&eacute;st minden olyan ponton, ahol az keresztezi az utc&aacute;t. P&eacute;ld&aacute;ul egy felvonul&aacute;s vagy t&uuml;ntet&eacute;s megakad&aacute;lyozza a k&ouml;zleked&eacute;st t&ouml;bb utca szakaszon is, ez&eacute;rt ezt korl&aacute;t vonallal lehet modellezni. Ha az utc&aacute;t keresztező korl&aacute;t vonalak sz&aacute;ma meghaladja az 500-at, akkor az eszk&ouml;z hiba&uuml;zenetet ad.
            </p>
            <p>A polygon korl&aacute;t megakad&aacute;lyozza a k&ouml;zleked&eacute;st minden olyan ponton, ahol az keresztezi az utc&aacute;t. Ilyen jellegű korl&aacute;t lehet p&eacute;ld&aacute;ul egy &aacute;rad&aacute;s, ami utc&aacute;k eg&eacute;sz h&aacute;l&oacute;zat&aacute;t fedi le, &iacute;gy megakad&aacute;lyozva a k&ouml;zleked&eacute;st. Ha az utc&aacute;t keresztező polygonok sz&aacute;ma meghaladja az 2000-et, akkor az eszk&ouml;z hiba&uuml;zenetet ad.
            </p>
        </div>
    </div>
    <div id="Cutoffs">
        <div><h2>A bemenő réteg minden helyére</h2></div>
        <hr/>
        <div>
            <p>A legk&ouml;zelebbi helyek keres&eacute;s&eacute;t k&eacute;tf&eacute;lek&eacute;ppen szűk&iacute;theti. Az egyik lehetős&eacute;g, hogy cs&ouml;kkenti a kiindul&aacute;si helyenk&eacute;nt keresendő legk&ouml;zelebbi helyek maxim&aacute;lis sz&aacute;m&aacute;t. Megkeresheti a legk&ouml;zelebbi parkot, a k&eacute;t legk&ouml;zelebbi parkot &eacute;s &iacute;gy tov&aacute;bb. A m&aacute;sik lehetős&eacute;g a maxim&aacute;lis keres&eacute;si t&aacute;vols&aacute;g vagy el&eacute;r&eacute;si idő be&aacute;ll&iacute;t&aacute;sa.
            </p>
            <p>A jel&ouml;l&eacute;sek megsz&uuml;ntet&eacute;se eset&eacute;n a keresendő legk&ouml;zelebbi helyek maxim&aacute;lis sz&aacute;ma 100 (az eszk&ouml;z korl&aacute;toz&aacute;sa), a maxim&aacute;lis keres&eacute;si tartom&aacute;ny pedig korl&aacute;tlan.
            </p>
            <p>A feldolgoz&aacute;si idő f&uuml;gg a kiindul&aacute;si helyek sz&aacute;m&aacute;t&oacute;l, a k&ouml;zeli helyek sz&aacute;m&aacute;t&oacute;l &eacute;s a maxim&aacute;lis keres&eacute;si tartom&aacute;nyt&oacute;l.   T&ouml;bb hely vagy nagyobb keres&eacute;si tartom&aacute;nyok eset&eacute;n a feldolgoz&aacute;s t&ouml;bb időt vesz ig&eacute;nybe.
            </p>
            <p>Megjegyzendő, hogy a keres&eacute;si tartom&aacute;ny korl&aacute;toz&aacute;sa eset&eacute;n lehet, hogy az eszk&ouml;z nem fogja megtal&aacute;lni a tartom&aacute;nyban l&eacute;vő legk&ouml;zelebbi helyeket, vagy kevesebb helyet tal&aacute;l a legk&ouml;zelebbi helyek megadott maxim&aacute;lis sz&aacute;m&aacute;n&aacute;l.
            </p>
        </div>
    </div>
    <div id="OutputNearestLocationsLayer">
        <div><h2>Eredményréteg neve</h2></div>
        <hr/>
        <div>
            <p>Ez a  <b>Saj&aacute;t tartalom</b> alatt l&eacute;trej&ouml;vő &eacute;s a t&eacute;rk&eacute;phez hozz&aacute;adott vektoros r&eacute;teg neve. Ha a vektoros r&eacute;teg m&aacute;r l&eacute;tezik, akkor a program megk&eacute;ri, hogy adjon meg egy m&aacute;sik nevet. A vektoros r&eacute;teg k&eacute;t r&eacute;teget tartalmaz: az egyik a legk&ouml;zelebbi helyeknek, a m&aacute;sik a bemenő helyeket a legk&ouml;zelebbi helyekkel &ouml;sszek&ouml;tő vonalaknak felel meg.
            </p>
            <p>Az  <b>&Uacute;tvonal r&eacute;tegek belefoglal&aacute;sa</b> kijel&ouml;l&eacute;sekor az eszk&ouml;z az eredm&eacute;ny minden egyes &uacute;tvonal&aacute;t elmenti &uacute;tvonal r&eacute;tegk&eacute;nt. Az &uacute;tvonal r&eacute;teg mag&aacute;ban foglalja az adott &uacute;tvonal &ouml;sszes inform&aacute;ci&oacute;j&aacute;t, p&eacute;ld&aacute;ul az &uacute;tvonalhoz hozz&aacute;rendelt meg&aacute;ll&oacute;helyeket &eacute;s a halad&aacute;si ir&aacute;nyokat. &Uacute;tvonal r&eacute;tegek l&eacute;trehoz&aacute;sa olyankor hasznos, ha szeretn&eacute; megosztani az egyes &uacute;tvonalakat a szervezet m&aacute;s tagjaival, vagy szeretn&eacute; tov&aacute;bb m&oacute;dos&iacute;tani az &uacute;tvonalakat az <b>Ir&aacute;nyok</b> gomb haszn&aacute;lat&aacute;val a t&eacute;rk&eacute;pn&eacute;zegető ablakban. Az &uacute;tvonal r&eacute;tegek a vektoros r&eacute;tegen megadott nevet haszn&aacute;lj&aacute;k előtagk&eacute;nt, &eacute;s az elemz&eacute;s r&eacute;szek&eacute;nt l&eacute;trehozott &uacute;tvonaln&eacute;v hozz&aacute;ad&aacute;s&aacute;val l&eacute;trehozz&aacute;k az egyes &uacute;tvonal r&eacute;tegek egyedi nev&eacute;t.
            </p>
            <p>A l&eacute;trehozhat&oacute; &uacute;tvonal r&eacute;tegek maxim&aacute;lis sz&aacute;ma  1000. Ha az eredm&eacute;ny t&ouml;bb mint  1000 &uacute;tvonalat tartalmaz, &eacute;s az  <b>&Uacute;tvonal r&eacute;tegek befoglal&aacute;sa</b> be van jel&ouml;lve, akkor az eszk&ouml;z csak a kimeneti vektoros elem szolg&aacute;ltat&aacute;st hozza l&eacute;tre.
            </p>
            <p>Az  <b>Eredm&eacute;ny ment&eacute;si helye</b> leg&ouml;rd&uuml;lő men&uuml;ben megadhatja a <b>Saj&aacute;t tartalom</b> mapp&aacute;j&aacute;nak nev&eacute;t, ahov&aacute; az eszk&ouml;z menti a vektoros r&eacute;teget &eacute;s a l&eacute;trehozott &uacute;tvonalr&eacute;tegeket.
            </p>
        </div>
    </div>
</div>
</html>
