<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Consolida punts</h2><p/>
        <h2><img src="../images/GUID-60C59C66-3038-4D0E-8F6A-EC6C53FEAA02-web.png" alt="Consolida punts"></h2>
        <hr/>
    <p>Aquesta eina funciona amb una capa d'entitats de punts i una capa d'entitats d'&agrave;rees. Primer, determina quins punts es troben dins de cada &agrave;rea. Despr&eacute;s de determinar aquesta relaci&oacute; espacial de punt en una &agrave;rea, les estad&iacute;stiques sobre tots els punts de l'&agrave;rea es calculen i s'assignen a l'&agrave;rea. L'estad&iacute;stica m&eacute;s b&agrave;sica &eacute;s el recompte del nombre de punts dins de l'&agrave;rea, per&ograve; tamb&eacute; podeu obtenir altres estad&iacute;stiques. 
    </p>
    <p>Per exemple, suposeu que teniu entitats de punts d'ubicacions de cafeteries i entitats d'&agrave;rees de comtats, i que voleu resumir les vendes de caf&egrave; per comtat.  Si suposem que les cafeteries tenen un atribut  <i>TOTAL_SALES</i>, podeu obtenir la suma de tots els atributs <i>TOTAL_SALES</i>, aix&iacute; com els valors m&iacute;nim i m&agrave;xim de <i>TOTAL_SALES</i>
 o la desviaci&oacute; est&agrave;ndard de totes les vendes en cada comtat.
    </p>
    <p>Si s'ha activat  <b>Utilitza l'extensi&oacute; del mapa actual</b>, nom&eacute;s s'analitzaran les entitats de la capa de punts d'entrada i la capa d'&agrave;rees que siguin visibles a l'extensi&oacute; de mapa actual.  Si l'opci&oacute; est&agrave; desactivada, s'analitzaran totes les entitats de la capa de punts d'entrada i la capa d'&agrave;rees, encara que estiguin fora de l'extensi&oacute; de mapa actual.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="pointLayer">
        <div><h2>Trieu la capa que conté punts que s'han d'agregar amb les àrees</h2></div>
        <hr/>
        <div>
            <p>Capa de punts que es consolidar&agrave; a les &agrave;rees.
            </p>
            <p>A banda de triar una capa del mapa, podeu seleccionar  <b>Trieu la capa d'an&agrave;lisi</b>, que es troba al final de la llista desplegable. Aquesta opci&oacute; obre una galeria on podeu cercar i seleccionar datasets de diversos or&iacute;gens per u utilitzar-los a l'an&agrave;lisi. 
            </p>
        </div>
    </div>
    <div id="polygonLayer">
        <div><h2>Trieu la capa que conté àrees d'agregació</h2></div>
        <hr/>
        <div>
            <p>Capa d'&agrave;rees en qu&egrave; es consolidaran els punts. Qualsevol punt que estigui dins dels l&iacute;mits de les &agrave;rees d'aquesta capa es comptar&agrave; i es podr&agrave; resumir mitjan&ccedil;ant les opcions d'estad&iacute;stiques que h&agrave;giu triat.  
            </p>
            <p>Podeu triar entre una capa d'&agrave;rees que proporcioneu o bins que es generen quan s'executa l'eina. Quan es generen bins, en el cas del  <b>Quadrat</b>, el nombre i les unitats que s'especifiquen determinen l'altura i la longitud del quadrat. En el cas de l' <b>Hex&agrave;gon</b>, el nombre i les unitats que s'especifiquen determinen la dist&agrave;ncia entre els costats paral&middot;lels.
            </p>
            <p>A banda de triar una capa del mapa, podeu seleccionar  <b>Trieu la capa d'an&agrave;lisi</b>, que es troba al final de la llista desplegable. Aquesta opci&oacute; obre una galeria on podeu cercar i seleccionar datasets de diversos or&iacute;gens per u utilitzar-los a l'an&agrave;lisi. 
            </p>
        </div>
    </div>
    <div id="KeepBoundaryNoPoints">
        <div><h2>Mantén les àrees sense punts</h2></div>
        <hr/>
        <div>
            <p>Determina si les &agrave;rees que no contenen cap punt apareixen a la capa de resultats.  Si l'opci&oacute; est&agrave; desactivada, les &agrave;rees sense cap punt no apareixeran al resultat.  Si l'opci&oacute; est&agrave; activada, les &agrave;rees sense cap punt apareixeran al resultat.  
            </p>
        </div>
    </div>
    <div id="SummaryFields">
        <div><h2>Afegeix una estadística</h2></div>
        <hr/>
        <div>
            <p>Podeu calcular estad&iacute;stiques sobre els atributs de la capa de punts d'entrada, com ara la suma, la mitjana, el m&iacute;nim, el m&agrave;xim i la desviaci&oacute; est&agrave;ndard. La capa de resultats contindr&agrave; un atribut nou per a cada estad&iacute;stica que es calculi. Per afegir qualsevol nombre d'estad&iacute;stiques, podeu triar un atribut i una estad&iacute;stica (apareixer&agrave; un quadre desplegable nou).
 
            </p>
            <p>Si la capa que es resumir&agrave; no t&eacute; cap camp de nombre, no hi haur&agrave; estad&iacute;stiques addicionals disponibles.
            </p>
        </div>
    </div>
    <div id="GroupByField">
        <div><h2>Trieu el camp pel qual voleu agrupar</h2></div>
        <hr/>
        <div>
            <p> Podeu crear grups estad&iacute;stics mitjan&ccedil;ant un atribut a la capa de punts d'entrada.    Per exemple, si esteu consolidant delictes amb els l&iacute;mits d'un ve&iuml;nat, podeu tenir un atribut <i>Crime_type</i> amb cinc tipus de delicte diferents.  Cada tipus de delicte &uacute;nic forma un grup i les estad&iacute;stiques que trieu es calcularan per a cada valor &uacute;nic de <i>Crime_type</i>.  Les estad&iacute;stiques de cada grup i el recompte de punts es mostraran a la finestra emergent de la capa de resultats.  Quan trieu un atribut d'agrupaci&oacute;, es creen dos resultats: la capa de resultats i una taula de resultats que cont&eacute; les estad&iacute;stiques de cada grup &uacute;nic.
            </p>
        </div>
    </div>
    <div id="MinorityMajority">
        <div><h2>Afegeix minoria, majoria</h2></div>
        <hr/>
        <div>
            <p>Aquesta casella de selecci&oacute; est&agrave; habilitada quan trieu un camp pel qual voleu agrupar.    Si voleu saber quins valors d'atribut de cada grup s&oacute;n minoritaris (menys dominants) o majoritaris (m&eacute;s dominants) en cada l&iacute;mit, seleccioneu  <b>Afegeix minoria, majoria</b>.   Quan seleccioneu <b>Afegeix minoria, majoria</b>, s'afegeixen dos camps nous a la capa de resultats.   Si tamb&eacute; seleccioneu <b>Afegeix percentatges</b>, s'afegeixen dos camps addicionals a la capa de resultats que contenen els percentatges dels valors d'atribut majoritaris i minoritaris en cada grup.
            </p>
            <p>Per exemple, si sou urbanista i voleu saber quines esp&egrave;cies d'arbres s&oacute;n minorit&agrave;ries i majorit&agrave;ries als parcs de tota la ciutat, consolideu les dades d'arbres amb les &agrave;rees dels parcs i seleccioneu aquesta opci&oacute;.
            </p>
        </div>
    </div>
    <div id="PercentPoints">
        <div><h2>Afegeix percentatges</h2></div>
        <hr/>
        <div>
            <p>Aquesta casella de selecci&oacute; est&agrave; habilitada quan trieu un camp pel qual voleu agrupar.    Seleccioneu  <b>Afegeix percentatges</b> si voleu obtenir el percentatge de cada valor d'atribut en cada grup.  S'afegeix un camp nou a la taula de resultats que cont&eacute; els percentatges de cada valor d'atribut en cada grup.   Si l'opci&oacute; <b>Afegeix percentatges</b> tamb&eacute; est&agrave; activada, s'afegeixen dos camps addicionals a la capa de resultats que contenen els percentatges dels valors d'atribut majoritaris i minoritaris en cada grup.
            </p>
        </div>
    </div>
    <div id="OutputLayer">
        <div><h2>Nom de la capa de resultats</h2></div>
        <hr/>
        <div>
            <p>Nom de la capa que es crear&agrave; a  <b>El meu contingut</b> i s'afegir&agrave; al mapa.  El nom per defecte es basa en el nom de l'eina i el de la capa d'entrada. Si el nom de la capa ja existeix, se us demanar&agrave; que proporcioneu un altre nom.
            </p>
            <p>Mitjan&ccedil;ant el men&uacute; desplegable  <b>Desa el resultat a</b>, podeu especificar el nom d'una carpeta d' <b>El meu contingut</b> on es desar&agrave; el resultat.
            </p>
        </div>
    </div>
</div>
</html>
