<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="smallsize">
        <h2>Classifica els píxels amb Aprenentatge profund</h2><p/>
        <h2><img src="../images/GUID-88BE63A6-B06C-4C61-9AB1-8DA5A08C6783-web.png" alt="Classifica els p&iacute;xels amb Aprenentatge profund"></h2>
        <hr/>
    <p>Aquesta eina executa un model d'aprenentatge profund format en un r&agrave;ster d'entrada per produir un r&agrave;ster classificat, i cada p&iacute;xel v&agrave;lid t&eacute; una etiqueta de classe assignada.
    </p>
    <p>Si l'opci&oacute;  <b>Utilitza l'extensi&oacute; del mapa actual</b> est&agrave; seleccionada, nom&eacute;s s'analitzar&agrave; l'&agrave;rea de r&agrave;ster que sigui visible a l'extensi&oacute; de mapa actual. Si l'opci&oacute; est&agrave; desactivada, s'analitzar&agrave; tot el r&agrave;ster, encara que estigui fora de l'extensi&oacute; de mapa actual.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputRaster">
        <div><h2>Trieu la imatge utilitzada per classificar els píxels</h2></div>
        <hr/>
        <div>
            <p>Imatge d'entrada que es classificar&agrave;.
            </p>
            <p>Pot ser una URL del servei d'imatges, una capa r&agrave;ster o una capa del servei d'imatges.
            </p>
        </div>
    </div>
    <div id="model">
        <div><h2>Trieu el model d'aprenentatge profund utilitzat per classificar els píxels</h2></div>
        <hr/>
        <div>
            <p>Element del paquet d'aprenentatge profund d'entrada ( <code>.dlpk</code>).
            </p>
            <p>El paquet d'aprenentatge profund es compon del fitxer JSON de definici&oacute; del model d'Esri ( <code>.emd</code>), el fitxer del model binari d'aprenentatge profund i, de manera opcional, la funci&oacute; de r&agrave;ster de Python que s'utilitzar&agrave;.
            </p>
        </div>
    </div>
    <div id="modelArguments">
        <div><h2>Especifiqueu els arguments del model d'aprenentatge profund</h2></div>
        <hr/>
        <div>
            <p>Els arguments de funci&oacute; es defineixen a la classe de la funci&oacute; de r&agrave;ster de Python a la qual fa refer&egrave;ncia el model d'entrada. Aqu&iacute; &eacute;s on indiqueu els par&agrave;metres i arguments d'aprenentatge profund addicionals per als experiments i el refinament, com ara el llindar de confian&ccedil;a per ajustar la sensibilitat.
            </p>
            <p>Els noms dels arguments els emplena l'eina a partir de la lectura del m&ograve;dul de Python al servidor d'an&agrave;lisi de r&agrave;ster.
            </p>  
            <p> 
            </p>
        </div>
    </div>
    <div id="outputClassifiedRaster">
        <div><h2>Nom de la capa de resultats</h2></div>
        <hr/>
        <div>
            <p>Nom de la capa que es crear&agrave; a  <b>El meu contingut</b> i s'afegir&agrave; al mapa. El nom per defecte es basa en el nom de l'eina i el de la capa d'entrada. Si la capa ja existeix, se us demanar&agrave; que proporcioneu un altre nom.
            </p>
            <p>Podeu especificar el nom d'una carpeta de  <b>El meu contingut</b> on es desar&agrave; el resultat mitjan&ccedil;ant el quadre desplegable <b>Desa el resultat a</b>.
            </p>
        </div>
    </div>
</div>
</html>
