<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Cerca clústers de punts</h2><p/>
        <h2><img src="../images/GUID-40DA7286-67EA-4333-91C5-4CD527C21B4A-web.png" alt="Cerca cl&uacute;sters de punts"></h2>
        <hr/>
    <p>L'eina  Cerca cl&uacute;sters de punts cerca cl&uacute;sters d'entitats de punts dins del soroll de l'entorn en funci&oacute; de la seva distribuci&oacute; espacial.
    </p>
    <p>Per exemple, una organitzaci&oacute; no governamental estudia una malaltia de transmissi&oacute; per plagues concreta. T&eacute; un dataset de punts que representa les unitats familiars d'una &agrave;rea d'estudi, de les quals algunes estan infectades i altres no. Mitjan&ccedil;ant l'eina  Cerca cl&uacute;sters de punts, un analista pot determinar els cl&uacute;sters d'unitats familiars infectades per ajudar a precisar una &agrave;rea i iniciar el tractament i l'exterminaci&oacute; de les plagues.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Trieu la capa per a la qual es cercaran els clústers</h2></div>
        <hr/>
        <div>
            <p>Capa de punts on es cercaran els cl&uacute;sters.  Les capes s'han de trobar en una refer&egrave;ncia espacial projectada o tenir una refer&egrave;ncia espacial de processament definida en un sistema de coordenades projectades mitjan&ccedil;ant els  <b>entorns d'an&agrave;lisi</b>.
            </p>
            <p>A banda de triar una capa del mapa, podeu seleccionar  <b>Trieu la capa d'an&agrave;lisi</b> al final de la llista desplegable per cercar al vostre contingut una capa d'entitats o un dataset de recursos compartits de fitxers de dades massives.
            </p>
        </div>
    </div>
    <div id="clusterMethod">
        <div><h2>Trieu el mètode de clusterització que voleu utilitzar</h2></div>
        <hr/>
        <div>
            <p>El m&egrave;tode de clusteritzaci&oacute; que s'utilitzar&agrave; per distingir els cl&uacute;sters d'entitats de punts del soroll de l'entorn. Podeu optar per utilitzar una dist&agrave;ncia definida o un algoritme de clusteritzaci&oacute; d'ajust autom&agrave;tic.
            </p>
            <p>La dist&agrave;ncia definida (DBSCAN) utilitza un interval de cerca especificat per separar cl&uacute;sters densos del soroll m&eacute;s dispers. La dist&agrave;ncia definida (DBSCAN) &eacute;s m&eacute;s r&agrave;pida, per&ograve; nom&eacute;s &eacute;s adequada si hi ha un interval de cerca molt clar per utilitzar que funcioni per definir tots els cl&uacute;sters que hi pugui haver. La dist&agrave;ncia definida (DBSCAN) cerca cl&uacute;sters que tenen densitats similars.
            </p>
            <p>L'ajust autom&agrave;tic (HDBSCAN) no exigeix que s'especifiqui un interval de cerca, per&ograve; &eacute;s un m&egrave;tode que necessita m&eacute;s temps. L'ajust autom&agrave;tic (HDBSCAN) cerca cl&uacute;sters de punts similars a la dist&agrave;ncia definida (DBSCAN), per&ograve; utilitza intervals de cerca variables per permetre cl&uacute;sters amb densitats variables. 
            </p>
        </div>
    </div>
    <div id="minFeaturesCluster">
        <div><h2>Nombre mínim de punts que es considerarà un clúster</h2></div>
        <hr/>
        <div>
            <p>Aquest par&agrave;metre s'utilitza de manera diferent segons el m&egrave;tode de clusteritzaci&oacute; triat:
            </p>
            <p>
                <ul>
                    <li>Dist&agrave;ncia definida (DBSCAN): especifica el nombre d'entitats que cal trobar a una dist&agrave;ncia determinada d'un punt perqu&egrave; el punt comenci a formar un cl&uacute;ster. La dist&agrave;ncia es defineix mitjan&ccedil;ant el par&agrave;metre  <b>Limita l'interval de cerca a</b>.
                    </li>
                    <li>Ajust autom&agrave;tic (HDBSCAN): especifica el nombre d'entitats ve&iuml;nes de cada punt (incl&ograve;s el punt mateix) que es consideraran en estimar la densitat. Aquest nombre tamb&eacute; &eacute;s la mida de cl&uacute;ster m&iacute;nima que es permet en extreure els cl&uacute;sters.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="searchDistance">
        <div><h2>Limita l'interval de cerca a</h2></div>
        <hr/>
        <div>
            <p>Quan s'utilitza la dist&agrave;ncia definida (DBSCAN), aquest par&agrave;metre &eacute;s la dist&agrave;ncia dins de la qual cal trobar el  <b>Nombre m&iacute;nim de punts que es considerar&agrave; un cl&uacute;ster</b>. Aquest par&agrave;metre no s'utilitza quan es tria l'ajust autom&agrave;tic (HDBSCAN) com a m&egrave;tode de clusteritzaci&oacute; que s'utilitzar&agrave;.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nom de la capa de resultats</h2></div>
        <hr/>
        <div>
            <p> Nom de la capa que es crear&agrave;.  Si esteu escrivint en un ArcGIS Data Store, els resultats es desaran a  <b>El meu contingut</b> i s'afegiran al mapa. Si esteu escrivint en un recurs compartit de fitxers de dades massives, els resultats s'emmagatzemaran en aquest recurs i s'afegiran al seu manifest. No s'afegiran al mapa. El nom per defecte es basa en el nom de l'eina i el de la capa d'entrada. Si la capa ja existeix, l'eina no funcionar&agrave;.
            </p>
            <p>Si escriviu a l' ArcGIS Data Store (magatzem de dades massives relacional o espaciotemporal) mitjan&ccedil;ant el quadre desplegable  <b>Desa el resultat a</b>, podeu especificar el nom d'una carpeta a <b>El meu contingut</b>, on es desar&agrave; el resultat.
            </p>
        </div>
    </div>
</div>
</html>
