<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="smallsize">
        <h2>Cerca clústers de punts</h2><p/>
        <h2><img src="../images/GUID-025ADB1C-E4BF-4C8D-A35F-1D0E222627F9-web.png" alt="Cerca cl&uacute;sters de punts"></h2>
        <hr/>
    <p>Aquesta eina cerca cl&uacute;sters d'entitats de punts dins del soroll de l'entorn en funci&oacute; de la seva distribuci&oacute; espacial.
    </p>
    <p>Si s'ha activat  <b>Utilitza l'extensi&oacute; del mapa actual</b>, nom&eacute;s s'analitzaran les entitats de la capa de punts d'entrada de l'extensi&oacute; de mapa actual.  Si l'opci&oacute; est&agrave; desactivada, s'analitzaran totes les entitats de la capa de punts d'entrada, encara que estiguin fora de l'extensi&oacute; de mapa actual.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="analysisLayer">
        <div><h2>Trieu la capa per a la qual es cercaran els clústers</h2></div>
        <hr/>
        <div>
            <p>Capa de punts on es cercaran els cl&uacute;sters. 
            </p>
        </div>
    </div>
    <div id="minFeaturesCluster">
        <div><h2>Nombre mínim de punts que es considerarà un clúster</h2></div>
        <hr/>
        <div>
            <p>Nombre m&iacute;nim d'entitats que es considerar&agrave; un cl&uacute;ster.  Qualsevol cl&uacute;ster amb menys entitats que les indicades es considerar&agrave; soroll. 
            </p>
        </div>
    </div>
    <div id="searchDistance">
        <div><h2>Limita l'interval de cerca a (opcional)</h2></div>
        <hr/>
        <div>
            
            <p>Dist&agrave;ncia m&agrave;xima per considerar que les entitats formen part del mateix cl&uacute;ster.  Si es deixa en blanc, l'eina executar&agrave; HDBSCAN, que utilitza dist&agrave;ncies variables per separar cl&uacute;sters de densitats variables del soroll m&eacute;s dispers. Si es proporciona un valor, l'eina executar&agrave; DBSCAN, que utilitza una dist&agrave;ncia especificada per separar cl&uacute;sters densos del soroll m&eacute;s dispers.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nom de la capa de resultats</h2></div>
        <hr/>
        <div>
            <p>Nom de la capa que es crear&agrave; a  <b>El meu contingut</b> i s'afegir&agrave; al mapa.  El nom per defecte es basa en el nom de l'eina i el de la capa d'entrada. Si el nom de la capa ja existeix, se us demanar&agrave; que proporcioneu un altre nom.
            </p>
            <p>Mitjan&ccedil;ant el men&uacute; desplegable  <b>Desa el resultat a</b>, podeu especificar el nom d'una carpeta d' <b>El meu contingut</b> on es desar&agrave; el resultat.
            </p>
        </div>
    </div>
</div>
</html>
