<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Fusiona les capes</h2><p/>
        <h2><img src="../images/GUID-BDDD6517-4EE7-4EEC-AE15-15DD9B709131-web.png" alt="Fusiona les capes"></h2>
        <hr/>
    <p>Aquesta eina copia les entitats de dues capes en una capa nova.    Totes les capes que es fusionaran han de contenir els mateixos tipus d'entitats (punts, l&iacute;nies o &agrave;rees).  Podeu controlar com s'uneixen i es copien els camps de les capes d'entrada.  Per exemple:
        <ul>
            <li>Tinc tres capes que corresponen a Anglaterra, Gal&middot;les i Esc&ograve;cia i vull obtenir una sola capa de Gran Bretanya. 
            </li>
            <li>Tinc 12 capes i cadascuna cont&eacute; informaci&oacute; de parcel&middot;les de municipis contigus.  Vull unir-les totes en una sola capa i conservar &uacute;nicament els camps que tinguin el mateix nom i tipus a les 12 capes d'entrada.
            </li>
        </ul>
        
    </p>
    <p>Si l'opci&oacute;  <b>Utilitza l'extensi&oacute; del mapa actual</b> est&agrave; seleccionada, nom&eacute;s es fusionaran les entitats que siguin visibles a l'extensi&oacute; del mapa actual.  Si l'opci&oacute; est&agrave; desactivada, es fusionaran totes les entitats de totes dues capes, encara que estiguin fora de l'extensi&oacute; de mapa actual.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Trieu una capa</h2></div>
        <hr/>
        <div>
            <p>Capa d'entitats de punts, l&iacute;nies o &agrave;rees que es fusionar&agrave; amb la capa especificada a continuaci&oacute;. 
            </p>
        </div>
    </div>
    <div id="MergeLayer">
        <div><h2>Trieu la capa que es fusionarà</h2></div>
        <hr/>
        <div>
            <p>Trieu la capa que es fusionar&agrave; amb la primera capa.
            </p>
        </div>
    </div>
    <div id="MergingAttributes">
        <div><h2>Modifica els camps de fusió</h2></div>
        <hr/>
        <div>
            <p>Per defecte, tots els camps d'ambdues entrades es traslladaran a la sortida.  Podeu canviar com es traslladen els camps a la sortida de la manera seg&uuml;ent:
                <ul>
                    <li> <b>Canvia el nom</b>: el nom del camp canviar&agrave; a la sortida.
                    </li>
                    <li> <b>Elimina</b>: el camp s'eliminar&agrave; de la sortida.
                    </li>
                    <li> <b>Fes coincidir</b>: els noms dels camps es faran coincidir.  Els valors del camp de la capa que es fusionar&agrave; es copiaran al camp de sortida que s'hagi fet coincidir.
                    </li>
                </ul>
                
            </p>
            <p>Si totes dues capes contenen un camp amb nom i tipus de dades id&egrave;ntics, el contingut dels dos camps es fusionar&agrave; en un camp nou amb aquest nom. Aix&ograve; no &eacute;s aplicable als camps en els que es fa servir  <b>Fes coincidir</b> en el par&agrave;metre <b>Modifica els camps de fusi&oacute;</b>.
            </p>
        </div>
    </div>
    <div id="OutputName">
        <div><h2>Nom de la capa de resultats</h2></div>
        <hr/>
        <div>
            <p>Nom de la capa que es crear&agrave; a  <b>El meu contingut</b> i s'afegir&agrave; al mapa.  El nom per defecte es basa en el nom de l'eina i el de la capa d'entrada. Si el nom de la capa ja existeix, se us demanar&agrave; que proporcioneu un altre nom.
            </p>
            <p>Mitjan&ccedil;ant el men&uacute; desplegable  <b>Desa el resultat a</b>, podeu especificar el nom d'una carpeta d' <b>El meu contingut</b> on es desar&agrave; el resultat.
            </p>
        </div>
    </div>
</div>
</html>
