<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Resumir prop de</h2><p/>
        <h2><img src="../images/GUID-A5033D27-81B6-42E7-BA38-50D25C1CCCCA-web.png" alt="Resumir prop de"></h2>
        <hr/>
    <p>Aquesta eina cerca i resumeix entitats que estan dins d'una dist&agrave;ncia especificada de les entitats de la primera capa d'entrada.  La dist&agrave;ncia es pot mesurar com a dist&agrave;ncia en l&iacute;nia recta o es pot fer servir un mode de viatge seleccionat.  Les opcions del mode de viatge s&oacute;n la dist&agrave;ncia de conducci&oacute;, el temps de conducci&oacute;, la dist&agrave;ncia en cami&oacute;, el temps en cami&oacute;, la dist&agrave;ncia caminant i el temps caminant.   Posteriorment es calculen les estad&iacute;stiques per a les entitats properes.  Per exemple
        <ul>
            <li>Calculeu la poblaci&oacute; total que estigui a menys de cinc minuts conduint de la ubicaci&oacute; proposada per a una botiga nova.
            </li>
            <li>Calculeu el nombre d'incorporacions a l'autovia a una dist&agrave;ncia m&agrave;xima d'un quil&ograve;metre d'una ubicaci&oacute; proposada per a una botiga nova per fer-les servir de mesura per a l'accessibilitat de la botiga.
            </li>
        </ul>
        
    </p>
    <p>Si s'ha activat  <b>Utilitza l'extensi&oacute; del mapa actual</b>, nom&eacute;s s'analitzaran les entitats de la capa d'entrada i la capa que es resumir&agrave; que siguin visibles a l'extensi&oacute; de mapa actual.  Si l'opci&oacute; est&agrave; desactivada, s'analitzaran totes les entitats de la capa d'entrada i la capa que es resumir&agrave;, encara que estiguin fora de l'extensi&oacute; de mapa actual.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="sumNearbyLayer">
        <div><h2>Trieu la capa des de la qual es mesuraran les distàncies a les entitats de la capa que es resumirà</h2></div>
        <hr/>
        <div>
            <p>Capa de punts, de l&iacute;nies o d'&agrave;rees que es far&agrave; servir com a ubicacions d'inici per resumir les entitats properes.
            </p>
            <p>A banda de triar una capa del mapa, podeu seleccionar  <b>Trieu la capa d'an&agrave;lisi</b>, que es troba al final de la llista desplegable. Aquesta opci&oacute; obre una galeria on podeu cercar i seleccionar datasets de diversos or&iacute;gens per u utilitzar-los a l'an&agrave;lisi. 
            </p>
            <p>L'eina admet fins a 1.000 entitats en aquesta capa. 
            </p>
        </div>
    </div>
    <div id="Summarize">
        <div><h2>Trieu la capa que es resumirà</h2></div>
        <hr/>
        <div>
            <p>Es resumiran les entitats d'aquesta capa que estiguin dins de la dist&agrave;ncia especificada de les entitats de la capa especificada anteriorment. 
            </p>
            <p>A banda de triar una capa del mapa, podeu seleccionar  <b>Trieu la capa d'an&agrave;lisi</b>, que es troba al final de la llista desplegable. Aquesta opci&oacute; obre una galeria on podeu cercar i seleccionar datasets de diversos or&iacute;gens per u utilitzar-los a l'an&agrave;lisi. 
            </p> 
        </div>
    </div>
    <div id="BufferOption">
        <div><h2>Resumir les entitats més properes amb</h2></div>
        <hr/>
        <div>
            <p> Podeu definir quin tipus de mesura de dist&agrave;ncia voleu fer servir, ja sigui una dist&agrave;ncia en l&iacute;nia recta o un mode de viatge seleccionat. Els modes de viatge nom&eacute;s s'habiliten si la primera capa d'entrada (la capa des de la qual es mesuren les dist&agrave;ncies) cont&eacute; punts.  L'administrador de la vostra organitzaci&oacute; determina els modes de viatge disponibles. Quan s'utilitza un dels modes de viatge, les mesures es fan al llarg de carreteres o camins i respecten les regles aplicables, com ara les vies de sentit &uacute;nic, els girs prohibits, etc. El <b>Temps de conducci&oacute;</b>, el <b>Temps de conducci&oacute; rural</b> i el <b>Temps en cami&oacute;</b> respecten les velocitats de viatge que trieu, ja sigui aquelles en funci&oacute; del tr&agrave;nsit en temps real o del tr&agrave;nsit habitual. Les velocitats del tr&agrave;nsit en temps real es recopilen mitjan&ccedil;ant les lectures actuals dels sensors i les velocitats del tr&agrave;nsit habitual es calculen a partir de les mitjanes hist&ograve;riques.
            </p>
            <p>Podeu introduir diverses dist&agrave;ncies.  Es resumiran les entitats que estiguin dins (o que equivalguin a) les dist&agrave;ncies que introdu&iuml;u.  
            </p>
            <p>Si s'activa la casella de selecci&oacute;  <b>Retorna les &agrave;rees de delimitaci&oacute;</b>, es retornar&agrave; una capa de resultats de les &agrave;rees definides per la mesura de dist&agrave;ncia especificada. La capa de resultats inclour&agrave; tota la informaci&oacute; resumida sol&middot;licitada. Per exemple, si s'utilitza una <b>Dist&agrave;ncia de la l&iacute;nia</b> de 5 milles quan es resumeixen punts propers, el resultat contindr&agrave; &agrave;rees amb un radi de 5 milles al voltant de les entitats d'entrada i tota la informaci&oacute; resumida, com ara el recompte de punts i qualsevol estad&iacute;stica addicional. Si l'opci&oacute; est&agrave; desactivada, la capa de resultats retornar&agrave; les mateixes entitats que la primera capa d'entrada amb tota la informaci&oacute; resumida sol&middot;licitada.
            </p>
        </div>
    </div>
    <div id="StatisticsPoint">
        <div><h2>Afegeix estadístiques des de la capa que es resumirà</h2></div>
        <hr/>
        <div>
            <p>Teniu l'opci&oacute; de calcular les estad&iacute;stiques de qualsevol atribut num&egrave;ric dels punts propers. 
            </p>
            <p>Si s'activa la casella  <b>Recompte de punts</b>, es calcular&agrave; el nombre total de punts propers.  Tamb&eacute; podeu calcular les estad&iacute;stiques dels camps num&egrave;rics dels punts propers.
            </p>
            <ul>
                <li> <b>Suma</b>: valor total del camp especificat.
                </li>
                <li> <b>Mitjana</b>: mitjana del camp especificat.
                </li>
                <li> <b>M&iacute;nim</b>: valor m&eacute;s baix del camp especificat.
                </li>
                <li> <b>M&agrave;xim</b>: valor m&eacute;s alt del camp especificat.
                </li>
                <li> <b>Desviaci&oacute; est&agrave;ndard</b>: desviaci&oacute; est&agrave;ndard dels valors del camp especificat.
                </li>
            </ul>
            
            <p>Si la capa que es resumir&agrave; no t&eacute; cap camp de nombre, no hi haur&agrave; estad&iacute;stiques addicionals disponibles.
            </p>
        </div>
    </div>
    <div id="StatisticsLine">
        <div><h2>Afegeix estadístiques des de la capa que es resumirà</h2></div>
        <hr/>
        <div>
            <p>Teniu l'opci&oacute; de calcular les estad&iacute;stiques de qualsevol atribut num&egrave;ric de les l&iacute;nies properes. 
            </p>
            <p>Si s'activa la casella  <b>Longitud total</b>, es calcular&agrave; la longitud total de les l&iacute;nies properes.  Tamb&eacute; podeu calcular les estad&iacute;stiques dels camps num&egrave;rics de les l&iacute;nies properes.
            </p>
            <ul>
                <li> <b>Suma</b>: valor total del camp especificat.
                </li>
                <li> <b>Mitjana</b>: mitjana del camp especificat.
                </li>
                <li> <b>M&iacute;nim</b>: valor m&eacute;s baix del camp especificat.
                </li>
                <li> <b>M&agrave;xim</b>: valor m&eacute;s alt del camp especificat.
                </li>
                <li> <b>Desviaci&oacute; est&agrave;ndard</b>: desviaci&oacute; est&agrave;ndard dels valors del camp especificat.
                </li>
            </ul>
            
            <p>Si la capa que es resumir&agrave; no t&eacute; cap camp de nombre, no hi haur&agrave; estad&iacute;stiques addicionals disponibles.
            </p>
        </div>
    </div>
    <div id="StatisticsPolygon">
        <div><h2>Afegeix estadístiques des de la capa que es resumirà</h2></div>
        <hr/>
        <div>
            <p>Teniu l'opci&oacute; de calcular les estad&iacute;stiques de qualsevol atribut num&egrave;ric de les &agrave;rees properes. 
            </p>
            <p>Si s'activa la casella  <b>&Agrave;rea total</b>, es calcular&agrave; l'&agrave;rea total de les entitats properes.  Tamb&eacute; podeu calcular les estad&iacute;stiques dels camps num&egrave;rics de les entitats properes.
            </p>
            <ul>
                <li> <b>Suma</b>: valor total del camp especificat.
                </li>
                <li> <b>Mitjana</b>: mitjana del camp especificat.
                </li>
                <li> <b>M&iacute;nim</b>: valor m&eacute;s baix del camp especificat.
                </li>
                <li> <b>M&agrave;xim</b>: valor m&eacute;s alt del camp especificat.
                </li>
                <li> <b>Desviaci&oacute; est&agrave;ndard</b>: desviaci&oacute; est&agrave;ndard dels valors del camp especificat.
                </li>
            </ul>
            
            <p>Si la capa que es resumir&agrave; no t&eacute; cap camp de nombre, no hi haur&agrave; estad&iacute;stiques addicionals disponibles.
            </p>
        </div>
    </div>
    <div id="StatisticsNoLayer">
        <div><h2>Afegeix estadístiques des de la capa que es resumirà</h2></div>
        <hr/>
        <div>
            <p>Quan h&agrave;giu triat una capa per resumir-la, tindreu l'opci&oacute; de calcular les estad&iacute;stiques de qualsevol atribut num&egrave;ric de les l&iacute;nies, les &agrave;rees o els punts propers. 
            </p>
            <ul>
                <li> <b>Suma</b>: valor total del camp especificat.
                </li>
                <li> <b>Mitjana</b>: mitjana del camp especificat.
                </li>
                <li> <b>M&iacute;nim</b>: valor m&eacute;s baix del camp especificat.
                </li>
                <li> <b>M&agrave;xim</b>: valor m&eacute;s alt del camp especificat.
                </li>
                <li> <b>Desviaci&oacute; est&agrave;ndard</b>: desviaci&oacute; est&agrave;ndard dels valors del camp especificat.
                </li>
            </ul>
            
            <p>Segons el tipus d'entitats que resumiu, podeu calcular el recompte total de punts propers, la longitud total de les l&iacute;nies properes o l'&agrave;rea total de les entitats d'&agrave;rees properes.
            </p>
            <p>Si la capa que es resumir&agrave; no t&eacute; cap camp de nombre, no hi haur&agrave; estad&iacute;stiques addicionals disponibles.
            </p>
        </div>
    </div>
    <div id="GroupBy">
        <div><h2>Trieu el camp pel qual voleu agrupar</h2></div>
        <hr/>
        <div>
            <p> Aquest &eacute;s un atribut de les entitats properes que podeu utilitzar per calcular les estad&iacute;stiques individuals de cada valor d'atribut &uacute;nic. Per exemple, suposeu que la primera capa d'entrada (la capa des de la qual es mesuren les dist&agrave;ncies) cont&eacute; parcel&middot;les buides en venda i que les entitats properes s&oacute;n superf&iacute;cies d'edificis.  Un dels atributs de les superf&iacute;cies d'edificis &eacute;s <i>UseType</i>, que cont&eacute; valors com ara RETAIL, RESIDENTIAL, MANUFACTURING, PUBLIC, etc.  Per caracteritzar els diversos usos dels edificis que estan a prop de cada parcel&middot;la buida, podeu calcular l'&agrave;rea total de cada &uacute;s del tipus d'edifici a una dist&agrave;ncia de dos quil&ograve;metres de les parcel&middot;les buides amb el valor <i>UseType</i> com a atribut pel qual voleu agrupar.   Les estad&iacute;stiques de cada grup i el recompte d'entitats properes es mostraran a la finestra emergent de la capa de resultats.
            </p>    
        </div>
    </div>
    <div id="MinorityMajority">
        <div><h2>Afegeix minoria, majoria</h2></div>
        <hr/>
        <div>
            <p>Aquesta casella de selecci&oacute; est&agrave; habilitada quan trieu un camp pel qual voleu agrupar.    Si voleu saber quins valors d'atribut de cada grup s&oacute;n minoritaris (menys dominants) o majoritaris (m&eacute;s dominants) dins del per&iacute;ode de temps o la dist&agrave;ncia que heu especificat, seleccioneu  <b>Afegeix minoria, majoria</b>.   Quan seleccioneu <b>Afegeix minoria, majoria</b>, s'afegeixen dos camps nous a la capa de resultats.   Si tamb&eacute; seleccioneu <b>Afegeix percentatges</b>, s'afegeixen dos camps addicionals a la capa de resultats que contenen els percentatges dels valors d'atribut majoritaris i minoritaris en cada grup.
            </p>
            <ul>
                <li>Si esteu resumint punts propers, el c&agrave;lcul dels valors de minoria i majoria es basa en el recompte de punts dins del per&iacute;ode de temps o la dist&agrave;ncia que heu especificat.
                </li>
                <li>Si esteu resumint l&iacute;nies properes, el c&agrave;lcul dels valors de minoria i majoria es basa en les longituds de les l&iacute;nies dins del per&iacute;ode de temps o la dist&agrave;ncia que heu especificat.  
                </li>
                <li>Si esteu resumint &agrave;rees properes, el c&agrave;lcul dels valors de minoria i majoria es basa en les &agrave;rees dins del per&iacute;ode de temps o la dist&agrave;ncia que heu especificat.
                </li>
            </ul>
             
        </div>
    </div>
    <div id="PercentShape">
        <div><h2>Afegeix percentatges</h2></div>
        <hr/>
        <div>
            <p>Aquesta casella de selecci&oacute; est&agrave; habilitada quan trieu un camp pel qual voleu agrupar.    Seleccioneu  <b>Afegeix percentatges</b> si voleu obtenir el percentatge de cada valor d'atribut en cada grup.  S'afegeix un camp nou a la taula de resultats que cont&eacute; els percentatges de cada valor d'atribut en cada grup.   Si l'opci&oacute; <b>Afegeix percentatges</b> tamb&eacute; est&agrave; activada, s'afegeixen dos camps addicionals a la capa de resultats que contenen els percentatges dels valors d'atribut majoritaris i minoritaris en cada grup.
            </p>
        </div>
    </div>
    <div id="OutputName">
        <div><h2>Nom de la capa de resultats</h2></div>
        <hr/>
        <div>
            <p>Nom de la capa que es crear&agrave; a  <b>El meu contingut</b> i s'afegir&agrave; al mapa.  El nom per defecte es basa en el nom de l'eina i el de la capa d'entrada. Si el nom de la capa ja existeix, se us demanar&agrave; que proporcioneu un altre nom.
            </p>
            <p>Mitjan&ccedil;ant el men&uacute; desplegable  <b>Desa el resultat a</b>, podeu especificar el nom d'una carpeta d' <b>El meu contingut</b> on es desar&agrave; el resultat.
            </p>
        </div>
    </div>
</div>
</html>
