<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Koppla startplatser till destinationer</h2><p/>
        <h2><img src="../images/GUID-7266D30B-0250-4132-B1A5-9B59F0212FAD-web.png" alt="Koppla startplatser till destinationer"></h2>
        <hr/>
    <p>Koppla startpunkter till destinationer m&auml;ter restiden eller avst&aring;ndet mellan punktpar. Verktyget kan rapportera avst&aring;nd som raka linjer, avst&aring;nd baserade p&aring; ett f&auml;rdl&auml;ge som till exempel till fots eller med bil, eller resans varaktighet baserat p&aring; f&auml;rdl&auml;ge. Med det h&auml;r verktyget kan du g&ouml;ra f&ouml;ljande:
    </p>
    <p>
        <ul>
            <li>Ber&auml;kna det totala avst&aring;ndet eller tiden pendlare f&auml;rdas mellan hem och arbete.
            </li>
            <li>M&auml;ta hur l&aring;ngt kunder reser f&ouml;r att handla i dina butiker. Anv&auml;nda informationen f&ouml;r att definiera din marknadsr&auml;ckvidd, i synnerhet n&auml;r du inriktar dig p&aring; annonskampanjer eller v&auml;ljer nya butiksplatser.
            </li>
            <li>Ber&auml;kna den f&ouml;rv&auml;ntade k&ouml;rstr&auml;ckan f&ouml;r din fordonspark. Efter&aring;t k&ouml;ra verktyget Summera inom f&ouml;r att rapportera k&ouml;rstr&auml;cka efter delstat eller annan region.
            </li>
        </ul>
        
    </p>
    <p>Du anger start- och slutpunkter, och verktyget returnerar ett lager som inneh&aring;ller ruttlinjer, inklusive m&auml;tningar, mellan de kopplade startpunkterna och destinationerna. 
    </p>
    <p>Om  <b>Anv&auml;nd aktuell kartutbredning</b> &auml;r markerat anv&auml;nds endast de geoobjekt som &auml;r synliga i den aktuella kartutbredningen i analysen. Om alternativet inte markeras anv&auml;nds alla geoobjekt i indatalagret, &auml;ven om de ligger utanf&ouml;r den aktuella kartutbredningen.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="originsLayer">
        <div><h2>V채lj punktlager som ska representera startplatser</h2></div>
        <hr/>
        <div>
            <p>V&auml;lj det punktlager som ska representera startplatsen eller startplatserna. Verktyget har st&ouml;d f&ouml;r upp till  5 000 startpunkter och  5 000 destinationer. </p>
            <p>Om du v&auml;ljer ett lager som har exakt en startplats kopplas den till alla destinationer.
            </p>
            <p>F&ouml;rutom att v&auml;lja ett lager p&aring; din karta kan du v&auml;lja  <b>V&auml;lj analyslager</b>, som du hittar l&auml;ngst ned i listrutan. Det alternativet &ouml;ppnar ett galleri d&auml;r du kan bl&auml;ddra till och v&auml;lja dataupps&auml;ttningar fr&aring;n diverse k&auml;llor som du kan anv&auml;nda i din analys. 
            </p>
        </div>
    </div>
    <div id="destinationsLayer">
        <div><h2>V채lja destinationslagret</h2></div>
        <hr/>
        <div>
            <p>V&auml;lj det lager som representerar destinationen eller destinationerna till vilka startpunkterna ska kopplas. Verktyget har st&ouml;d f&ouml;r upp till  5 000 startpunkter och  5 000 destinationer. </p>
            <p>Om du v&auml;ljer ett lager som har exakt en destination kopplas alla startplatser till den destinationen. 
            </p>
            <p>Om det finns en startpunkt och flera destinationer ansluter verktyget startpunkten till varje destination.
            </p>
            <p>F&ouml;rutom att v&auml;lja ett lager p&aring; din karta kan du v&auml;lja  <b>V&auml;lj analyslager</b>, som du hittar l&auml;ngst ned i listrutan. Det alternativet &ouml;ppnar ett galleri d&auml;r du kan bl&auml;ddra till och v&auml;lja dataupps&auml;ttningar fr&aring;n diverse k&auml;llor som du kan anv&auml;nda i din analys. 
            </p>
            <p> Om det finns flera startpunkter och flera destinationer beh&ouml;vs f&ouml;rst tv&aring; f&auml;lt som beskriver startpunkts- och destinationsparen: <b>ID-f&auml;lt i ursprung</b> och <b>Matchande ID-f&auml;lt i destinationer</b>. Verktyget kopplar startpunkts- och destinationsparen under analysen. T&auml;nk dig exempelvis att du har tv&aring; startpunkter med ID-f&auml;ltv&auml;rdena <code>Rosanna</code> och <code>Harald</code> och tv&aring; destinationer med samma ID-v&auml;rden. Startpunkten <code>Rosanna</code> kopplas till <code>Rosanna</code>-destinationen och <code>Harald</code> kopplas till <code>Harald</code>. Inga andra kopplingar eller m&auml;tningar g&ouml;rs.
            </p>
            <p>Om det finns ett lika antal startpunkter och destinationer m&aring;ste ID-v&auml;rdena vara unika inom varje lager &ndash; exempelvis kan inte destinationslagret ha tv&aring;   <code>Rosanna</code>-v&auml;rden. V&auml;rdena i startpunkts- och destinationslagren m&aring;ste matcha exakt f&ouml;r att bilda par &ndash; <code>Harald</code> kopplas exempelvis inte om v&auml;rdet &auml;r felstavat till <code>Haradl</code>. 
            </p>
            <p>Verktyget g&ouml;r det ocks&aring; m&ouml;jligt att ansluta varje startpunkt till mer &auml;n en destination, eller varje destination till mer &auml;n en startpunkt. I det h&auml;r fallet beh&ouml;vs det fortfarande tv&aring; f&auml;lt som beskriver startpunkts- och destinationsparen. Men endast ett av lagren (antingen startpunkts- eller destinationslagret) beh&ouml;ver ha unika ID-v&auml;rden.
            </p>
        </div>
    </div>
    <div id="measurementType">
        <div><h2>M채t</h2></div>
        <hr/>
        <div>
            
            <p>V&auml;lj om du vill koppla startpunkter till destinationer via avst&aring;nd med raka linjer eller ett f&auml;rdl&auml;ge. Utdatarutterna f&ouml;ljer v&auml;gar eller g&aring;ngv&auml;gar med h&auml;nsyn till till&auml;mpliga regler, till exempel enkelriktade gator och f&ouml;rbjudna sv&auml;ngar f&ouml;r bilar eller lastbilar. Vilka f&auml;rdl&auml;gen som &auml;r tillg&auml;ngliga avg&ouml;rs av organisationens administrat&ouml;r.  
            </p>
            <p>Om du v&auml;ljer  <b>K&ouml;rtid</b>, <b>K&ouml;rtid p&aring; landsbygd</b> eller <b>Tid med lastbil</b> finns det olika s&auml;tt att m&auml;ta k&ouml;rtiden p&aring;.
                <ul>
                    <li>
                        <p>Avmarkera  <b>Anv&auml;nd trafik</b> om du vill hitta de snabbaste rutterna som bygger p&aring; fasta hastigheter.
                        </p>
                        <p>Anv&auml;nd det h&auml;r alternativet om du vill ha ett allm&auml;nt k&ouml;rtidsomr&aring;de i st&auml;llet f&ouml;r en m&auml;tning som ber&auml;knas med hj&auml;lp av varierande trafikf&ouml;rh&aring;llanden under specifika avresetider.
                        </p>
                    </li>
                    <li>
                        <p>Markera  <b>Anv&auml;nd trafik</b> om du vill hitta de snabbaste rutterna utifr&aring;n en viss starttid och varierande trafikf&ouml;rh&aring;llanden. Om du &auml;ven v&auml;ljer alternativet <b>Trafik i realtid</b> anges avresetiden fr&aring;n startpunkterna till den aktuella tiden, och aktuella och f&ouml;rutsagda trafikhastigheter refereras fr&aring;n sensorer och feeds n&auml;r k&ouml;rtidsomr&aring;dena skapas. De f&ouml;rutsagda trafikv&auml;rdena ber&auml;knas genom att referera trafikhastigheter i realtid, historik f&ouml;r hastigheter och aktuella f&ouml;ruts&auml;ttningar, till exempel v&auml;der. Trafikhastigheterna f&ouml;ruts&auml;gs 12 timmar fram&aring;t, s&aring; du kan flytta skjutreglaget f&ouml;r att st&auml;lla in en avresetid upp till  12 timmar fram&aring;t i tiden. </p>
                        <p>Anv&auml;nd dessa inst&auml;llningar f&ouml;r trafik i realtid n&auml;r du vill ta reda p&aring; k&ouml;rtider om du &aring;ker nu, om du &aring;ker om en timme och s&aring; vidare.
                        </p>
                    </li>
                    <li>
                        <p>Om du markerar  <b>Anv&auml;nd trafik</b> och v&auml;ljer <b>Trafik baserad p&aring; typiska f&ouml;rh&aring;llanden f&ouml;r</b> en dag och tid, hittar verktyget de snabbaste rutterna baserat p&aring; historiska snitthastigheter f&ouml;r varje femminutersintervall under en vanlig vecka. Resultaten omfattar trafik, men tar inte med aktuella trafikf&ouml;rh&aring;llanden och h&auml;ndelser. De aktuella f&ouml;rh&aring;llandena kan i h&ouml;g grad skilja sig fr&aring;n normen.
                        </p>
                        <p>Du kan anv&auml;nda dessa historiska trafikinst&auml;llningar f&ouml;r att till exempel fr&aring;ga &rdquo;Hur l&aring;ng tid tar det normalt att n&aring; dessa destinationer om jag &aring;ker klockan 11:30 p&aring; en onsdag?&rdquo;
                        </p>
                        <p>Den tid du anger refererar till den tidszon d&auml;r dina startplatser finns. Om du st&auml;ller in tiden 08:00 och har tv&aring; startpunkter, en i New York City och en annan i Los Angeles, genereras rutterna baserat p&aring; avresetiden 08:00 Eastern Time respektive 08:00 Pacific Time.
                        </p>
                    </li>
                </ul>
                
            </p>
            <p>Observera att tiden g&aring;r och trafikf&ouml;rh&aring;llandena &auml;ndras medan bilen k&ouml;r ut&aring;t fr&aring;n startplatsen. Verktyget Anslut startpunkter till destinationer tar med dessa variationer i ber&auml;kningarna om du markerar  <b>Anv&auml;nd trafik</b>, trafikfunktionen st&ouml;ds dock inte i alla regioner. Klicka p&aring; l&auml;nken <b>Se tillg&auml;nglighet</b> i verktyget f&ouml;r att ta reda p&aring; om funktionen finns tillg&auml;nglig i ditt unders&ouml;kningsomr&aring;de.
            </p>
            <p> <b>Tid med lastbil</b> kan anv&auml;nda dynamiska hastigheter baserade p&aring; trafik men bara upp till hastighetsbegr&auml;nsningen f&ouml;r lastbilar. Om t.ex. den dynamiska hastigheten f&ouml;r en v&auml;g baserat p&aring; trafik i realtid &auml;r 110 km/h men hastighetsbegr&auml;nsningen f&ouml;r lastbilar p&aring; v&auml;gen &auml;r 90 km/h, anv&auml;nder ber&auml;kningen 90 km/h f&ouml;r den v&auml;gen.
            </p>
        </div>
    </div>
    <div id="barrier_layers">
        <div><h2>V채lj hinderlager</h2></div>
        <hr/>
        <div>
            <p> Ange ett eller flera geoobjekt som fungerar som tillf&auml;lliga restriktioner (hinder) vid resor p&aring; de underliggande gatorna. Du kan ange hindren med hj&auml;lp av punkt-, linje eller polygongeoobjekt.
            </p>
            <p>Ett punkthinder kan vara ett nedfallet tr&auml;d, en olycka, en nedrasad elledning eller n&aring;gonting annat som fullst&auml;ndigt blockerar trafiken p&aring; en specifik plats l&auml;ngs gatan. Det &auml;r till&aring;tet att f&auml;rdas p&aring; gatan men inte genom hindret. Du kan ange att upp till 250 geoobjekt ska fungera som punkthinder.
            </p>
            <p>Ett linjehinder f&ouml;rbjuder resor &ouml;verallt d&auml;r hindret korsar gatorna. Till exempel kan en parad eller protestmarsch som blockerar trafiken p&aring; flera gatusegment modelleras med ett linjehinder. Om antalet gatugeoobjekt som korsas av alla linjehinder &ouml;verstiger 500 visas ett felmeddelande i verktyget.
            </p>
            <p>Ett polygonhinder f&ouml;rbjuder resor &ouml;verallt d&auml;r polygonen korsar gatorna. En anv&auml;ndning f&ouml;r den h&auml;r typen av hinder &auml;r att modellera &ouml;versv&auml;mningar som t&auml;cker delar av gatun&auml;tet och g&ouml;r det om&ouml;jligt att f&auml;rdas p&aring; v&auml;garna. Om antalet gatugeoobjekt som korsas av alla polygonhinder &ouml;verstiger 2&nbsp;000 visas ett felmeddelande i verktyget.
            </p>
        </div>
    </div>
    <div id="routeShape">
        <div><h2>Ruttform</h2></div>
        <hr/>
        <div>
            <p>V&auml;lj den ruttform som ansluter varje startpunkt till dess destination n&auml;r f&auml;rdl&auml;get anv&auml;nds:
            </p>
            <ul>
                <li> <b>F&ouml;lj gatorna</b> &ndash; Formen baseras p&aring; det underliggande v&auml;gn&auml;tet. Alternativet passar b&auml;st n&auml;r du vill generera rutterna mellan startpunkter och destinationer.
                </li>
                <li> <b>Rak linje</b> &ndash; Formen &auml;r en rak linje som ansluter startpunkts- och destinationsparet. Alternativet passar b&auml;st n&auml;r du vill generera spindeldiagram eller &ouml;nskestigar (till exempel f&ouml;r att visa vilka butiker kunder bes&ouml;ker).
                </li>
            </ul>
            
            <p>Den b&auml;sta rutten mellan en startpunkt och dess matchade destination ber&auml;knas alltid baserat p&aring; f&auml;rdl&auml;get, oavsett vilken ruttform som valts.
            </p>
        </div>
    </div>
    <div id="outputLayer">
        <div><h2>Resultatlagrets namn</h2></div>
        <hr/>
        <div>
            <p>Namnet p&aring; geoobjektslagret som skapas i  <b>Mitt inneh&aring;ll</b> och l&auml;ggs till i kartan. Om geoobjektslagret redan finns uppmanas du att ange ett annat namn. Geoobjektslagret kommer att inneh&aring;lla ett lager f&ouml;r vart och ett av f&ouml;ljande objekt: rutter, otilldelade startpunkter och otilldelade destinationer i de fall n&auml;r vissa startpunkter inte kan kopplas till sina destinationer.
            </p>
            <p>Om du v&auml;ljer  <b>Inkludera ruttlager</b> sparas varje rutt fr&aring;n resultatet &auml;ven som ett ruttlager. Ett ruttlager inneh&aring;ller all information f&ouml;r en specifik rutt, till exempel vilka stopp som rutten tilldelats samt v&auml;gbeskrivningar. Att skapa ruttlager &auml;r praktiskt om du vill dela enskilda rutter med andra medlemmar i din organisation eller om du vill &auml;ndra rutter ytterligare med knappen <b>V&auml;gbeskrivning</b> i kartvisaren. Ruttlagren anv&auml;nder geoobjektlagrets namn som prefix, och det ruttnamn som genereras under analysen l&auml;ggs till f&ouml;r att skapa ett unikt namn f&ouml;r varje ruttlager.
            </p>
            <p>Det maximala antalet ruttlager som kan skapas &auml;r  1 000. Om resultatet inneh&aring;ller fler &auml;n  1 000 rutter och  <b>Inkludera ruttlager</b> &auml;r markerat, skapar verktyget bara utdatageoobjekttj&auml;nsten.
            </p>
            <p>Om du anv&auml;nder listrutan  <b>Spara resultat i</b> kan du ange namnet p&aring; en mapp i <b>Mitt inneh&aring;ll</b> d&auml;r geoobjektlagret och ruttlagren (om de skapas) ska sparas.
            </p>
        </div>
    </div>
</div>
</html>
