<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Skapa buffertar</h2><p/>
        <h2><img src="../images/GUID-7F4A8E4D-42E3-41C1-9238-16619CE65079-web.png" alt="Skapa buffertar"></h2>
        <hr/>
    <p>En buffert &auml;r ett omr&aring;de som t&auml;cker ett givet avst&aring;nd fr&aring;n ett punkt-, linje- eller omr&aring;desgeoobjekt. 
    </p>
    <p>Buffertar anv&auml;nds normalt sett f&ouml;r att skapa omr&aring;den som kan analyseras ytterligare med verktyg som &Ouml;verlagra lager. Om fr&aring;gan till exempel &auml;r &quot;Vilka byggnader ligger inom en kilometer fr&aring;n skolan?&quot;, kan du hitta svaret genom att skapa en buffert p&aring; en kilometer kring skolan och sedan &ouml;verlagra bufferten med det lager som inneh&aring;ller byggnadsavtrycken med hj&auml;lp av verktyget &Ouml;verlagra lager. Slutresultatet blir ett lager med de byggnader som ligger inom en kilometer fr&aring;n skolan.  
    </p>
    <p>Om  <b>Anv&auml;nd aktuell kartutbredning</b> &auml;r markerat buffras endast de geoobjekt som &auml;r synliga i den aktuella kartutbredningen. Om alternativet inte markeras buffras alla geoobjekt i indatalagret, &auml;ven om de ligger utanf&ouml;r den aktuella kartutbredningen.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Välj lager som innehåller geoobjekt som ska bilda buffert</h2></div>
        <hr/>
        <div>
            <p>Det punkt-, linje- eller omr&aring;desgeoobjekt som ska bilda bufferten. 
            </p>
            <p>F&ouml;rutom att v&auml;lja ett lager p&aring; din karta kan du v&auml;lja  <b>V&auml;lj analyslager</b>, som du hittar l&auml;ngst ned i listrutan. Det alternativet &ouml;ppnar ett galleri d&auml;r du kan bl&auml;ddra till och v&auml;lja dataupps&auml;ttningar fr&aring;n diverse k&auml;llor som du kan anv&auml;nda i din analys. 
            </p>
        </div>
    </div>
    <div id="BufferSize">
        <div><h2>Ange buffertstorlek</h2></div>
        <hr/>
        <div>
            <p>Du kan ange ett enda avst&aring;ndsv&auml;rde eller flera v&auml;rden. Avgr&auml;nsa varje v&auml;rde med ett blanksteg. Du kan &auml;ven ange ett attribut f&ouml;r det indatalager som inneh&aring;ller avst&aring;ndsv&auml;rdet genom att klicka p&aring;  <b>F&auml;lt</b>.
            </p> 
        </div>
    </div>
    <div id="OptionPoint">
        <div><h2>Alternativ</h2></div>
        <hr/>
        <div>
            <p>V&auml;lj hur du vill att &ouml;verlappande buffertar ska hanteras. F&ouml;r varje buffert som ligger &ouml;ver en annan buffert kan de gemensamma omr&aring;dena beh&aring;llas (&Ouml;verlappa) eller kombineras (L&ouml;s upp). N&auml;r  <b>L&ouml;s upp</b> anv&auml;nds l&ouml;ses alla buffertar upp tillsammans till ett enda flerdelat geoobjekt, och alla &ouml;verlappningar tas samtidigt bort.
            </p>  
            <p> N&auml;r du anv&auml;nder flera avst&aring;nd kan du v&auml;lja hur du vill &aring;terge avst&aring;ndet fr&aring;n det senaste buffertavst&aring;ndet. Om avst&aring;nden till exempel &auml;r 10 och 14 kan du g&ouml;ra p&aring; f&ouml;ljande s&auml;tt:
                <ul>
                    <li>V&auml;lj  <b>Ringar</b> om du vill ha buffertar som g&aring;r fr&aring;n 0 till 10 och 10 till 14.
                    </li>
                    <li>V&auml;lj  <b>Skivor</b> om du vill ha buffertar som g&aring;r fr&aring;n 0 till 10 och 0 till 14.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="OptionPoly">
        <div><h2>Alternativ</h2></div>
        <hr/>
        <div>
            <p>V&auml;lj hur du vill att &ouml;verlappande buffertar ska hanteras. F&ouml;r varje buffert som ligger &ouml;ver en annan buffert kan de gemensamma omr&aring;dena beh&aring;llas (&Ouml;verlappa) eller kombineras (L&ouml;s upp). N&auml;r  <b>L&ouml;s upp</b> anv&auml;nds l&ouml;ses alla buffertar upp tillsammans till ett enda flerdelat geoobjekt, och alla &ouml;verlappningar tas samtidigt bort.
            </p>
            <p>N&auml;r du skapar en enstaka buffert kring omr&aring;desgeoobjekt (anger ett avst&aring;nd) kan du v&auml;lja om geoobjektet som buffras ska tas med eller utel&auml;mnas i resultatbufferten.
            </p>
            <p>N&auml;r du anv&auml;nder flera avst&aring;nd kan du v&auml;lja hur du vill &aring;terge avst&aring;ndet fr&aring;n det senaste buffertavst&aring;ndet. Om avst&aring;nden till exempel &auml;r 10 och 14 kan du g&ouml;ra p&aring; f&ouml;ljande s&auml;tt:
                <ul>
                    <li>V&auml;lj  <b>Ringar</b> om du vill ha buffertar som g&aring;r fr&aring;n 0 till 10 och 10 till 14.
                    </li>
                    <li>V&auml;lj  <b>Skivor</b> om du vill ha buffertar som g&aring;r fr&aring;n 0 till 10 och 0 till 14.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="OptionLine">
        <div><h2>Alternativ</h2></div>
        <hr/>
        <div>
            <p>V&auml;lj hur du vill att &ouml;verlappande buffertar ska hanteras. F&ouml;r varje buffert som ligger &ouml;ver en annan buffert kan de gemensamma omr&aring;dena beh&aring;llas (&Ouml;verlappa) eller kombineras (L&ouml;s upp). N&auml;r  <b>L&ouml;s upp</b> anv&auml;nds l&ouml;ses alla buffertar upp tillsammans till ett enda flerdelat geoobjekt, och alla &ouml;verlappningar tas samtidigt bort.
            </p>
            <p>N&auml;r du skapar en enstaka buffert runt linjer (anger ett avst&aring;nd) kan du v&auml;lja vilken sida av linjen som ska buffras. Normalt sett v&auml;ljer du b&aring;da sidor. V&auml;nster och h&ouml;ger avg&ouml;rs som om du gick fr&aring;n den f&ouml;rsta x,y-koordinaten f&ouml;r linjen (startkoordinaten) till den sista x,y-koordinaten f&ouml;r linjen (slutkoordinaten). Om du v&auml;ljer v&auml;nster eller h&ouml;ger inneb&auml;r det vanligtvis att du vet att linjegeoobjekten har skapats och lagrats i en riktning (till exempel uppstr&ouml;ms eller nedstr&ouml;ms i ett flodsystem). I linjens &auml;ndar kan bufferten avrundas (Rund) eller vara rak (Platt).
            </p>
            <p>N&auml;r du skapar flera buffertar (mer &auml;n ett avst&aring;nd) kan du v&auml;lja hur du vill &aring;terge avst&aring;ndet fr&aring;n det senaste buffertavst&aring;ndet. Om avst&aring;nden till exempel &auml;r 10 och 14 kan du g&ouml;ra p&aring; f&ouml;ljande s&auml;tt:
                <ul>
                    <li>V&auml;lj  <b>Ringar</b> om du vill ha buffertar som g&aring;r fr&aring;n 0 till 10 och 10 till 14.
                    </li>
                    <li>V&auml;lj  <b>Skivor</b> om du vill ha buffertar som g&aring;r fr&aring;n 0 till 10 och 0 till 14.
                    </li>
                </ul>
                
            </p> 
        </div>
    </div>
    <div id="OptionNolayer">
        <div><h2>Alternativ</h2></div>
        <hr/>
        <div>
            <p>N&auml;r du v&auml;ljer ett lager som buffert kan du v&auml;lja hur du vill att &ouml;verlappande buffertar ska hanteras. F&ouml;r varje buffert som ligger &ouml;ver en annan buffert kan de gemensamma omr&aring;dena beh&aring;llas (&Ouml;verlappa) eller kombineras (L&ouml;s upp). N&auml;r  <b>L&ouml;s upp</b> anv&auml;nds l&ouml;ses alla buffertar upp tillsammans till ett enda flerdelat geoobjekt, och alla &ouml;verlappningar tas samtidigt bort. Dessutom kan du ange hur flera distanser ska representeras.   F&ouml;r lager som inneh&aring;ller linjegeoobjekt kan du v&auml;lja vilken sida av linjen som ska ing&aring; i bufferten.  F&ouml;r lager som inneh&aring;ll omr&aring;desgeoobjekt kan du v&auml;lja om geoobjektet som buffras ska tas med eller utel&auml;mnas i resultatbufferten.
            </p>
        </div>
    </div>
    <div id="BufferLayer">
        <div><h2>Resultatlagrets namn</h2></div>
        <hr/>
        <div>
            <p>Det h&auml;r &auml;r namnet p&aring; lagret som skapas i  <b>Mitt inneh&aring;ll</b> och l&auml;ggs till i kartan. Standardnamnet baseras p&aring; verktygets namn och indatalagrets namn. Om lagernamnet redan finns uppmanas du ange ett annat namn.
            </p>
            <p>Om du anv&auml;nder listrutan  <b>Spara resultat i</b> kan du ange namnet p&aring; en mapp i <b>Mitt inneh&aring;ll</b> d&auml;r resultatet ska sparas.
            </p>
        </div>
    </div>
</div>
</html>
