<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Summera attribut</h2><p/>
        <h2><img src="../images/GUID-F64B533F-B0BB-4519-9F31-BCF814084999-web.png" alt="Summera attribut diagram"></h2>
        <hr/>
    <p> Det h&auml;r verktyget summerar alla matchande v&auml;rden i ett eller flera f&auml;lt och ber&auml;knar statistik p&aring; dem. Den mest grundl&auml;ggande statistiken &auml;r antalet geoobjekt som har summerats tillsammans, men du kan ocks&aring; ber&auml;kna mer avancerad statistik.
    </p>
    <p>Anta till exempel att du har punktgeoobjekt i form av platser f&ouml;r butiker med ett f&auml;lt som representerar  <i>DISTRICT_MANAGER_NAME</i>, och nu vill summera kaffef&ouml;rs&auml;ljningen per chef. Du kan ange f&auml;ltet <i>DISTRIKTSCHEFENS_NAMN</i> som f&auml;ltet att l&ouml;sa upp p&aring;, och alla rader med data som representerar enskilda chefer summeras. Det inneb&auml;r att alla butiksplatser d&auml;r <pre>Manager1</pre> &auml;r chef summeras till en rad, d&auml;r summerad statistik &auml;r ber&auml;knad. I det h&auml;r fallet ber&auml;knas statistik som antalet butiker och summan av <i>TOTAL_SALES</i> f&ouml;r alla butiker som <pre>Manager1</pre> &auml;r chef f&ouml;r,, liksom f&ouml;r alla andra chefer som listas i f&auml;ltet <i>DISTRICT_MANAGER_NAME</i>.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>V채lj vilka indata som ska summeras</h2></div>
        <hr/>
        <div>
            <p>Det lager som inneh&aring;ller f&auml;lten som ska summeras.  
            </p>
            <p>F&ouml;rutom att v&auml;lja ett lager fr&aring;n kartan kan du v&auml;lja  <b>V&auml;lj analyslager</b> l&auml;ngst ned i listrutan f&ouml;r att bl&auml;ddra till ditt inneh&aring;ll efter ett big data-fildelningsdataset eller geoobjektlager.
            </p>
        </div>
    </div>
    <div id="fields">
        <div><h2>V채lj hur du vill summera data</h2></div>
        <hr/>
        <div>
            <p>Det finns tv&aring; s&auml;tt att summera data:
                <ul>
                    <li> <b>Alla geoobjekt till ett enda geoobjekt</b> &ndash; Ber&auml;knar statistik p&aring; alla geoobjekt.
                    </li>
                    <li> <b>Efter f&auml;lt</b> &ndash; Grupperar geoobjekt efter samma v&auml;rden i angivna f&auml;lt.
                    </li>
                </ul>
                
            </p>
            <p>Anta att du till exempel har ett dataset med tr&auml;d som inneh&aring;ller f&auml;lt med  <i>treetype</i> och v&auml;rdena <code>L&ouml;nn</code>, <code>Fur</code> och <code>Gran</code>, samt f&auml;ltet <i>treeheight</i>, och du vill hitta medelv&auml;rdet f&ouml;r <i>treeheight</i>. Om du summerar alla geoobjekt till ett geoobjekt hittar du medelv&auml;rdet f&ouml;r tr&auml;dh&ouml;jden f&ouml;r alla tr&auml;d, och resultatet presenteras som ett medelv&auml;rde. Om du summerar efter f&auml;ltet <i>treeheight</i>, f&aring;r du ett medelv&auml;rde f&ouml;r l&ouml;nntr&auml;d, ett medelv&auml;rde f&ouml;r furor och ett medelv&auml;rde f&ouml;r granar.
            </p>
        </div>
    </div>
    <div id="summaryFields">
        <div><h2>L채gg till statistik (valfritt)</h2></div>
        <hr/>
        <div>
            <p> Du kan ber&auml;kna statistik p&aring; summerade geoobjekt. Du kan ber&auml;kna f&ouml;ljande p&aring; numeriska f&auml;lt:
                <ul>
                    <li>Antal &ndash; Ber&auml;knar antal v&auml;rden som inte &auml;r null. Kan anv&auml;ndas p&aring; numeriska f&auml;lt eller str&auml;ngar. Antalet f&ouml;r [null, 0, 2] &auml;r 2.
                    </li>
                    <li>Summa &ndash; Summan av de numeriska v&auml;rdena i ett f&auml;lt. Summan f&ouml;r [null, null, 3] &auml;r 3.
                    </li>
                    <li>Medelv&auml;rde &ndash; Medelv&auml;rdet f&ouml;r numeriska v&auml;rden. Medelv&auml;rde f&ouml;r [0, 2, null] &auml;r 1.
                    </li>
                    <li>Min &ndash; Minimiv&auml;rdet f&ouml;r ett numeriskt f&auml;lt. Minimiv&auml;rde f&ouml;r [0, 2, null] &auml;r 0. 
                    </li>
                    <li>Max &ndash; Det maximala v&auml;rdet f&ouml;r ett numeriskt f&auml;lt. Det maximala v&auml;rdet f&ouml;r [0, 2, null] &auml;r 2.
                    </li>
                    <li>Intervall &ndash; Intervallet f&ouml;r ett numeriskt f&auml;lt. Det ber&auml;knas som det maximala v&auml;rdet minus minimiv&auml;rdena. Intervallet f&ouml;r [0, null, 1] &auml;r 1. Intervallet f&ouml;r [null, 4] &auml;r 0.
                    </li>
                    <li>Varians &ndash; Variansen hos ett numeriskt f&auml;lt i ett sp&aring;r. Variansen hos [1] &auml;r null. Variansen hos [null, 1,0,1,1] &auml;r 0,25.
                    </li>
                    <li>Standardavvikelse &ndash; Standardavvikelsen hos ett numeriskt f&auml;lt. Standardavvikelsen hos [1] &auml;r null. Standardavvikelsen hos [null, 1,0,1,1] &auml;r 0,5. 
                    </li>
                </ul>
                
            </p>
            <p>Du kan ber&auml;kna f&ouml;ljande p&aring; numeriska f&auml;lt:
                <ul>
                    <li>Antal &ndash; Antalet str&auml;ngar som inte &auml;r null.
                    </li>
                    <li>Alla &ndash; Det statistiska v&auml;rdet &auml;r ett slumpm&auml;ssigt exempel p&aring; ett str&auml;ngv&auml;rde i det angivna f&auml;ltet.
                    </li>
                </ul>
                All statistik ber&auml;knas p&aring; v&auml;rden som inte &auml;r null. Det resulterande lagret inneh&aring;ller ett nytt f&auml;lt f&ouml;r varje statistiskt v&auml;rde som ber&auml;knas. Du kan l&auml;gga till valfri m&auml;ngd statistiska v&auml;rden genom att v&auml;lja ett attribut och statistik. 
            </p>
        </div>
    </div>
    <div id="dataStore">
        <div><h2>V채lj datalager</h2></div>
        <hr/>
        <div>
            <p>GeoAnalytics-resultat sparas i ett datalager och visas som ett geoobjektlager i  Portal for ArcGIS. I de flesta fall ska resultat sparas i det rumstemporala datalagret och det &auml;r standardinst&auml;llningen. I vissa fall &auml;r det ett bra alternativ att spara resultat i det relationella datalagret. F&ouml;ljande &auml;r anledningar till varf&ouml;r du kanske vill spara resultat i det relationella datalagret: 
                <ul>
                    <li>Du kan anv&auml;nda resultaten i portal-till-portal-samarbeten.
                    </li>
                    <li>Du kan aktivera synkroniseringsfunktioner med dina resultat.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Resultatlagrets namn</h2></div>
        <hr/>
        <div>
            <p> Namnet p&aring; lagret som ska skapas.  Om du skriver till en ArcGIS Data Store, sparas dina resultat i  <b>Mitt inneh&aring;ll</b> och l&auml;ggs till i kartan. Om du skriver till en big data-fildelning, lagras dina resultat i big data-fildelningen och l&auml;ggs till i dess manifest. Det l&auml;ggs inte till i kartan. Standardnamnet baseras p&aring; verktygets namn och indatalagrets namn. Om lagret redan finns misslyckas verktyget.
            </p>
            <p>N&auml;r du skriver till   ArcGIS Data Store (relationellt eller rumstempor&auml;rt Big Data-datalager) med listrutan  <b>Spara resultat i</b> kan du ange namnet p&aring; en mapp i <b>Mitt inneh&aring;ll</b> d&auml;r resultatet ska sparas.
            </p>
        </div>
    </div>
</div>
</html>
