<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Însumare puncte</h2><p/>
        <h2><img src="../images/GUID-6C1620D9-D176-41FA-8283-833D8B1CCCFC-web.png" alt="&Icirc;nsumare puncte"></h2>
        <hr/>
    <p>Acest instrument funcţionează cu un strat tematic de obiecte spaţiale punct şi cu un strat tematic de obiecte spaţiale suprafaţă.  Obiectele spaţiale de intrare pot fi dintr-un strat tematic de poligoane sau pot fi coşuri pătrate sau hexagonale calculate la rularea instrumentului. Instrumentul determină mai &icirc;nt&acirc;i ce puncte se &icirc;ncadrează &icirc;n suprafaţa specificată. După determinarea acestei relaţii spaţiale punct - suprafaţă, sunt calculate date statistice privind toate punctele din suprafaţă şi, apoi, sunt atribuite suprafeţei. Cea mai simplă statistică este calculul numărului de puncte din suprafaţă, &icirc;nsă mai puteţi obţine şi alte statistici. 

    </p>
    <p>De exemplu, să presupunem că aveţi obiecte spaţiale punct reprezent&acirc;nd locaţii de cafenele şi obiecte spaţiale suprafaţă reprezent&acirc;nd judeţe şi doriţi un rezumat al v&acirc;nzărilor de cafea pe judeţe. Presupun&acirc;nd că pentru cafenele există un atribut  <i>TOTAL_SALES</i>, puteţi obţine suma pentru toate atributele <i>TOTAL_SALES</i> din fiecare judeţ sau valoarea minimă sau maximă a atributului <i>TOTAL_SALES</i>
 din fiecare judeţ sau alte statistici, precum numărul, raza, deviaţia standard şi variaţia.
    </p>
    <p>Acest instrument poate să funcţioneze şi cu date care sunt legate de timp. Dacă timpul este activat pe punctele de intrare, atunci sunt disponibile opţiuni de segmentare a timpului. Segmentarea timpului vă permite să calculaţi relaţia punct-suprafaţă &icirc;n timp ce analizaţi un segment de timp specific. De exemplu, aţi putea analiza intervalele orare, ceea ce ar duce la rezultate pentru fiecare oră. 
    </p>
    <p>Pentru un exemplu cu timp, să presupunem că aveţi obiecte spaţiale punct pentru fiecare tranzacţie efectuată la diferite locaţii de cafenele şi niciun strat tematic. Datele au fost &icirc;nregistrate de-a lungul unui an şi fiecare tranzacţie are o locaţie şi o ştampilă cu timpul. Presupun&acirc;nd că fiecare tranzacţie are un atribut <i>TOTAL_SALES</i>, puteţi obţine suma tuturor atributelor <i>TOTAL_SALES</i> din spaţiul şi perioada de interes. Dacă aceste tranzacţii sunt pentru un singur oraş, am putea genera suprafeţe care sunt grile de 1 kilometru şi am putea analiza segmente de timp săptăm&acirc;nale pentru a rezuma tranzacţiile &icirc;n timp şi spaţiu.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="pointLayer">
        <div><h2>Alegeţi un strat tematic care conţine puncte pentru a le însuma în suprafeţe</h2></div>
        <hr/>
        <div>
            <p>Stratul tematic de puncte care va fi &icirc;nsumat &icirc;n suprafeţe. Straturile tematice de puncte care sunt agregate &icirc;n coşuri  <b>Pătrat </b> sau <b>Hexagon</b> trebuie să aibă referinţa spaţială de procesare setată pe un sistem de coordonate proiectate utiliz&acirc;nd <b>Mediul de analiză</b>.
            </p>
            <p>&Icirc;n afară de a alege un strat tematic din harta dvs., puteţi selecta opţiunile  <b>Alegere strat tematic de analiză</b> &icirc;n partea inferioară a listei verticale pentru a răsfoi conţinutul pentru stratul tematic sau setul de date pentru partajarea de fişiere big data.
            </p>
        </div>
    </div>
    <div id="inputAggregation">
        <div><h2>Selectaţi un strat tematic de suprafaţă în care se realizează unificarea</h2></div>
        <hr/>
        <div>
            <p>Suprafeţele &icirc;n care stratul tematic de puncte care va fi &icirc;nsumat. Puteţi alege &icirc;ntre un strat tematic de suprafeţe pe care &icirc;l furnizaţi şi coşuri care sunt generate atunci c&acirc;nd rulează instrumentul.   Atunci c&acirc;nd sunt generate coşuri, pentru  <b>Pătrat</b>, numărul şi unităţile specificate determină &icirc;nălţimea şi lungimea pătratului. Pentru <b>Hexagon</b>, numărul şi unităţile specificate determină distanţa dintre laturi paralele.
            </p>
            <p>Analiza cu coşurile  <b>Pătrat</b> sau <b>Hexagon</b> necesită un sistem de coordonate proiectat. Puteţi seta <b>Sistemul de coordonate de procesare</b> din <b>Medii de analiză</b>. Dacă sistemul dvs. de coordonate de procesare nu este setat la un sistem de coordonate proiectat, vi se va indica să &icirc;l setaţi atunci c&acirc;nd <b>Executați Analiza</b> .
            </p>
        </div>
    </div>
    <div id="polygonLayer">
        <div><h2>Selectaţi stratul tematic de suprafaţă în care se realizează unificarea</h2></div>
        <hr/>
        <div>
            <p>Stratul tematic cu suprafeţe &icirc;n care vor fi &icirc;nsumate punctele. Toate punctele care cad &icirc;n interiorul graniţelor suprafeţelor din acest strat tematic vor fi numărate şi rezumate opţional utiliz&acirc;ndu-se statisticile alese. 
            </p>
            <p>Trebuie setată  <b>Dimensiunea coșului</b> pentru coșuri sau <b>Stratul tematic al zonei</b>.
            </p>
        </div>
    </div>
    <div id="inputBins">
        <div><h2>Selectaţi o distanţă pentru generarea de containere şi în care se realizează agregarea</h2></div>
        <hr/>
        <div>
            <p>Distanţa utilizată pentru generarea de containere pentru &icirc;mbinarea punctelor de intrare. Pentru un coş pătrat, dimensiunea reprezintă &icirc;nălţimea pătratului. Pentru hexagon, dimensiunea reprezintă &icirc;nălţimea hexagonului (de la laturile paralele).  
            </p>
            <p>Trebuie setată  <b>Dimensiunea coșului</b> pentru coșuri sau <b>Stratul tematic al zonei</b>.
            </p>
        </div>
    </div>
    <div id="timeSlicing">
        <div><h2>Agregare utilizând trepte temporale (opţional)</h2></div>
        <hr/>
        <div>
            <p>Dacă timpul este activat &icirc;n stratul tematic de puncte de intrare şi este de tip instantaneu, puteţi analiza prin intermediul intervalelor de trepte temporare. Există trei parametri pe care &icirc;i puteţi seta atunci c&acirc;nd utilizaţi timpul:
                <ul>
                    <li> <b>Interval trepte temporale</b>
                    </li>
                    <li> <b>C&acirc;t de des se repetă treapta temporală</b>
                    </li>
                    <li> <b>Ora la care se aliniază treptele temporale</b>
                    </li>
                </ul>
                
            </p>
            <p>De exemplu, dacă aveți date care reprezintă un an &icirc;n timp și doriți să le analizați cu ajutorul treptelor săptăm&acirc;nale, setați  <b>Interval trepte temporale</b> la <code>1 săpt&acirc;m&acirc;nă</code>. 
            </p>
            <p>De exemplu, dacă aveți date care reprezintă un an &icirc;n timpși doriți să le analizați folosindprima săptăm&acirc;nă a lunii, setați  <b>Interval trepte temporale</b> la <code>1 săptăm&acirc;nă</code>, <b>C&acirc;t de des se repetă treapta temporală</b> la <code>1 lună</code>, și <b>Momentul de aliniere treptele temporale</b> la <code>1 ianuarie, la 12:00 am</code>.
            </p>
        </div>
    </div>
    <div id="timeInterval">
        <div><h2>Interval trepte temporale</h2></div>
        <hr/>
        <div>
            <p>Interval de timp folosit la generarea treptelor temporale.  <b>Intervalul de trepte temporale</b> poate fi folosit individual sau cu <b>C&acirc;t de des se repetă treptele temporale</b> sau <b>Timpul de aliniere a treptelor temporale la</b> parametru.
            </p>
            <p>De exemplu, dacă doriți să creați trepte temporale care  au loc &icirc;n fiecare luni de la 09:00 p&acirc;nă la 10:00, setați  <b>Interval de trepte temporale</b> la <code>1 oră</code>, <b>C&acirc;t de des se repetă treapta temporală</b> la <code>1 săptăm&acirc;nă</code>, și <b>Timpul de aliniere a treptelor temporale</b> la <code>9:00:00 &icirc;ntr-o zi de luni</code>.
            </p>
        </div>
    </div>
    <div id="timeStep">
        <div><h2>Cât de des se repetă treapta temporală</h2></div>
        <hr/>
        <div>
            <p> Treapta utilizată pentru calculul unui segment de timp. <b>C&acirc;t de des se repetă treapta temporală</b> poate fi utilizat individual, cu <b>Interval treaptă temporală</b>, cu <b>Timp de Referință</b>, sau at&acirc;t cu <b>Interval trepte temporale</b> c&acirc;t și cu <b>Timpul de aliniere a treptelor temporale la</b>.
            </p>
            <p> De exemplu, dacă doriți să creați trepte temporale care au loc &icirc;n fiecare luni de la 09:00 p&acirc;nă la 10:00, setați <b>Interval de trepte temporale</b> la <code>1 oră</code>, <b>C&acirc;t de des se repetă treapta temporală</b> la <code>1 săptăm&acirc;nă</code>, și <b>Timpul de aliniere a treptelor temporale la</b> la <code>9:00:00 a.m. &icirc;ntr-o zi de luni</code>.
            </p>
        </div>
    </div>
    <div id="timeReference">
        <div><h2>Ora la care se aliniază treptele temporale</h2></div>
        <hr/>
        <div>
            <p>Data şi ora utilizate pentru alinierea segmentelor temporale. Treptele temporale vor &icirc;ncepe la și vor continua &icirc;napoi de la această oră. Dacă nu este selectat nicio oră de referinţă, treptele temporare se vor alinia la 1 ianuarie 1970. 
            </p>
            <p> De exemplu, dacă doriți să creați trepte temporale care au loc &icirc;n fiecare luni de la 09:00 p&acirc;nă la 10:00, setați <b>Interval de trepte temporale</b> la <code>1 oră</code>, <b>C&acirc;t de des se repetă treapta temporală</b> la <code>1 săptăm&acirc;nă</code>, și <b>Timpul de aliniere a treptelor temporale la</b> la <code>9:00:00 a.m. &icirc;ntr-o zi de luni</code>.
            </p>
        </div>
    </div>
    <div id="summaryFields">
        <div><h2>Adăugare statistici (opţional)</h2></div>
        <hr/>
        <div>
            <p> Puteţi calcula statistici despre obiectele spaţiale rezumate. Puteți calcula următoarele pe c&acirc;mpuri numerice:
                <ul>
                    <li>Numărare&mdash;Calculează numărul de valori care nu sunt nule. Poate fi utilizat &icirc;n c&acirc;mpuri numerice sau șiruri. Calculul [nul, 0, 2] este egal cu 2.
                    </li>
                    <li>Sumă - Suma valorilor numerice dintr-un c&acirc;mp. Suma [nul, 0, 3] este egală cu 3.
                    </li>
                    <li>Media&mdash;Media valorilor numerice. Media dintre [0, 2, nul] este 1.
                    </li>
                    <li>Min&mdash;Valoarea minimă a unui c&acirc;mp numeric. Minimul dintre [0, 2, nul] este 0. 
                    </li>
                    <li>Max&mdash;Valoarea maximă a unui c&acirc;mp numeric. Valoarea maximă a [0, 2, nul] este 2.
                    </li>
                    <li>Interval&mdash;Intervalul unui c&acirc;mp numeric. Acesta este calculat ca valoare minimă scăzută din valoare maximă. Intervalul [nul, 0, 1] este 1. Intervalul [nul, 0, 4] este 0.
                    </li>
                    <li>Variaţia&mdash;Variaţia unui c&acirc;mp numeric pe o pistă. Variaţia [1] este nulă. Variația [nul, 1,0,1,1] este de 0,25.
                    </li>
                    <li>Deviaţia standard&mdash;Deviaţia standard a unui c&acirc;mp numeric. Deviaţia standard [1] este nulă. Deviaţia standard [nul, 1,0,1,1] este 0,5. 
                    </li>
                </ul>
                
            </p>
            <p>Puteți calcula următoarele pe c&acirc;mpuri de șiruri:
                <ul>
                    <li>Calcul&mdash;Numărul şirurilor care nu sunt nule.
                    </li>
                    <li>Oricare - Această statistică este un exemplu aleatoriu al unei valori de tip şir &icirc;n c&acirc;mpul specificat.
                    </li>
                </ul>
                Toate statisticile sunt calculate pentru valori care nu sunt nule. Stratul tematic rezultat va conţine un c&acirc;mp nou pentru fiecare statistică calculată. Se pot adăuga oric&acirc;te statistici aleg&acirc;nd un atribut şi o statistică. 
            </p>
        </div>
    </div>
    <div id="spatialReference">
        <div><h2>SpatialReference (wkid)</h2></div>
        <hr/>
        <div>
            <p>Acesta este un parametru temporar pentru pre-lansare, destinat procesării referinţei spaţiale. Numeroase instrumente big data necesită utilizarea unui sistem de coordonate estimat ca referinţă spaţială pentru procesare. &Icirc;n mod implicit, instrumentul va utiliza sistemul de coordonate de intrare dar va eşua dacă este un sistem de coordonate geografice. Pentru a seta un sistem de coordonate estimate, introduceţi WKID. De exemplu,  <b>Web Mercator</b> ar fi introdus ca <code>3857</code>.
            </p>
        </div>
    </div>
    <div id="dataStore">
        <div><h2>Alegeţi un depozit de date ArcGIS pe care să salvaţi rezultatele</h2></div>
        <hr/>
        <div>
            <p>Rezultatele GeoAnalytics sunt stocate &icirc;ntr-un depozit de date și sunt expuse ca strat tematic de obiecte spaţiale &icirc;n  Portal for ArcGIS. &Icirc;n cele mai multe situaţii, rezultatele trebuie stocate &icirc;n depozitul de date spaţio-temporar, &icirc;n mod implicit. &Icirc;n unele cazuri, salvarea rezultatelor &icirc;n depozitul depozit de date relaţionale este o opțiune bună. Mai jos sunt motivele pentru care ați dori să stocați rezultatele &icirc;n depozitul depozit de date relaţionale: 
                <ul>
                    <li>Puteți folosi rezultatele &icirc;n colaborarea-dintre-portaluri.
                    </li>
                    <li>Puteți activa capacitățile de sincronizare cu rezultatele dvs.
                    </li>
                </ul>
                
            </p>
            <p>Nu trebuie să utilizaţi depozitul de date relaţionale dacă vă aşteptaţi ca rezultatele GeoAnalytics să crească &icirc;n cantitate şi aveţi nevoie de capacităţile depozitului mare de stocare spaţio-temporal de a gestiona cantităţi mari de date.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nume strat tematic rezultat</h2></div>
        <hr/>
        <div>
            <p> Numele stratului tematic care va fi creat. Dacă scrieți &icirc;ntr-un ArcGIS Data Store, rezultatele dvs. vor fi salvate &icirc;n  <b>Resursele mele</b> și adăugate pe hartă. Dacă scrieți &icirc;ntr-o partajare de fişiere big data, rezultatele dvs. vor fi stocate &icirc;n partajarea de fişiere big data și adăugate la manifestul acesteia. Nu vor fi adăugate pe hartă. Numele implicit se bazează pe numele instrumentului şi numele stratului tematic de intrare. Dacă stratul tematic există deja, instrumentul va eşua.
            </p>
            <p>C&acirc;nd scrieți &icirc;n  ArcGIS Data Store (depozit de date relaționale sau spațio-temporale de volum mare) utiliz&acirc;nd caseta derulantă  <b>Salvare rezultat &icirc;n</b>, puteți specifica numele unui director din <b>Resursele mele</b> &icirc;n care va fi salvat rezultatul.
            </p>
        </div>
    </div>
</div>
</html>
