<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Copiaţi în depozitul de date</h2><p/>
        <h2><img src="../images/GUID-4030C721-25E4-41C0-A240-B18E869FC434-web.png" alt="Copiaţi &icirc;n depozitul de date"></h2>
        <hr/>
    <p>Acest instrument va lua un strat tematic de intrare şi &icirc;l va copia &icirc;ntr-un depozit de date. Puteți copia resultatele &icirc;n  ArcGIS Data Store (depozit de date relaționale sau spațio-temporale de volum mare) și un strat tematic va fi creat &icirc;n portalul dvs. sau puteți copia rezultatele &icirc;ntr-o partajare de fişiere big data. 
    </p>
    <p>De exemplu, aţi putea copia obiectele spaţiale care sunt stocate &icirc;ntr-un director de  <code>partajare a fişierelor big data</code> &icirc;ntr-un <code>depozit de date relaţional</code> şi aţi putea menţiona că vor fi copiate doar obiectele spaţiale din extinderea curentă a hărţii. Aceasta ar crea un serviciu de obiecte spaţiale găzduite doar cu acele obiecte spaţiale care se aflau &icirc;n extinderea de hartă specificată.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Alegeţi un strat tematic pentru copiere</h2></div>
        <hr/>
        <div>
            <p>Stratul tematic sau tabelul care va fi copiat. 
            </p>
            <p>&Icirc;n afară de a alege un strat tematic din harta dvs., puteţi selecta opţiunile  <b>Alegere strat tematic de analiză</b> &icirc;n partea inferioară a listei verticale pentru a răsfoi conţinutul pentru stratul tematic sau setul de date pentru partajarea de fişiere big data.
            </p>
        </div>
    </div>
    <div id="selection">
        <div><h2>Puteţi utiliza toate obiectele spaţiale sau puteţi realiza o selecţie (opţional)</h2></div>
        <hr/>
        <div>
            <p>Opţional, utilizaţi butonul de selecţie pentru a identifica locaţiile care vor fi copiate.
            </p>
        </div>
    </div>
    <div id="outputDataStore">
        <div><h2>Alegeți depozitul de date în care să copiați</h2></div>
        <hr/>
        <div>
            <p>Depozitul de date &icirc;n care va fi copiat stratul tematic. Acest parametru va suprascrie selecţia din  <b>Medii de analiză</b> Opţiunile sunt următoarele:
                <ul>
                    <li> <b>Depozit de date ArcGIS</b> ArcGIS Data Store <ul>
                            <li> <b>Spaţio-temporal</b> - Acesta este modul implicit.
                            </li>
                            <li> <b>Relaţional</b>
                            </li>
                        </ul>
                        
                    </li>
                    <li> <b>Șabloane de ieșire ale partajărilor de fişiere Big Data</b>
                        <ul>
                            <li>O listă de șabloane disponibile ale partajărilor de fişiere big data &icirc;n formatul  <b>bigDataFileShareName-templateName</b>. Șabloanele partajărilor de fişiere big data trebuie configurate &icirc;nainte de executarea funcției instrumentului.
                            </li>
                        </ul>
                        
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nume strat tematic rezultat</h2></div>
        <hr/>
        <div>
            <p> Numele stratului tematic care va fi creat. Dacă scrieți &icirc;ntr-un ArcGIS Data Store, rezultatele dvs. vor fi salvate &icirc;n  <b>Resursele mele</b> și adăugate pe hartă. Dacă scrieți &icirc;ntr-o partajare de fişiere big data, rezultatele dvs. vor fi stocate &icirc;n partajarea de fişiere big data și adăugate la manifestul acesteia. Nu vor fi adăugate pe hartă. Numele implicit se bazează pe numele instrumentului şi numele stratului tematic de intrare. Dacă stratul tematic există deja, instrumentul va eşua.
            </p>
            <p>C&acirc;nd scrieți &icirc;n  ArcGIS Data Store (depozit de date relaționale sau spațio-temporale de volum mare) utiliz&acirc;nd caseta derulantă  <b>Salvare rezultat &icirc;n</b>, puteți specifica numele unui director din <b>Resursele mele</b> &icirc;n care va fi salvat rezultatul.
            </p>
        </div>
    </div>
</div>
</html>
