<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Detectare obiecte folosind învățare aprofundată</h2><p/>
        <h2><img src="../images/GUID-EE76A33E-0B8F-48EE-94F8-782FAD241D72-web.png" alt="Detectare obiecte folosind &icirc;nvățare aprofundată"></h2>
        <hr/>
    <p>Acest instrument rulează un model de &icirc;nvățare aprofundată antrenat pe un raster de intrare pentru a produce o categorie de obiecte spațiale care conține obiectele pe care le găsește. Caracteristicile pot fi reprezentată de dreptunghiurille sau poligoanele de delimitare &icirc;n jurul obiectelor găsite, sau puncte &icirc;n centrele obiectelor.
    </p>
    <p>Dacă este bifat  <b>Utilizare extindere curentă a hărții</b>, va fi analizată doar zona raster care este vizibilă &icirc;n zona de vizualizare curentă a hărții. Dacă nu este bifat, va fi analizată toată zona raster, chiar dacă se află &icirc;n afara zonei de vizualizare curentă a hărţii.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputRaster">
        <div><h2>Alegeți imaginea utilizată pentru a detecta obiecte</h2></div>
        <hr/>
        <div>
            <p>Imaginea utilizată pentru a detecta obiecte.
            </p> 
        </div>
    </div>
    <div id="model">
        <div><h2>Alegeți un model de învățare aprofundată folosit pentru a detecta obiecte</h2></div>
        <hr/>
        <div>
            <p>Element Pachet de &icirc;nvățare aprofundată de intrare ( <code>.dlpk</code>).
            </p>
            <p>Pachetul de &icirc;nvățare aprofundată este compus din fișierul JSON de definire a modelului Esri ( <code>.emd</code>), fișierul modelului binar de &icirc;nvățare aprofundată, și opțional, se va folosi funcția raster Python.
            </p>
        </div>
    </div>
    <div id="modelArguments">
        <div><h2>Specificați argumentele modelului de învățare aprofundată</h2></div>
        <hr/>
        <div>
            <p>Argumentele funcției sunt definiți &icirc;n clasa funcțiilor raster Python la care se referă modelul de intrare. Aici găsiți listați parametri suplimentari de &icirc;nvățare aprofundată și argumente pentru experimente și rafinare, cum ar fi un prag de &icirc;ncredere pentru reglarea sensibilității.
            </p>
            <p>Numele argumentelor sunt populate de instrument prin citirea modulului Python de pe serverul de analiză raster.
            </p>
        </div>
    </div>
    <div id="runNMS">
        <div><h2>Ștergeți obiecte spațiale duplicat din ieșire (opțional)</h2></div>
        <hr/>
        <div>
            <p>Efectuează suprimarea non-maximală, &icirc;n cazul &icirc;n care sunt identificate obiecte duplicat și este eliminat obiectul spațial duplicat cu o valoare de &icirc;ncredere mai mică. 
                <ul>
                    <li>Debifat&mdash;Toate obiectele care sunt detectate vor fi &icirc;n categoria obiectelor spațiale de ieșire. Aceasta este setarea implicită.
                        

                    </li>
                    <li>Bifat&mdash;Elimină obiectele duplicat care sunt detectate.
                        

                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="confidenceScoreField">
        <div><h2>Câmpul de încredere</h2></div>
        <hr/>
        <div>
            <p>C&acirc;mpul din serviciul de obiecte spațiale care conține scorurile de &icirc;ncredere ca ieșire prin metoda de detecție a obiectelor.
            </p>
            <p>Acest parametru este necesar atunci c&acirc;nd bifați parametrul de  <b>Suprimare non-maximală</b>.
            </p>
        </div>
    </div>
    <div id="classValueField">
        <div><h2>Câmpul valoare a categoriei</h2></div>
        <hr/>
        <div>
            <p>C&acirc;mpul valorii clasei &icirc;n serviciul obiectelor spațiale de ieșire. Dacă nu este specificat, instrumentul va utiliza c&acirc;mpurile standar de valoare a categoriei <i>Classvalue</i> și <i>Value</i>. Dacă aceste c&acirc;mpuri nu există, toate obiectele spațiale vor fi tratate ca fiind aceeași clasă de obiecte.
            </p>
        </div>
    </div>
    <div id="maxOverlapRatio">
        <div><h2>Raport de suprapunere maximă</h2></div>
        <hr/>
        <div>
            <p>Raportul de suprapunere maximă pentru două obiecte spațiale care se suprapun, care este definit ca raportul dintre aria intersecției și aria reuniunii. Valoarea implicită este 0.
            </p>
        </div>
    </div>
    <div id="outputObjects">
        <div><h2>Nume strat tematic rezultat</h2></div>
        <hr/>
        <div>
            <p>Acesta este numele stratului tematic ce va fi creat &icirc;n  <b>Resursele mele</b> şi va fi adăugat pe hartă. Numele implicit se bazează pe numele instrumentului şi numele stratului tematic de intrare. Dacă stratul tematic rezultat există deja, vi se va solicita să furnizaţi un alt nume.
            </p>
            <p>Puteți specifica numele folderului &icirc;n  <b>Resursele mele</b> unde se va salva rezultatul folosind caseta drop-down <b>Salvați rezultatele &icirc;n</b>.
            </p>
        </div>
    </div>
</div>
</html>
