<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Urmărire în aval</h2><p/>
        <h2><img src="../images/GUID-1700E318-5F2D-4D4D-BF21-B12663F5D3C4-web.png" alt="Urmărire &icirc;n aval"></h2>
        <hr/>
    <p>Acest instrument stabileşte traiectoria sau traseul de scurgere pe direcţia aval dinspre punctele din stratul dvs. tematic de intrare.
    </p>
    <p>De exemplu, să presupunem că aveţi obiecte spaţiale punctuale reprezent&acirc;nd surse de contaminare şi doriţi să stabiliţi &icirc;ncotro se va scurge contaminarea &icirc;n cadrul zonei dvs. de studiu. Puteţi utiliza Traiectoria &icirc;n aval pentru a identifica traseul pe care &icirc;l va urma contaminarea.  De asemenea, această traiectorie poate fi &icirc;mpărţită &icirc;n segmente liniare individuale, specific&acirc;nd o valoare şi unităţi de măsură pentru distanţă. Linia rezultată poate reprezenta lungimea totală a traseului de scurgere, o lungime maximă specificată a traiectoriei sau obiectele spaţiale fixate la zonă, cum ar fi zona dvs. de studiu.   &Icirc;n multe cazuri, dacă rezultă lungimea totală a traseului de scurgere, aceasta va fi egală cu &icirc;ntreaga distanţă de sursă p&acirc;nă la ocean.
    </p>
    <p>Rezultatul este o linie care reprezintă traseul &icirc;n aval.  Dacă se specifică o distanţă pentru  <b>&Icirc;mpărţire traiectorie &icirc;n segmente liniare</b>, linia trasată va fi divizată &icirc;n linii multiple, fiecare linie av&acirc;nd lungimea specificată.  De exemplu, dacă punctul dvs. de intrare reprezintă o scurgere contaminantă, iar r&acirc;ul/fluviul &icirc;n care se deversează are o viteză de deplasare de 0,6 mile (0,97 km) pe oră sau 15 mile (24 km) pe zi, este de dorit să &icirc;mpărţiţi r&acirc;ul/fluviul &icirc;n segmente de 15 mile (24 km).  &Icirc;mpărţirea traiectoriei &icirc;n intervale de 15 mile (24 km) va indica distanţa aproximativă de deplasare a scurgerii &icirc;n fiecare zi.    Linia va fi reprezentată simbolic prin culori gradate, &icirc;n funcţie de distanţă, şi va fi marcată cu distanţa de la &icirc;nceputul traiectoriei.
    </p>
    <p>Traiectoria rezultată va avea toate atributele punctelor de intrare, c&acirc;t şi atribute suplimentare. 
        <ul>
            <li> <i>PointID</i> - Conţine valoarea ID de la punctul de intrare.
                

            </li>
            <li> <i>LengthKm</i> - Conţine lungimea &icirc;n kilometri pentru traiectoria totală &icirc;n aval.
                

            </li>
            <li> <i>Description</i> şi <i>DataResolution</i> - Conţine informaţii legate de datele hidrologice folosite pentru a calcula traiectoria.
                

            </li>
            <li> <i>FromDistance</i> și <i>ToDistance</i> - Conţine distanţa de la şi p&acirc;nă la a fiecărui segment liniar. Aceste atribute sunt scrise dacă se utilizează funcţia <b>&Icirc;mpărţire traiectorie &icirc;n segmente liniare</b>.
            </li>
        </ul>
        
    </p>
    <p>Dacă se bifează  <b>Utilizare extindere curentă hartă</b>, vor fi analizate numai obiectele spațiale punctuale din stratul tematic de intrare care sunt vizibile din extinderea curentă a hărții. Dacă nu se bifează, vor fi utilizate toate obiectele spațiale din stratul tematic introdus, chiar dacă se află &icirc;n afara extinderii curente a hărții.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Obiectele spaţiale punctuale care vor fi utilizate ca locaţii de start pentru fiecare traiectorie în aval</h2></div>
        <hr/>
        <div>
            <p>Obiectele spaţiale punctuale care vor fi utilizate ca locaţii de start pentru traiectoria &icirc;n aval.  Ieşirea va conţine o linie pentru fiecare punct de intrare.
            </p>
            <p>Pe l&acirc;ngă alegerea unui strat tematic din harta dvs., puteţi selecta  <b>Alegere strat tematic de analiză</b>, care se găseşte &icirc;n partea de jos a listei derulante. Această opțiune deschide o galerie &icirc;n care puteți răsfoi și selecta seturi de date din diferite surse pentru a le utiliza &icirc;n analiza dvs. 
            </p>
        </div>
    </div>
    <div id="SplitDistance">
        <div><h2>Împărțire traiectorie în segmente liniare</h2></div>
        <hr/>
        <div>
            <p>Linia de traiectorie va fi &icirc;mpărţită &icirc;n linii multiple, fiecare av&acirc;nd lungimea specificată.   De exemplu, dacă punctul dvs. de intrare reprezintă o scurgere contaminantă, iar r&acirc;ul/fluviul &icirc;n care se deversează are o viteză de deplasare de 0,6 mile (0,97 km) pe oră sau 15 mile (24 km) pe zi, este de dorit să &icirc;mpărţiţi r&acirc;ul/fluviul &icirc;n segmente de 15 mile (24 km).  &Icirc;mpărţirea traiectoriei &icirc;n intervale de 15 mile (24 km) va indica distanţa aproximativă de deplasare a scurgerii &icirc;n fiecare zi.    Linia va fi reprezentată simbolic prin culori gradate, &icirc;n funcţie de distanţă, şi va fi marcată cu distanţa de la &icirc;nceputul traiectoriei. Traiectoria rezultată va avea segmente liniare multiple, fiecare conţin&acirc;nd c&acirc;mpurile  <i>FromDistance</i> și <i>ToDistance</i>.
            </p>
        </div>
    </div>
    <div id="MaxDistance">
        <div><h2>Distanța maximă a traiectoriei</h2></div>
        <hr/>
        <div>
            <p>Stabileşte lungimea totală a liniei care va rezulta.  Dacă furnizaţi obiecte spaţiale de zonă pentru a fixa traiectoria, rezultatul va fi fixat la obiectul spaţial de zonă, indiferent de distanţa pe care o introduceţi aici.
            </p>
        </div>
    </div>
    <div id="ClipArea">
        <div><h2>Decupare rezultat la</h2></div>
        <hr/>
        <div>
            <p>Trasaţi sau furnizaţi un strat tematic al zonei &icirc;n care doriţi să fie fixată traiectoria.  De exemplu, dacă doriţi doar ca rezultatul traiectoriei să se afle &icirc;n zona dvs. de studiu, cum ar fi judeţul dvs., utilizaţi obiectul spaţial al judeţului dvs., astfel &icirc;nc&acirc;t traiectoria să se oprească la limita judeţului.
            </p>
        </div>
    </div>
    <div id="OutputTrace">
        <div><h2>Nume strat tematic rezultat</h2></div>
        <hr/>
        <div>
            <p>Acesta este numele stratului tematic care va fi creat &icirc;n  <b>Resursele mele</b> și adăugat &icirc;n hartă.  Numele implicit se bazează pe numele instrumentului și numele stratului tematic de intrare. Dacă numele stratului tematic rezultat există deja, vi se va solicita să furnizați un alt nume.
            </p>
            <p>Utiliz&acirc;nd meniul derul&acirc;nd  <b>Salvare rezultat &icirc;n</b>, puteți specifica numele unui director din <b>Resursele mele</b> &icirc;n care va fi salvat rezultatul.
            </p>
            <p> Rularea acestui instrument nu consumă credite.
            </p>
        </div>
    </div>
</div>
</html>
