<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Criar Buffers</h2><p/>
        <h2><img src="../images/GUID-6E648C49-37F9-4673-82D5-DB646921A828-web.png" alt="Criar Buffers"></h2>
        <hr/>
    <p>Um buffer &eacute; uma &aacute;rea que abrange uma determinada dist&acirc;ncia de um elemento de ponto, linha ou &aacute;rea. 
    </p>
    <p>Os buffers s&atilde;o normalmente utilizados para criar &aacute;reas que podem ser sujeitas a an&aacute;lise adicional utilizando outras ferramentas. Por exemplo, se a pergunta &eacute; &quot;Que edif&iacute;cios se encontram a uma milha da escola?&quot;, a resposta pode ser encontrada atrav&eacute;s da cria&ccedil;&atilde;o de um buffer de 1 milha em redor da escola e sobrepondo o buffer com a camada que cont&eacute;m os limites dos edif&iacute;cios. O resultado final &eacute; uma camada com os edif&iacute;cios que se encontram a 1 milha da escola.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Selecionar uma camada à qual aplicar buffer</h2></div>
        <hr/>
        <div>
            <p>O ponto, linha, ou elementos de &aacute;rea onde aplicar o buffer. As camadas de entrada t&ecirc;m de encontrar-se num sistema de coordenadas projetado que utilize os  <b>Ambientes de An&aacute;lise</b>.
            </p>
            <p>Para al&eacute;m de escolher uma camada do seu mapa, pode escolher  <b>Escolher Camada de An&aacute;lise</b> na parte inferior da lista pendente para navegar at&eacute; aos seus conte&uacute;dos de um conjunto de dados de partilha de ficheiros de big data ou camada de elementos.
            </p>
        </div>
    </div>
    <div id="bufferType">
        <div><h2>Selecionar o tipo de buffer a aplicar</h2></div>
        <hr/>
        <div>
            <p>Existem tr&ecirc;s maneiras de especificar o tamanho do buffer para os seus elementos de entrada: 
                <ul>
                    <li>Especificar uma dist&acirc;ncia a aplicar a todos os elementos.
                    </li>
                    <li>Especificar um campo, na camada de entrada, que contenha o valor da dist&acirc;ncia. Pode utilizar um campo de string ou um campo num&eacute;rico. Caso n&atilde;o esteja definida uma unidade linear, ser&atilde;o utilizadas as unidades de refer&ecirc;ncia espacial. Caso esteja a utilizar um sistema de coordenadas geogr&aacute;ficas, assumir-se-&aacute; que o campo que n&atilde;o possui qualquer unidade seja representado em metros. 
                    </li>
                    <li>Construir uma express&atilde;o com v&aacute;rios campos e operadores matem&aacute;ticos. Por exemplo, para aplicar buffer em 10 vezes o valor de um campo denominado  <i>wind_speed</i> adicione a express&atilde;o <i>$feature[&quot;wind_speed&quot;] x 10</i>.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="method">
        <div><h2>Selecionar o método de buffer</h2></div>
        <hr/>
        <div>
            <p>Pode optar por utilizar um m&eacute;todo  <b>Planar</b> ou um m&eacute;todo <b>Geod&eacute;sico</b> . O m&eacute;todo <b>Planar</b> pode ser mais r&aacute;pido e &eacute; apropriado para an&aacute;lise local de dados projetados. O m&eacute;todo <b>Geod&eacute;sico</b> &eacute; apropriado para &aacute;reas de grande dimens&atilde;o e para qualquer sistema de coordenadas geogr&aacute;ficas.
            </p>
        </div>
    </div>
    <div id="dissolveOption">
        <div><h2>Selecionar o tipo de método dissolver</h2></div>
        <hr/>
        <div>
            <p>Op&ccedil;&otilde;es para especificar o m&eacute;todo dissolver.   Se for escolhido um m&eacute;todo dissolver, ser-lhe-&aacute; dada a op&ccedil;&atilde;o de criar &aacute;reas com v&aacute;rias partes ou &uacute;nicas, e poder&aacute; calcular estat&iacute;sticas com base nos campos fornecidos.
                <ul>
                    <li> <b>Todos</b>&mdash;Todos os elementos ser&atilde;o dissolvidos. Caso sejam permitidos elementos de v&aacute;rias partes, todos os elementos ser&atilde;o dissolvidos num &uacute;nico elemento. Caso n&atilde;o sejam permitidos elementos de v&aacute;rias partes, os elementos adjacentes ou sobrepostos ser&atilde;o dissolvidos.
                    </li>
                    <li> <b>Campos</b>&mdash;Elementos que partilham o mesmo campo especificado, ou a mesma combina&ccedil;&atilde;o de campos especificada, ser&atilde;o dissolvidos. Caso sejam permitidos elementos de v&aacute;rias partes, todos os elementos com o mesmo campo ser&atilde;o dissolvidos num &uacute;nico elemento. Caso n&atilde;o sejam permitidos elementos de v&aacute;rias partes, os elementos adjacentes ou sobrepostos com o mesmo valor de campo ser&atilde;o dissolvidos.
                    </li>
                    <li> <b>Nenhum</b>&mdash;n&atilde;o ser&atilde;o dissolvidos quaisquer elementos.  Isto &eacute; por omiss&atilde;o.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="multipart">
        <div><h2>Permitir elementos de várias partes</h2></div>
        <hr/>
        <div>
            <p>Op&ccedil;&atilde;o para especificar se o seu resultado consistir&aacute; em elementos &uacute;nicos ou de v&aacute;rias partes. 

            </p>
            <p>
                <ul>
                    <li>Marcada&mdash;Os resultados da sua an&aacute;lise ir&atilde;o conter elementos de v&aacute;rias partes.   
                    </li>
                    <li>N&atilde;o Marcada&mdash; Os resultados da sua an&aacute;lise ir&atilde;o conter elementos &uacute;nicos. Esta &eacute; a predefini&ccedil;&atilde;o.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="summaryFields">
        <div><h2>Adicionar estatísticas (opcional)</h2></div>
        <hr/>
        <div>
            <p> Pode calcular estat&iacute;sticas em elementos que se encontram resumidos. Pode calcular os seguintes em campos num&eacute;ricos:
                <ul>
                    <li>Contagem&mdash;Calcula o n&uacute;mero de valores n&atilde;o-nulos. Pode ser utilizado em campos num&eacute;ricos ou em strings. A contagem de [null, 0, 2] &eacute; 2.
                    </li>
                    <li>Soma&mdash;A soma dos valores num&eacute;ricos num campo. A soma de [null, null, 3] &eacute; 3.
                    </li>
                    <li>M&eacute;dia&mdash;A m&eacute;dia de valores num&eacute;ricos. A m&eacute;dia de [0, 2, null] &eacute; 1.
                    </li>
                    <li>M&iacute;n&mdash;o valor m&iacute;nimo de um campo num&eacute;rico. O m&iacute;nimo de [0, 2, null] &eacute; 0. 
                    </li>
                    <li>M&aacute;x&mdash;o valor m&aacute;ximo de um campo num&eacute;rico. O valor m&aacute;ximo de [0, 2, null] &eacute; 2.
                    </li>
                    <li>Intervalo&mdash;o intervalo de um campo num&eacute;rico. Este &eacute; calculado subtraindo os valores m&iacute;nimos ao valor m&aacute;ximo. O intervalo de [0, null, 1] &eacute; 1. O intervalo de [null, 4] &eacute; 0.
                    </li>
                    <li>Vari&acirc;ncia&mdash;a vari&acirc;ncia de um campo num&eacute;rico num trilho. A vari&acirc;ncia de [1] &eacute; null. A vari&acirc;ncia de [null, 1,0,1] &eacute; 0.25.
                    </li>
                    <li>Desvio padr&atilde;o&mdash;O desvio padr&atilde;o de um campo num&eacute;rico. O desvio padr&atilde;o de [1] &eacute; null. O desvio padr&atilde;o de [null, 1,0,1,1] &eacute; 0.5. 
                    </li>
                </ul>
                
            </p>
            <p>Pode calcular os seguintes em campos de string:
                <ul>
                    <li>Contagem&mdash;O n&uacute;mero de strings n&atilde;o-nulas.
                    </li>
                    <li>Qualquer&mdash;Esta estat&iacute;stica &eacute; uma amostra aleat&oacute;ria de um valor de string no campo especificado.
                    </li>
                </ul>
                Todas as estat&iacute;sticas s&atilde;o calculadas em campos que n&atilde;o s&atilde;o nulos. A camada resultante ir&aacute; conter um novo campo por cada estat&iacute;stica calculada. &Eacute; poss&iacute;vel adicionar qualquer n&uacute;mero de estat&iacute;sticas, selecionando um atributo e uma estat&iacute;stica. 
            </p>
        </div>
    </div>
    <div id="dataStore">
        <div><h2>Selecionar um ArcGIS Data Store no qual guardar os resultados</h2></div>
        <hr/>
        <div>
            <p>Os resultados de GeoAnalytics s&atilde;o guardados num armazenamento de dados e expostos como uma camada de elementos em   Portal for ArcGIS. Na maioria dos casos, os resultados dever&atilde;o ser armazenados num armazenamento de dados espaciotemporal, sendo este o comportamento predefinido. Em alguns casos, ser&aacute; uma boa op&ccedil;&atilde;o guardar os resultados no armazenamento de dados relacional. As seguintes s&atilde;o raz&otilde;es que justificam o armazenamento de resultados no armazenamento de dados relacional. 
                <ul>
                    <li>Pode utilizar resultados em colabora&ccedil;&atilde;o portal-to-portal.
                    </li>
                    <li>Pode ativar funcionalidades de sincroniza&ccedil;&atilde;o com os seus resultados
                    </li>
                </ul>
                
            </p>
            <p>N&atilde;o dever&aacute; utilizar o armazenamento de dados relacional caso antecipe um aumento dos seus resultados de GeoAnalytics e necessite de tirar partido das funcionalidades de armazenamento de big data espaciotemporais para gerir grandes quantidades de dados.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nome da camada resultante</h2></div>
        <hr/>
        <div>
            <p> O nome da camada que ser&aacute; criada.  Se estiver a escrever para ArcGIS Data Store, os seus resultados ser&atilde;o gravados em  <b>O Meu Conte&uacute;do</b> e adicionados ao mapa. Se estiver a escrever para uma partilha de ficheiros big data, os seus resultados ser&atilde;o guardados numa partilha de ficheiros big data e adicionados ao seu manifesto. N&atilde;o ser&atilde;o adicionados ao mapa. O nome padr&atilde;o &eacute; baseado no nome da ferramenta e do nome da camada de entrada. Caso a camada j&aacute; existe, a ferramenta ir&aacute; falhar.
            </p>
            <p>Ao escrever para   ArcGIS Data Store  (armazenamento relacional ou espaciotemporal de dados big data) utilizando a caixa suspensa  <b>Guardar resultado em</b> pode especificar o nome de uma pasta em <b>O Meu Conte&uacute;do</b>, onde ser&aacute; armazenado o resultado.
            </p>
        </div>
    </div>
</div>
</html>
