<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Criar Áreas de Tempo do Percurso</h2><p/>
        <h2><img src="../images/GUID-6F629A09-768D-4C04-88A4-AB941811ADE9-web.png" alt="Criar &Aacute;reas de Tempo do Percurso"></h2>
        <hr/>
    <p>Criar &Aacute;reas de Tempo do Percurso-Cria &aacute;reas que podem ser alcan&ccedil;ados dentro de um per&iacute;odo especificado tempo de condu&ccedil;&atilde;o, dist&acirc;ncia de carro, a p&eacute;, e assim por diante. Mede a partir de um ou v&aacute;rios pontos (at&eacute; 1,000), ao longo das estradas ou caminhos, para criar uma camada que pode ajud&aacute;-lo a responder a perguntas como:
        <ul>
            <li>At&eacute; onde posso ir conduzindo cerca de 30 minutos de carro?
            </li>
            <li>At&eacute; onde posso ir conduzindo cerca de 30 minutos de carro &agrave;s 5:30 da tarde em plena hora de ponta?
            </li>
            <li>O que est&aacute; dentro de uma &aacute;rea de 2 quil&oacute;metros a p&eacute; do meu hotel?
            </li>
            <li>A que &aacute;reas da cidade a corpora&ccedil;&atilde;o de bombeiros pode chegar em cinco minutos? 
            </li>
            <li>Como a cobertura de resposta a inc&ecirc;ndios pode melhorar atrav&eacute;s da constru&ccedil;&atilde;o de um novo quartel de bombeiros aqui?
            </li>
            <li>Quais as &aacute;reas de mercado que o meu neg&oacute;cio n&atilde;o cobre?
            </li>
        </ul>
        
    </p>
    <p>Voc&ecirc; consegue responder &agrave;s suas perguntas apenas atrav&eacute;s da visualiza&ccedil;&atilde;o das &aacute;reas obtidas. Alternativamente, pode realizar uma an&aacute;lise espacial mais aprofundada utilizando as &aacute;reas obtidas. Por exemplo, calcular Pontos Agregados utilizando &aacute;reas de unidade de tempo com dados demogr&aacute;ficos podem ajudar a determinar qual o local potencial para uma loja provavelmente proporcionar a melhor base de clientes para o seu tipo de neg&oacute;cio. 
    </p>
    <p>
        <table>
        <tr><td colspan="3"><hr size="1" noshade="noshade"></td></tr>
        <tr><td valign="baseline"><img src="../images/tip.png"></td><td valign="baseline"><h2>Tip:&ensp;</h2></td>
        <td valign="baseline">
            <p>Para criar &aacute;reas medindo dist&acirc;ncias em linha reta em vez da medi&ccedil;&atilde;o ao longo das estradas, utilize em substitui&ccedil;&atilde;o a ferramenta Criar Buffers.
            </p>
        </td></tr>
        <tr><td colspan="3"><hr size="1" noshade="noshade"></td></tr>
        </table>
    </p>
    <p>Se a op&ccedil;&atilde;o  <b>Utilizar a extens&atilde;o atual do mapa</b> estiver ativa, apenas os elementos que est&atilde;o visiv&eacute;is na atual extens&atilde;o do mapa ser&atilde;o utilizados para criar as &aacute;reas de tempo de condu&ccedil;&atilde;o ou de dist&acirc;ncia de condu&ccedil;&atilde;o. Se n&atilde;o estiver ativo, todos os elementos da camada de entrada ser&atilde;o utilizados, mesmo que estejam fora da atual extens&atilde;o do mapa.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Escolher camada de ponto para calcular áreas de tempo de condução ao redor</h2></div>
        <hr/>
        <div>
            <p>Os elementos de ponto ao redor do qual as &aacute;reas ser&atilde;o calculadas- Pode escolher como as &aacute;reas s&atilde;o calculadas com base no modo de viagem (condu&ccedil;&atilde;o, cami&atilde;o ou caminhar) e medida (tempo e distancia).
            </p>
            <p>Al&eacute;m de escolher uma camada do seu mapa, pode selecionar  <b>Escolher Camada de An&aacute;lise</b> que se encontra na parte inferior da lista pendente. Esta op&ccedil;&atilde;o abre uma galeria, na qual pode navegar e selecionar conjuntos de dados de v&aacute;rias fontes para utilizar na sua an&aacute;lise. 
            </p>
            <p>A ferramenta suporta at&eacute; 1000 elementos na camada de entrada.

            </p>
        </div>
    </div>
    <div id="MeasurementMethod">
        <div><h2>Medir</h2></div>
        <hr/>
        <div>
            <p>Escolha o seu modo de viagem (condu&ccedil;&atilde;o, camionagem, ou a p&eacute;) e medida (tempo ou dist&acirc;ncia). Os modos de viagem dispon&iacute;veis s&atilde;o definidos pelo administrador da sua organiza&ccedil;&atilde;o.   Depois de escolher o modo e a medida, introduza a dura&ccedil;&atilde;o ou distancia at&eacute;  5 horas (300 minutos) ou  300 milhas (482,80 quil&oacute;metros). 
            </p>
            <p>A dire&ccedil;&atilde;o de desloca&ccedil;&atilde;o ( <b>Para Longe da Instala&ccedil;&atilde;o</b> ou <b>Em Dire&ccedil;&atilde;o &agrave; Instala&ccedil;&atilde;o</b>) pode influenciar a forma como as &aacute;reas s&atilde;o geradas. Criar &Aacute;reas de Tempo do Percurso vai respeitar ruas de sentido &uacute;nico, evitar invers&otilde;es de marcha proibidas e outras regras com base na dire&ccedil;&atilde;o de desloca&ccedil;&atilde;o. Deve selecionar a dire&ccedil;&atilde;o de desloca&ccedil;&atilde;o com base no tipo de localiza&ccedil;&otilde;es de entrada e no contexto da sua an&aacute;lise. Por exemplo, a &aacute;rea de tempo de percurso para uma loja de entrega de pizzas deve ser criada para longe da instala&ccedil;&atilde;o, ao passo que a &aacute;rea de tempo de condu&ccedil;&atilde;o para um hospital deve ser criada em dire&ccedil;&atilde;o &agrave; instala&ccedil;&atilde;o.
            </p>
            <p>Quando seleciona  <b>Tempo de Condu&ccedil;&atilde;o</b>, <b>Tempo de Condu&ccedil;&atilde;o Rural</b>, ou <b>Tempo de Condu&ccedil;&atilde;o em Cami&atilde;o</b> tem acesso a op&ccedil;&otilde;es sobre como medir o tempo de condu&ccedil;&atilde;o.
                <ul>
                    <li>
                        <p>Desative  <b>Utilizar Tr&aacute;fego</b> para criar &aacute;reas de quantidades de tempo com base em velocidades fixas. Esta &eacute; a op&ccedil;&atilde;o a escolher se pretender calcular &aacute;reas gerais de quantidades de tempo, e n&atilde;o aquelas que s&atilde;o calculadas utilizando as condi&ccedil;&otilde;es de tr&aacute;fego que se alteram para uma partida a uma determinada hora.
                        </p>
                    </li>
                    <li>
                        <p>Ative  <b>Utilizar Tr&aacute;fego</b> para criar &aacute;reas de quantidades de tempo com base num determinado momento de partida e evolu&ccedil;&atilde;o das condi&ccedil;&otilde;es de tr&aacute;fego. Tamb&eacute;m ao escolher a op&ccedil;&atilde;o <b>Tr&aacute;fego em Tempo Real</b> , a hora de partida dos pontos de entrada &eacute; definida para o tempo actual, e as velocidades de tr&aacute;fego atuais e esperadas s&atilde;o referenciadas a partir de sensores para criar as &aacute;reas de quantidades de tempo. As velocidades de tr&aacute;fego previstas s&atilde;o calculadas em refer&ecirc;ncia a velocidades de tr&aacute;fego em tempo real, velocidades hist&oacute;ricas e eventos atuais como o clima. As velocidades de tr&aacute;fego conseguem fazer uma previs&atilde;o at&eacute; 12 horas, de modo a que possa mover o slider para definir a hora de partida at&eacute; 12 horas.
                        </p>
                        <p>Utilize estas defini&ccedil;&otilde;es de tr&acirc;nsito em tempo real para descobrir que &aacute;reas podem ser alcan&ccedil;adas partindo agora, partindo daqui a uma hora a contar a partir de agora, e assim por diante.
                        </p>
                    </li>
                    <li>
                        <p>Ao activar  <b>Utilizar Tr&aacute;fego</b> e seleccionando <b>Tr&aacute;fego baseado nas condi&ccedil;&otilde;es t&iacute;picas para</b> um dia e uma hora, a ferramenta cria &aacute;reas de quantidades de tempo com base nas m&eacute;dias hist&oacute;ricas de velocidade para cada intervalo de cinco minutos numa semana de rotina. Os resultados incluem o tr&aacute;fego mas removem a influ&ecirc;ncia das condi&ccedil;&otilde;es de tr&aacute;fego atuais e de eventos, que podem variar significativamente da norma.
                        </p>
                        <p>Voc&ecirc; pode usar estas configura&ccedil;&otilde;es de hist&oacute;rico de tr&aacute;fego para perguntar, por exemplo, &quot;Que &aacute;reas posso geralmente atingir quando parto &agrave;s 11h30 numa quarta-feira?&quot; 
                        </p>
                        <p>O tempo que definir refere-se ao fuso hor&aacute;rio em que os seus pontos de entrada est&atilde;o localizados. Assim, se definir a hora para 8:00 e tiver dois pontos, um na cidade de Nova Iorque e outro em Los Angeles, as &aacute;reas de tempo de condu&ccedil;&atilde;o ser&atilde;o gerados para hora de partida de 8:00. Hora do Leste e 08h00. Hor&aacute;rio do Pac&iacute;fico, respectivamente.
                        </p>
                    </li>
                </ul>
                
            </p>
            <p>Note que &agrave; medida que um ve&iacute;culo se dirige para longe de um ponto, o tempo aumenta e as condi&ccedil;&otilde;es de tr&aacute;fego mudam. A ferramenta &Aacute;reas de Tempo do Percurso &eacute; respons&aacute;vel por estas varia&ccedil;&otilde;es quando escolhe  <b>Tempo de Percurso</b> e marque <b>Usar trafego</b>; no entanto, nem todas as regi&otilde;es suportam trafego. Clique na liga&ccedil;&atilde;o <b>Verificar disponibilidade</b> na ferramenta para verificar se est&aacute; dispon&iacute;vel na sua regi&atilde;o.
            </p>
            <p> <b>Tempo de Condu&ccedil;&atilde;o em Cami&atilde;o</b> pode utilizar velocidades de viagem din&acirc;micas com base no tr&acirc;nsito, mas apenas at&eacute; ao limite de velocidade legal para cami&otilde;es. Por exemplo, caso a velocidade din&acirc;mica para uma rua, com base no tr&acirc;nsito em tempo real, for de 65 milhas por hora, mas o limite de velocidade para cami&otilde;es nessa rua seja 55 milhas por hora, o c&aacute;lculo utilizar&aacute; 55 milhas por hora para essa rua.
            </p>
            <p> <b>Tempo a P&eacute;</b> e <b>Distancia a P&eacute;</b> utiliza uma velocidade fixa de 5 quil&oacute;metros por hora (3,1 milhas por hora) e segue passagens pedonais bem como ruas designadas (ignorando regras que afectam autom&oacute;veis, tais como ruas de sentido &uacute;nico). </p>
            <p> <b>Dist&acirc;ncia de Condu&ccedil;&atilde;o em Cami&atilde;o</b>  utiliza velocidades fixas e segue regrasaplic&aacute;veis a cami&otilde;es pesados, enquanto <b>Dist&acirc;ncia de Condu&ccedil;&atilde;o</b> e <b>Dist&acirc;ncia de Condu&ccedil;&atilde;o Rural</b> utilizam velocidades fixas e seguem regras aplic&aacute;veis a ve&iacute;culos autom&oacute;veis, como carros.
            </p> 
        </div>
    </div>
    <div id="barrier_layers">
        <div><h2>Selecionar camadas de barreiras</h2></div>
        <hr/>
        <div>
            <p> Um ou mais elementos que atuem como restri&ccedil;&otilde;es tempor&aacute;rias (barreiras) ao transitar pelas ruas subjacentes. Pode especificar as barreiras utilizando elementos de pontos, linhas ou pol&iacute;gonos.
            </p>
            <p>Uma barreira de pontos pode delinear uma &aacute;rvore ca&iacute;da, um acidente, uma linha el&eacute;trica derrubada ou algo que bloqueie completamente o tr&acirc;nsito numa posi&ccedil;&atilde;o espec&iacute;fica ao longo da rua. &Eacute; poss&iacute;vel transitar na rua, mas n&atilde;o pela barreira. Pode especificar at&eacute; 250 elementos para atuarem como barreiras de pontos.
            </p>
            <p>Uma barreira de linhas pro&iacute;be que se transite por qualquer ponto de intersec&ccedil;&atilde;o entre a barreira e as ruas. Por exemplo, um desfile ou protesto que bloqueie o tr&aacute;fego por v&aacute;rios segmentos de ruas pode ser delineado com uma barreira de linhas. Se o n&uacute;mero de elementos da rua intersetado por todas as barreiras de linhas for superior a 500 elementos, a ferramenta devolve um erro.
            </p>
            <p>Uma barreira de pol&iacute;gonos pro&iacute;be que se transite por qualquer ponto de intersec&ccedil;&atilde;o entre o pol&iacute;gono e as ruas. Este tipo de barreira pode ser utilizado para delinear inunda&ccedil;&otilde;es que abranjam &aacute;reas da rede de estradas e n&atilde;o permitam que se transite por elas. Se o n&uacute;mero de elementos da rua intersetado por todas as barreiras de pol&iacute;gonos for superior a 2000 elementos, a ferramenta devolve um erro.
            </p>
        </div>
    </div>
    <div id="DissolveType">
        <div><h2>Áreas de diferentes pontos</h2></div>
        <hr/>
        <div>
            <p>Escolha como &aacute;reas comuns de diferentes pontos de entrada s&atilde;o tratadas quando s&atilde;o alcan&ccedil;adas umas pelas outras. Elas podem:
                <ul>
                    <li> <b>Sobreposi&ccedil;&atilde;o</b>&mdash;&Aacute;reas de diferentes pontos de entrada que podem cobrir a mesma estrada. Isto &eacute; &uacute;til quando precisa saber todos os pontos de entrada que podem chegar a um determinado local dentro do tempo ou dist&acirc;ncia dada.
                    </li>
                    <li> <b>Dissolver</b>&mdash;Todas as &aacute;reas s&atilde;o fundidas numa s&oacute;, e n&atilde;o mais do que uma &aacute;rea pode cobrir um determinado local. Isto &eacute; &uacute;til quando tudo o que necessita saber &eacute; se uma &aacute;rea pode ser alcan&ccedil;ada dentro de um determinado tempo ou dist&acirc;ncia, mas n&atilde;o necessita saber quais os pontos de entrada espec&iacute;ficos de onde se pode chegar ao local.
                    </li>
                    <li> <b>Dividir</b>&mdash;As &aacute;reas de diferentes locais de entrada, que se sobrep&otilde;em uns aos outros, s&atilde;o divididos no meio, para que se encostem um ao outro em vez disso. Isto &eacute; &uacute;til quando quiser ver quais s&atilde;o as &aacute;reas dentro de um determinado tempo ou dist&acirc;ncia dos pontos de entrada e, ao mesmo tempo, determinar qual o ponto de entrada &eacute; o mais pr&oacute;ximo a essa &aacute;rea.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="showHoles">
        <div><h2>Exibir áreas não acessíveis como buracos</h2></div>
        <hr/>
        <div>
            <p>Escolha se as &aacute;reas de sa&iacute;da incluir&atilde;o buracos no caso de algumas ruas n&atilde;o estarem acess&iacute;veis devido &agrave;  <b>Medida</b> de tempo ou dist&acirc;ncia ou por restri&ccedil;&otilde;es impostas pelo modo de viagem.
            </p>
            <p>As &aacute;reas de tempo do percurso criadas com este n&iacute;vel de par&acirc;metro t&ecirc;m um limite de 15 minutos ou 15 milhas (24 quil&oacute;metros).
            </p>
        </div>
    </div>
    <div id="OutputLayer">
        <div><h2>Nome da Camada Resultante</h2></div>
        <hr/>
        <div>
            <p>Este &eacute; o nome da camada que ser&aacute; criada em  <b>O Meu Conte&uacute;do</b> e adicionada ao mapa. O nome padr&atilde;o &eacute; baseado no nome da ferramenta e do nome da camada de entrada. Se o nome da camada j&aacute; existir, ser-lhe-&aacute; pedido que introduza outro nome.
            </p>
            <p>Ao utilizar o menu suspenso  <b>Guardar resultado em</b> pode definir o nome da pasta em <b>O Meu Conte&uacute;do</b> onde o resultado ser&aacute; guardado.
            </p>
        </div>
    </div>
    <div id="includeReachableStreets">
        <div><h2>Incluir ruas acessíveis</h2></div>
        <hr/>
        <div>
            <p>Inclua as ruas que ser&atilde;o utilizadas para criar &aacute;reas de tempo do percurso como uma camada de sa&iacute;da. 
            </p>
            <p>Criar &Aacute;reas de Tempo do Percurso mede o alcance de uma instala&ccedil;&atilde;o ao longo de uma rede de ruas e, em seguida, cria &aacute;reas de tempo do percurso a partir das ruas percorridas. Por conseguinte, as &aacute;reas correspondem a uma aproxima&ccedil;&atilde;o das ruas percorridas. Se o objetivo da sua an&aacute;lise for determinar que ruas est&atilde;o cobertas dentro de um per&iacute;odo de tempo ou dist&acirc;ncia de percurso especifica de uma instala&ccedil;&atilde;o, gerar ruas acess&iacute;veis pode ser mais preciso do que utilizar &aacute;reas de tempo do percurso para avaliar se uma rua espec&iacute;fica estava acess&iacute;vel.
            </p>
            <p>As &aacute;reas de tempo do percurso criadas com este n&iacute;vel de par&acirc;metro t&ecirc;m um limite de 15 minutos ou 15 milhas (24 quil&oacute;metros).
            </p>
        </div>
    </div>
</div>
</html>
