<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Criar Viewshed</h2><p/>
        <h2><img src="../images/GUID-BB8B8CAF-330E-4C41-9D94-AF4728D0D0F3-web.png" alt="Ferramenta Criar Viewshed"></h2>
        <hr/>
    <p>Esta ferramenta identifica as &aacute;reas que um observador consegue ver, tendo em conta a topografia da superf&iacute;cie. Os pontos de an&aacute;lise de entrada podem representar tanto observadores (como pessoas no terreno ou vigias numa torre de controlo de inc&ecirc;ndios) ou objectos observados (tais como turbinas e&oacute;licas, dep&oacute;sitos de &aacute;gua, ve&iacute;culos, ou outras pessoas). Os resultados definem as &aacute;reas que podem ser visualizadas a partir das localiza&ccedil;&otilde;es dos observadores.
    </p>
    <p>Tanto os observadores como os objetos observados podem encontrar-se a uma altura acima do solo, e estas alturas s&atilde;o utilizadas para determinar a visibilidade. Por exemplo, uma viewshed calculada para turbinas e&oacute;licas de 300 p&eacute;s e uma pessoa com 6 p&eacute;s de altura, de p&eacute;, no solo, ser&aacute; tipicamente de maior dimens&atilde;o do que uma viewshed calculada para turbinas de 200 p&eacute;s e uma pessoa com 5 p&eacute;s de alftura.
    </p>
    <p>A camada de resultado regista o n&uacute;mero de vezes que cada localiza&ccedil;&atilde;o de c&eacute;lula no raster da superf&iacute;cie de entrada pode ser vista pelos pontos de observa&ccedil;&atilde;o de entrada. &Agrave;s c&eacute;lulas n&atilde;o-vis&iacute;veis s&atilde;o dados valores NonData.
    </p>
    <p>Se a op&ccedil;&atilde;o  <b>Utilizar a atual extens&atilde;o de mapa</b> estiver marcada, ser&atilde;o analisados apenas a &aacute;rea de raster e os pontos de observa&ccedil;&atilde;o que se encontrem vis&iacute;veis na atual extens&atilde;o do mapa. Se n&atilde;o marcar a op&ccedil;&atilde;o, ser&atilde;o analisados todos os pontos de observa&ccedil;&atilde;o da camada de entrada, mesmo que estejam fora da extens&atilde;o atual do mapa.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="elevationSurface">
        <div><h2>Superfície de elevação</h2></div>
        <hr/>
        <div>
            <p>A superf&iacute;cie de eleva&ccedil;&atilde;o a utilizar para calcular a viewshed.
            </p>
            <p>Caso a unidade vertical da superf&iacute;cie de entrada seja diferente da unidade horizontal, como num caso em que os valores de eleva&ccedil;&atilde;o s&atilde;o representados em p&eacute;s, mas o sistema de coordenadas &eacute; representado em metros, a superf&iacute;cie tem de ter um sistema de coordenadas vertical definido. A raz&atilde;o de ser disto &eacute; que a ferramenta utiliza as unidades vertical (Z) e horizontal (XY) para calcular um fator Z para a an&aacute;lise da viewshed. Sem um sistema de coordenadas vertical, e, portanto, sem quaisquer informa&ccedil;&otilde;es de unidade Z dispon&iacute;veis, a ferramenta assumir&aacute; que a unidade Z &eacute; igual &agrave; unidade XY. Esta situa&ccedil;&atilde;o resulta na utiliza&ccedil;&atilde;o de um fator Z interno de 1.0 para a an&aacute;lise, o que pode originar resultados inesperados.
            </p>
            <p>A superf&iacute;cie de eleva&ccedil;&atilde;o pode ser inteira ou ponto flutuante.
            </p>
        </div>
    </div>
    <div id="observerFeatures">
        <div><h2>Elementos pontos que representam pontos de observação</h2></div>
        <hr/>
        <div>
            <p>Os elementos de ponto que representam as localiza&ccedil;&otilde;es do observador ao calcular as viewsheds.
            </p>
        </div>
    </div>
    <div id="optimizeFor">
        <div><h2>Optimizar para</h2></div>
        <hr/>
        <div>
            <p>O m&eacute;todo de otimiza&ccedil;&atilde;o a utilizar para calcular a viewshed.
            </p>
            <ul>
                <li>Speed &mdash; 
Este m&eacute;todo otimiza a velocidade de processamento, abdicando de alguma precis&atilde;o no resultado em detrimento de um n&iacute;vel de desempenho superior. Isto &eacute; por omiss&atilde;o.

                </li>
                <li>Accuracy &mdash; 
Este m&eacute;todo &eacute; otimizado para a precis&atilde;o dos resultados, &agrave; custa de um tempo de processamento mais longo.

                </li>
            </ul>
        </div>
    </div>
    <div id="maximumDistance">
        <div><h2>Distância máxima de visualização</h2></div>
        <hr/>
        <div>
            <p>Introduza uma dist&acirc;ncia limite no local onde o c&aacute;lculo de &aacute;reas vis&iacute;veis ir&aacute; parar. Para al&eacute;m desta dist&acirc;ncia, n&atilde;o &eacute; poss&iacute;vel determinar se os pontos de observa&ccedil;&atilde;o e os outros objetos se veem mutuamente.
            </p>
            <p>&Eacute; poss&iacute;vel especificar um valor num&eacute;rico representando uma dist&acirc;ncia linear ou selecionar um campo num&eacute;rico a partir dos elementos do observador da entrada. Se for fornecido um campo, os valores contidos no campo t&ecirc;m que estar na mesma unidade que a unidade xy da superf&iacute;cie de eleva&ccedil;&atilde;o da entrada.
            </p>
            <p>Note que os valores elevados aumentam o tempo de c&aacute;lculo. A n&atilde;o ser que seja especificado, ser&aacute; calculada uma dist&acirc;ncia m&aacute;xima predefinida com base na resolu&ccedil;&atilde;o e na extens&atilde;o da superf&iacute;cie de eleva&ccedil;&atilde;o de entrada.
            </p>
            <p>Este par&acirc;metro &eacute; &uacute;til para modelar certos fen&oacute;menos. Por exemplo, ao limitar a extens&atilde;o da visibilidade, pode modelar condi&ccedil;&otilde;es meteorol&oacute;gicas, como um nevoeiro leve. Do mesmo modo, restringir a extens&atilde;o de visibilidade pode dar-lhe algum controlo sobre a hora do dia, aproximando o efeito de crep&uacute;sculo.
            </p>
        </div>
    </div>
    <div id="maximumDistanceField">
        <div><h2>Distância máxima de visualização</h2></div>
        <hr/>
        <div>
            
        </div>
    </div>
    <div id="minimumDistance">
        <div><h2>Distância mínima de visibilidade</h2></div>
        <hr/>
        <div>
            <p>Introduza uma dist&acirc;ncia onde para o in&iacute;cio do c&aacute;lculo de &aacute;reas vis&iacute;veis. As c&eacute;lulas &agrave; superf&iacute;cie que se encontrem mais perto do que esta dist&acirc;ncia n&atilde;o s&atilde;o vis&iacute;veis na sa&iacute;da, mas podem ainda bloquear a visibilidade das c&eacute;lulas entre a dist&acirc;ncia de visualiza&ccedil;&atilde;o m&iacute;nima e a m&aacute;xima.
            </p>
            <p>&Eacute; poss&iacute;vel especificar um valor num&eacute;rico representando uma dist&acirc;ncia linear ou selecionar um campo num&eacute;rico a partir dos elementos do observador da entrada. Se for fornecido um campo, os valores contidos no campo t&ecirc;m que estar na mesma unidade que a unidade xy da superf&iacute;cie de eleva&ccedil;&atilde;o da entrada.
            </p>
            <p>Este par&acirc;metro &eacute; &uacute;til para controlar a &aacute;rea de an&aacute;lise da viewshed a uma dist&acirc;ncia espec&iacute;fica do observador. Por exemplo, se estiver a avaliar a visibilidade a partir do topo de um edif&iacute;cio at&eacute; um parque distante, pode definir uma dist&acirc;ncia de visualiza&ccedil;&atilde;o m&iacute;nima para excluir as &aacute;reas pr&oacute;ximas que n&atilde;o forem de interesse e, desse modo, obter uma melhor velocidade de processamento.
            </p>
        </div>
    </div>
    <div id="minimumDistanceField">
        <div><h2>Distância mínima de visibilidade</h2></div>
        <hr/>
        <div>
            
        </div>
    </div>
    <div id="viewingDistance3D">
        <div><h2>Distância é 3D</h2></div>
        <hr/>
        <div>
            <p>Especifique se os par&acirc;metros m&iacute;nimo e m&aacute;ximo de dist&acirc;ncia de visualiza&ccedil;&atilde;o s&atilde;o medidos de modo tridimensional ou de um modo mais simples, bidimensional. Quando a op&ccedil;&atilde;o &eacute; marcada, as dist&acirc;ncias de visualiza&ccedil;&atilde;o s&atilde;o tratadas como dist&acirc;ncias 3D. Quando a op&ccedil;&atilde;o &eacute; desmarcada, s&atilde;o tratadas como dist&acirc;ncias 2D.
            </p> 
            <p>Uma dist&acirc;ncia 2D &eacute; a dist&acirc;ncia linear simples medida entre um observador e o alvo, recorrendo &agrave;s respetivas localiza&ccedil;&otilde;es projetadas ao n&iacute;vel do mar. Uma dist&acirc;ncia 3D proporciona um valor mais realista, j&aacute; que considera as respetivas alturas relativas.
            </p>  
        </div>
    </div>
    <div id="observersElevation">
        <div><h2>Elevação dos locais de observação</h2></div>
        <hr/>
        <div>
            <p>Introduza a eleva&ccedil;&atilde;o das suas localiza&ccedil;&otilde;es de observa&ccedil;&atilde;o.
            </p>
            <p>Pode especificar quer um valor num&eacute;rico que representa a eleva&ccedil;&atilde;o de todos os observadores, ou um campo que representa a eleva&ccedil;&atilde;o de todos os observadores. Caso seja fornecido um campo, o valor contido no campo tem de estar na mesma unidade que a unidade Z da superf&iacute;cie de eleva&ccedil;&atilde;o de entrada.
            </p>
        </div>
    </div>
    <div id="observersElevationField">
        <div><h2>Elevação dos locais de observação</h2></div>
        <hr/>
        <div>
            
        </div>
    </div>
    <div id="observersHeight">
        <div><h2>Altura dos observadores</h2></div>
        <hr/>
        <div>
            <p>Introduza a altura, acima do solo, das suas localiza&ccedil;&otilde;es de observa&ccedil;&atilde;o.
            </p> 
            <p>Pode especificar um valor num&eacute;rico para a altura ou um campo dos elementos de observa&ccedil;&atilde;o de entrada. Se for fornecido um campo, os valores contidos no campo t&ecirc;m que estar na mesma unidade que a unidade z da superf&iacute;cie de eleva&ccedil;&atilde;o da entrada.
            </p>
            <p>O valor padr&atilde;o &eacute; 6 p&eacute;s. Caso esteja &agrave; procura de uma localiza&ccedil;&atilde;o elevada, como uma torre de observa&ccedil;&atilde;o ou um edif&iacute;cio alto, utilize, ao inv&eacute;s. essa altura. No decurso do c&aacute;lculo da viewshed, este valor &eacute; adicionado &agrave; eleva&ccedil;&atilde;o do observador, caso seja especificada; caso contr&aacute;rio, &eacute; adicionada ao valor z da superf&iacute;cie interpolada.
            </p>
        </div>
    </div>
    <div id="observersHeightField">
        <div><h2>Altura dos observadores</h2></div>
        <hr/>
        <div>
            
        </div>
    </div>
    <div id="targetHeight">
        <div><h2>Altura do alvo</h2></div>
        <hr/>
        <div>
            <p>Introduza a altura de estruturas ou pessoas no solo utilizadas para estabelecer a visibilidade.
            </p>
            <p>Pode especificar um valor num&eacute;rico para a altura ou um campo dos elementos de observa&ccedil;&atilde;o de entrada. Se for fornecido um campo, os valores contidos no campo t&ecirc;m que estar na mesma unidade que a unidade z da superf&iacute;cie de eleva&ccedil;&atilde;o da entrada.
            </p>
            <p>A viewshed resultante identifica as &aacute;reas onde um ponto de observa&ccedil;&atilde;o pode ver estes objetos no solo. O inverso tamb&eacute;m &eacute; verdade; os objetos no solo podem ver o ponto de observa&ccedil;&atilde;o. 
            </p>
            <p>Em seguida, encontram-se alguns exemplos de defini&ccedil;&otilde;es de altura do alvo:
            </p>
            <ul>
                <li>Se os seus pontos introduzidos representam turbinas e&oacute;licas e pretende determinar a partir de onde as pessoas no solo conseguem visualiz&aacute;-las, introduza a altura m&eacute;dia de uma pessoa (aproximadamente 6 p&eacute;s).
                    

                </li>
                <li>Se os seus pontos introduzidos representam torres de controlo de inc&ecirc;ndios e pretende determinar que torres de controlo podem visualizar um pluma de fumo com 20 p&eacute;s ou mais de altura, introduza 20 p&eacute;s como valor de altura alvo.
                    

                </li>
                <li>Se os seus pontos introduzidos representam miradouros ao longo de algumas estradas ou caminhos e pretende determinar a partir de onde se consegue observar turbinas e&oacute;licas de 400 p&eacute;s ou mais de altura, introduza 400 p&eacute;s na altura.
                    

                </li>
                <li>Se os seus pontos introduzidos representam miradouros e pretende determinar a quantidade de &aacute;rea no solo que &eacute; poss&iacute;vel observar por algu&eacute;m situado no miradouro, introduza zero como altura alvo. 
                    

                </li>
            </ul>
            
        </div>
    </div>
    <div id="targetHeightField">
        <div><h2>Altura dos observadores</h2></div>
        <hr/>
        <div>
            
        </div>
    </div>
    <div id="resultAglLayer">
        <div><h2>A altura da saída a tornar visível</h2></div>
        <hr/>
        <div>
            <p>O resultado do nome da sa&iacute;da acima do n&iacute;vel do solo (above ground level - AGL). O resultado AGL &eacute; um raster em que o valor de cada c&eacute;lula corresponde &agrave; altura m&iacute;nima que tem de ser adicionada a uma c&eacute;lula, que de outro modo seria invis&iacute;vel, para a tornar vis&iacute;vel por parte de pelo menos um observador. &Agrave;s c&eacute;lulas que j&aacute; se encontravam vis&iacute;veis ser&aacute; atribu&iacute;do 0 a este raster de sa&iacute;da.
            </p>
        </div>
    </div>
    <div id="resultLayer">
        <div><h2>Nome da camada resultante</h2></div>
        <hr/>
        <div>
            <p>O nome da camada que ser&aacute; criada em  <b>O Meu Conte&uacute;do</b> e adicionada ao mapa. O nome padr&atilde;o &eacute; baseado no nome da ferramenta e do nome da camada de entrada. Se a camada j&aacute; existir, ser-lhe-&aacute; pedido que introduza outro nome.
            </p>
            <p>&Eacute; poss&iacute;vel especificar o nome de uma pasta em  <b>O Meu Conte&uacute;do</b>, onde o resultado ser&aacute; guardado utilizando a op&ccedil;&atilde;o <b>Guardar Resultado em</b> da caixa suspensa.
            </p>
        </div>
    </div>
</div>
</html>
