<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Detetar Objetos Utilizando Aprendizagem Profunda</h2><p/>
        <h2><img src="../images/GUID-EE76A33E-0B8F-48EE-94F8-782FAD241D72-web.png" alt="Detetar Objetos Utilizando Aprendizagem Profunda"></h2>
        <hr/>
    <p>Esta ferramenta executa um modelo treinado de aprendizagem profunda num raster de entrada para produzir uma classe de elementos que cont&eacute;m os objetos que encontra. Os elementos podem ser caixas delimitadoras ou pol&iacute;gonos em torno dos objetos encontrados ou pontos no centro dos objetos.
    </p>
    <p>Se  <b>Utilizar extens&atilde;o de mapa atual</b> estiver selecionada, somente a &aacute;rea do raster que &eacute; vis&iacute;vel dentro da extens&atilde;o de mapa atual ser&aacute; analisada. Se n&atilde;o estiver selecionada, todo o raster ser&aacute; analisado, mesmo se estiver fora da extens&atilde;o de mapa atual.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputRaster">
        <div><h2>Escolher imagem utilizada para detetar objetos</h2></div>
        <hr/>
        <div>
            <p>A imagem de entrada utilizada para detetar objetos.
            </p> 
        </div>
    </div>
    <div id="model">
        <div><h2>Escolher modelo de aprendizagem profunda utilizado para detetar objetos</h2></div>
        <hr/>
        <div>
            <p>O item do pacote ( <code>.dlpk</code>) de aprendizagem profunda de entrada.
            </p>
            <p>O pacote de aprendizagem profunda &eacute; composto pelo ficheiro JSON ( <code>.emd</code>) que define o modelo Esri, o ficheiro bin&aacute;rio da aprendizagem profunda e, opcionalmente, a fun&ccedil;&atilde;o raster em Python a ser utilizada.
            </p>
        </div>
    </div>
    <div id="modelArguments">
        <div><h2>Especificar argumentos do modelo de aprendizagem profunda</h2></div>
        <hr/>
        <div>
            <p>Os argumentos da fun&ccedil;&atilde;o s&atilde;o definidos na classe da fun&ccedil;&atilde;o raster em Python, referenciada pelo modelo de entrada. &Eacute; aqui que se listam os par&acirc;metros adicionais de aprendizagem profunda e argumentos para experi&ecirc;ncias e refinamentos, tal como um limite de confian&ccedil;a para ajustar a sensibilidade.
            </p>
            <p>Os nomes dos argumentos s&atilde;o preenchidos pela ferramenta ao ler o m&oacute;dulo Python no servidor da an&aacute;lise raster.
            </p>
        </div>
    </div>
    <div id="runNMS">
        <div><h2>Remover elementos duplicados da saída (opcional)</h2></div>
        <hr/>
        <div>
            <p>Executa supress&atilde;o n&atilde;o m&aacute;xima, onde objetos duplicados s&atilde;o identificados e o elemento duplicado com um menor valor de confian&ccedil;a &eacute; removido. 
                <ul>
                    <li>N&atilde;o selecionado&mdash;Todos os objetos que s&atilde;o detetados estar&atilde;o na classe de elementos de sa&iacute;da. Isto &eacute; por omiss&atilde;o.
                        

                    </li>
                    <li>Selecionado&mdash;Remove objetos duplicados que s&atilde;o detetados.
                        

                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="confidenceScoreField">
        <div><h2>Campo de avaliação da confiança</h2></div>
        <hr/>
        <div>
            <p>O campo no servi&ccedil;o de elementos que cont&eacute;m os resultados de confian&ccedil;a como sa&iacute;da pelo m&eacute;todo de dete&ccedil;&atilde;o de objeto.
            </p>
            <p>Este par&acirc;metro &eacute; requerido quando seleciona o par&acirc;metro  <b>Supress&atilde;o N&atilde;o M&aacute;xima</b>.
            </p>
        </div>
    </div>
    <div id="classValueField">
        <div><h2>Campo de valor de classe</h2></div>
        <hr/>
        <div>
            <p>O campo de valor de classe no servi&ccedil;o de elementos de sa&iacute;da. Se n&atilde;o for especificado, a ferramenta utilizar&aacute; os campos padr&atilde;o de valor de classe  <i>Classvalue</i> e <i>Value</i>. Se estes campos n&atilde;o existirem, todos os elementos ser&atilde;o tratados como a mesma classe de objetos.
            </p>
        </div>
    </div>
    <div id="maxOverlapRatio">
        <div><h2>Relação de sobreposição máxima</h2></div>
        <hr/>
        <div>
            <p>A rela&ccedil;&atilde;o de sobreposi&ccedil;&atilde;o m&aacute;xima para dois elementos sobrepostos, que &eacute; definida como a rela&ccedil;&atilde;o da &aacute;rea de interse&ccedil;&atilde;o sobre a &aacute;rea de uni&atilde;o. O padr&atilde;o &eacute; 0.
            </p>
        </div>
    </div>
    <div id="outputObjects">
        <div><h2>Nome da camada resultante</h2></div>
        <hr/>
        <div>
            <p>O nome da camada que ser&aacute; criada em  <b>O Meu Conte&uacute;do</b> e adicionada ao mapa. O nome padr&atilde;o &eacute; baseado no nome da ferramenta e do nome da camada de entrada. Se a camada j&aacute; existir, ser-lhe-&aacute; pedido que introduza outro nome.
            </p>
            <p>&Eacute; poss&iacute;vel especificar o nome de uma pasta em  <b>O Meu Conte&uacute;do</b>, onde o resultado ser&aacute; guardado utilizando a op&ccedil;&atilde;o <b>Guardar Resultado em</b> da caixa suspensa.
            </p>
        </div>
    </div>
</div>
</html>
