<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Juntar Camadas</h2><p/>
        <h2><img src="../images/GUID-BDDD6517-4EE7-4EEC-AE15-15DD9B709131-web.png" alt="Fundir Camadas"></h2>
        <hr/>
    <p>Esta ferramenta copia os elementos de duas camadas numa nova camada. As camadas a serem fundidas devem conter o mesmo tipo de geometria (pontos, linhas ou &aacute;reas). &Eacute; poss&iacute;vel controlar como os campos das camadas de entrada v&atilde;o ser unidos e copiados. Por exemplo:
        <ul>
            <li>Eu tenho tr&ecirc;s camadas para a Inglaterra, Gales e Esc&oacute;cia, e eu quero uma &uacute;nica camada da Gr&atilde;-Bretanha. 
            </li>
            <li>Eu tenho 12 camadas e cada uma cont&eacute;m informa&ccedil;&otilde;es parcelares de munic&iacute;pios cont&iacute;guos. Eu quero junt&aacute;-las numa &uacute;nica camada, mantendo apenas os campos que t&ecirc;m o mesmo nome e tipo nas 12 camadas iniciais.
            </li>
        </ul>
        
    </p>
    <p>Se a op&ccedil;&atilde;o <b>Utilizar a extens&atilde;o atual do mapa</b> estiver ativa, apenas os elementos que est&atilde;o visiv&eacute;is na atual extens&atilde;o do mapa ser&atilde;o fundidos. Se n&atilde;o estiver ativo, todos os elementos de ambas as camada ser&atilde;o fundidos, mesmo que estejam fora da atual extens&atilde;o do mapa.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Escolher camada</h2></div>
        <hr/>
        <div>
            <p>O ponto, linha ou elemento de camada a fundir com a camada especificada abaixo. 
            </p>
        </div>
    </div>
    <div id="MergeLayer">
        <div><h2>Escolher Camada para fundir</h2></div>
        <hr/>
        <div>
            <p>Escolher a camada para fundir com a primeira camada.
            </p>
        </div>
    </div>
    <div id="MergingAttributes">
        <div><h2>Modificar os campos fundidos</h2></div>
        <hr/>
        <div>
            <p>Por defeito, todos os campos de ambos os dados de entrada, ser&atilde;o mantidos no resultado final. &Eacute; poss&iacute;vel alterar a forma como os campos s&atilde;o apresentados no resultado final, da seguinte forma:
                <ul>
                    <li> <b>Renomear</b>&mdash;O campo ser&aacute; renomeado na sa&iacute;da.
                    </li>
                    <li> <b>Remover</b>&mdash;O campo ser&aacute; removido da sa&iacute;da.
                    </li>
                    <li> <b>Correspond&ecirc;ncia</b>&mdash;Os nomes de campo s&atilde;o feitos equivalentes.  Os valores dos campos da camada fundida ser&atilde;o copiados para oos campos do resultados final.
                    </li>
                </ul>
                
            </p>
            <p>Caso ambas as camadas contenham um campo com um nome e tipo de dados id&ecirc;nticos, o conte&uacute;do de ambos os campo ser&aacute; unido num campo com esse nome. Isto n&atilde;o se aplica a campos em que  <b>Corresponder</b> &eacute; utilizado no par&acirc;metro <b>Modificar campos de jun&ccedil;&atilde;o</b> .
            </p>
        </div>
    </div>
    <div id="OutputName">
        <div><h2>Nome da camada resultante</h2></div>
        <hr/>
        <div>
            <p>Este &eacute; o nome da camada que ser&aacute; criada em  <b>O Meu Conte&uacute;do</b> e adicionada ao mapa. O nome padr&atilde;o &eacute; baseado no nome da ferramenta e do nome da camada de entrada. Se o nome da camada j&aacute; existir, ser-lhe-&aacute; pedido que introduza outro nome.
            </p>
            <p>Ao utilizar o menu suspenso  <b>Guardar resultado em</b> pode definir o nome da pasta em <b>O Meu Conte&uacute;do</b> onde o resultado ser&aacute; guardado.
            </p>
        </div>
    </div>
</div>
</html>
