<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Sumuoti atributus</h2><p/>
        <h2><img src="../images/GUID-F64B533F-B0BB-4519-9F31-BCF814084999-web.png" alt="Diagrama Sumuoti atributus"></h2>
        <hr/>
    <p> &Scaron;is įrankis susumuoja visas sutampančias reik&scaron;mes į vieną ar daugiau laukų ir apskaičiuoja jų statistinius duomenis. Patys elementariausi statistiniai duomenys yra susumuotų elementų skaičius, bet galima apskaičiuoti ir sudėtingesnius statistinius duomenis.
    </p>
    <p>Pavyzdžiui, turite parduotuvių vietų ta&scaron;kinius elementus, atvaizduotus pagal lauką  <i>DISTRICT_MANAGER_NAME</i>,, ir norite susumuoti kavos pardavimus pagal vadovą. Galite nurodyti, kad lauke <i>DISTRICT_MANAGER_NAME</i> būtų suliejama, ir visos duomenų eilutės, simbolizuojančios atskirus vadovus, bus susumuotos. Tai rei&scaron;kia, kad visos parduotuvių vietos, kurioms vadovauja <pre>Manager1</pre>, bus susumuotos į vieną eilutę su apskaičiuotais suvestiniais statistiniais duomenimis. &Scaron;iame pavyzdyje bus apskaičiuoti tokie statistiniai duomenys, kaip parduotuvių skaičius ir visų parduotuvių, kurioms vadovauja <pre>Manager1</pre> bei visi kiti lauke <i>DISTRICT_MANAGER_NAME</i> nurodyti vadovai, <i>TOTAL_SALES</i> suma.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Pasirinkite sumuoti norimą įvestį</h2></div>
        <hr/>
        <div>
            <p>Sluoksnis, kuriame yra susumuoti ketinami laukai.  
            </p>
            <p>Galite ne tik nurodyti sluoksnį i&scaron; žemėlapio, bet ir apačioje pasirinkti  <b>Pasirinkti analizės sluoksnį</b>, kad galėtumėte turinyje ie&scaron;koti didelių duomenų rinkinio arba elemento sluoksnio.
            </p>
        </div>
    </div>
    <div id="fields">
        <div><h2>Pasirinkite, kaip sumuoti duomenis</h2></div>
        <hr/>
        <div>
            <p>Duomenis sumuoti galima dviem būdais:
                <ul>
                    <li> <b>Visi elementai į vieną elementą</b> &ndash; apskaičiuoja visų elementų statistiką.
                    </li>
                    <li> <b>Pagal laukus</b> &ndash; sugrupuoja elementus pagal pana&scaron;ias reik&scaron;mes nurodytuose laukuose.
                    </li>
                </ul>
                
            </p>
            <p>Tarkime, turėjote medžių duomenų rinkinį, kuris apėmė  <i>treetype</i> laukus su reik&scaron;mėmis <code>Maple</code>, <code>Fir</code> ir <code>Pine</code> bei lauką <i>treeheight</i>. Jūs norite apskaičiuoti vidutinę <i>treeheight</i> reik&scaron;mę. Jei visus elementus sumuosite į vieną elementą, gausite vidutinį visų medžių auk&scaron;tį, kuris bus pateiktas kaip viena vidutinė reik&scaron;mė. Jei sumavote pagal lauką <i>treeheight</i>, gausite atskirai klevų vidurkį, eglių vidurkį ir pu&scaron;ų vidurkį.
            </p>
        </div>
    </div>
    <div id="summaryFields">
        <div><h2>Pridėti statistiką (pasirinktinis nustatymas)</h2></div>
        <hr/>
        <div>
            <p> Galite apskaičiuoti susumuotų elementų statistiką. Galite skaičiuoti &scaron;iuos skaitinius laukus:
                <ul>
                    <li>Skaičius &ndash; apskaičiuojamas nenulinių reik&scaron;mių skaičius.Galima naudoti skaitiniams laukams arba eilutėms. [nulinis, 0, 2] skaičius yra 2.
                    </li>
                    <li>Suma &ndash; lauke nurodytų skaitinių reik&scaron;mių suma. [nulinis, 0, 3] suma yra 3.
                    </li>
                    <li>Vidurkis &ndash; skaitinių reik&scaron;mių vidurkis. [0, 2, nulinis] vidurkis yra 1.
                    </li>
                    <li>Minimumas &ndash; skaitinio lauko reik&scaron;mės minimumas. [0, 2, nulinis] minimumas yra 0. 
                    </li>
                    <li>Maksimumas &ndash; skaitinio lauko reik&scaron;mės maksimumas. [0, 2, nulinis] maksimumas yra 2.
                    </li>
                    <li>Intervalas  &ndash; skaitinio lauko intervalas. Apskaičiuojamas i&scaron; maksimalios reik&scaron;mės atėmus minimalią reik&scaron;mę. [0, nulinis, 1] intervalas yra 1. [nulinis, 4] intervalas yra 0.
                    </li>
                    <li>Nuokrypis &ndash; skaitinio laiko nuokrypis trajektorijoje. [1] nuokrypis yra nulinis. [nulinis, 1,0,1,1] nuokrypis yra 0,25.
                    </li>
                    <li>Standartinis nuokrypis &ndash; skaitinio laiko standartinė deviacija. [1] standartinis nuokrypis yra nulinis. [nulinis, 1,0,1,1] standartinis nuokrypis yra 0,5. 
                    </li>
                </ul>
                
            </p>
            <p>Galite skaičiuoti &scaron;iuos tekstinius laukus:
                <ul>
                    <li>Skaičius &ndash; nenulinių eilučių skaičius.
                    </li>
                    <li>Bet kokį rodiklį &ndash; &scaron;is statistinis rodiklis yra atsitiktinės eilutės reik&scaron;mės i&scaron; nurodyto lauko pavyzdys.
                    </li>
                </ul>
                Visi statistiniai rodikliai apskaičiuojami tik su nenulinėmis reik&scaron;mėmis. Gautame sluoksnyje bus kiekvieno apskaičiuoto statistinio rodiklio naujas laukas. Pasirenkant atributą ir statistinį rodiklį, gali būti pridėtas neribotas statistinių rodiklių kiekis. 
            </p>
        </div>
    </div>
    <div id="dataStore">
        <div><h2>Pasirinkti duomenų saugyklą</h2></div>
        <hr/>
        <div>
            <p>GeoAnalytics rezultatai yra saugomi ArcGIS duomenų saugykloje ir rodomi  Portal for ArcGIS kaip elementų sluoksnis. Daugeliu atvejų rezultatai turi būti saugomi erdvinių-laiko duomenų saugykloje, ir tai yra numatytasis nustatymas. Kai kuriais atvejais, galima rezultatus įra&scaron;yti į releacinę duomenų saugyklą. Toliau pateikiame priežastis, kodėl reikėtų rezultatus įra&scaron;yti į releacinių duomenų saugyklą: 
                <ul>
                    <li>Galite rezultatus naudoti dviejų portalų bendradarbiavime.
                    </li>
                    <li>Galite įjungti savo rezultatų sinchronizavimą.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Rezultatų sluoksnio pavadinimas</h2></div>
        <hr/>
        <div>
            <p> Pavadinimas sluoksnio, kuris bus sukurtas. Jei įra&scaron;ote į ArcGIS Data Store, jūsų rezultatai bus įra&scaron;yti į  <b>Turinį</b> ir įtraukti į žemėlapį. Jei įra&scaron;ote į didelių duomenų failo bendrinimą, jūsų rezultatai bus saugomi didelių duomenų failo bendrinime ir pridedami į jo deklaraciją. Jie nebus įtraukti į žemėlapį. Numatytasis pavadinimas sukuriamas pagal įrankio ir įvesties sluoksnio pavadinimus. Jei toks sluoksnis jau yra, įrankis neveiks.
            </p>
            <p>Kai ra&scaron;ote į   ArcGIS Data Store  (releacinių arba erdvėlaikinių didelių duomenų saugyklą) naudodami i&scaron;&scaron;okantįjį meniu  <b>Įra&scaron;yti rezultatą į</b>, galite nurodyti <b>Turinyje</b> esančio aplanko, kur bus įra&scaron;yti rezultatai, pavadinimą.
            </p>
        </div>
    </div>
</div>
</html>
