<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Agréger des points</h2><p/>
        <h2><img src="../images/GUID-6C1620D9-D176-41FA-8283-833D8B1CCCFC-web.png" alt="Agr&eacute;ger des points"></h2>
        <hr/>
    <p>Cet outil fonctionne avec une couche d'entit&eacute;s ponctuelles et une couche d'entit&eacute;s surfaciques.  Les entit&eacute;s surfaciques en entr&eacute;e peuvent provenir d'une couche surfacique ou il peut s'agir de groupes carr&eacute;s ou hexagonaux calcul&eacute;s lors de l'ex&eacute;cution de l'outil. L'outil commence par identifier les points qui se trouvent au sein de chaque surface sp&eacute;cifi&eacute;e. Apr&egrave;s avoir d&eacute;termin&eacute; cette relation spatiale des points au sein de la surface, des statistiques concernant tous les points de la surface sont calcul&eacute;es et affect&eacute;es &agrave; la surface. La statistique la plus &eacute;l&eacute;mentaire est le nombre total de points au sein de la surface, mais vous pouvez &eacute;galement en obtenir d'autres. 

    </p>
    <p>Supposons par exemple que des entit&eacute;s ponctuelles correspondent &agrave; l'emplacement des caf&eacute;s restaurants et que des entit&eacute;s surfaciques correspondent aux comt&eacute;s, et que vous souhaitez r&eacute;capituler la consommation de caf&eacute; par comt&eacute;. En admettant que les caf&eacute;s aient un attribut  <i>TOTAL_SALES</i>, vous pouvez calculer la somme de tous les attributs <i>TOTAL_SALES</i> au sein de chaque comt&eacute;, l'attribut <i>TOTAL_SALES</i> minimal ou maximal
 au sein de chaque comt&eacute; ou d'autres statistiques, telles que le total, la plage, l'&eacute;cart type et la variance.
    </p>
    <p>Cet outil fonctionne &eacute;galement avec les donn&eacute;es temporelles. Si le temps est activ&eacute; dans les points en entr&eacute;e, les options de tranche horaire sont disponibles. L'examen d'une tranche horaire sp&eacute;cifique vous permet de calculer la relation des points au sein de la surface. Vous pouvez par exemple examiner des intervalles horaires, qui entra&icirc;nent des sorties pour chaque heure. 
    </p>
    <p>Comme exemple temporel, supposons par exemple que vous ayez des entit&eacute;s ponctuelles de chaque transaction effectu&eacute;e dans diff&eacute;rents caf&eacute;s et aucune couche surfacique. Les donn&eacute;es ont &eacute;t&eacute; enregistr&eacute;es au cours d'une ann&eacute;e et chaque transaction poss&egrave;de un emplacement et un horodatage. En supposant que chaque transaction poss&egrave;de un attribut  <i>TOTAL_SALES</i>, vous pouvez calculer la somme de tous les attributs <i>TOTAL_SALES</i> au sein de l'espace et du temps qui vous int&eacute;ressent. Si ces transactions sont destin&eacute;es &agrave; une seule ville, nous pouvons g&eacute;n&eacute;rer des surfaces de grilles d'un kilom&egrave;tre et regarder les tranches horaires hebdomadaires pour synth&eacute;tiser les transactions &agrave; la fois dans l'espace et dans le temps.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="pointLayer">
        <div><h2>Choisissez une couche contenant les points à agréger en surfaces</h2></div>
        <hr/>
        <div>
            <p>La couche de points qui sera agr&eacute;g&eacute;e dans les surfaces. La r&eacute;f&eacute;rence spatiale de traitement des couches de points qui sont agr&eacute;g&eacute;es en groupes  <b>carr&eacute;s</b> ou <b>hexagonaux</b> doit &ecirc;tre d&eacute;finie sur un syst&egrave;me de coordonn&eacute;es projet&eacute;es &agrave; l'aide des <b>environnements d'analyse</b>.
            </p>
            <p>Outre le fait de choisir une couche de votre carte, vous pouvez s&eacute;lectionner  <b>Choose Analysis Layer (Choisir une couche d&rsquo;analyse)</b> au bas de la liste d&eacute;roulante pour parcourir votre contenu et rechercher une couche d&rsquo;entit&eacute;s ou un jeu de donn&eacute;es de partage de fichiers Big Data.
            </p>
        </div>
    </div>
    <div id="inputAggregation">
        <div><h2>Choisir une couche surfacique dans laquelle effectuer l'agrégation</h2></div>
        <hr/>
        <div>
            <p>Les surfaces dans lesquelles la couche de points sera agr&eacute;g&eacute;e. Vous avez le choix entre une couche surfacique que vous fournissez ou des groupes qui sont g&eacute;n&eacute;r&eacute;s lors de l'ex&eacute;cution de l'outil.   Lors de la g&eacute;n&eacute;ration des groupes, pour  <b>Carr&eacute;</b>, le nombre et les unit&eacute;s sp&eacute;cifi&eacute;s d&eacute;terminent la hauteur et la longueur du carr&eacute;. Pour <b>Hexagone</b>, le nombre et les unit&eacute;s sp&eacute;cifi&eacute;s d&eacute;terminent la distance entre les c&ocirc;t&eacute;s parall&egrave;les.
            </p>
            <p>L'analyse &agrave; l'aide de groupes  <b>carr&eacute;s</b> ou <b>hexagonaux</b> requiert un syst&egrave;me de coordonn&eacute;es projet&eacute;es. Vous pouvez d&eacute;finir le <b>syst&egrave;me de coordonn&eacute;es de traitement</b> dans <b>Environnements d'analyse</b>. Si votre syst&egrave;me de coordonn&eacute;es de traitement n&rsquo;est pas d&eacute;fini sur un syst&egrave;me de coordonn&eacute;es projet&eacute;es, vous &ecirc;tes invit&eacute; &agrave; le configurer lorsque vous lancez <b>Run analysis (Ex&eacute;cuter l&rsquo;analyse)</b> .
            </p>
        </div>
    </div>
    <div id="polygonLayer">
        <div><h2>Choisir la couche surfacique dans laquelle effectuer l'agrégation</h2></div>
        <hr/>
        <div>
            <p>La couche surfacique dans laquelle les points seront agr&eacute;g&eacute;s. Les points qui se trouvent au sein des limites des surfaces sur cette couche seront comptabilis&eacute;s et peuvent &ecirc;tre synth&eacute;tis&eacute;s avec les statistiques que vous avez choisies. 
            </p>
            <p>L&rsquo;option  <b>Bin Size (Taille du groupe)</b> pour les groupes ou <b>Area Layer (Couche surfacique)</b> doit &ecirc;tre d&eacute;finie.
            </p>
        </div>
    </div>
    <div id="inputBins">
        <div><h2>Choisir une distance pour générer les groupes et dans laquelle effectuer l'agrégation</h2></div>
        <hr/>
        <div>
            <p>La distance utilis&eacute;e pour g&eacute;n&eacute;rer les groupes o&ugrave; agr&eacute;ger vos points en entr&eacute;e. Pour un groupe carr&eacute;, la taille repr&eacute;sente la hauteur du carr&eacute;. Pour un hexagone, la taille repr&eacute;sente la hauteur de l'hexagone (&agrave; partir des c&ocirc;t&eacute;s parall&egrave;les).  
            </p>
            <p>L&rsquo;option  <b>Bin Size (Taille du groupe)</b> pour les groupes ou <b>Area Layer (Couche surfacique)</b> doit &ecirc;tre d&eacute;finie.
            </p>
        </div>
    </div>
    <div id="timeSlicing">
        <div><h2>Agréger à l'aide des intervalles temporels (facultatif)</h2></div>
        <hr/>
        <div>
            <p>Si le temps est activ&eacute; sur la couche ponctuelle en entr&eacute;e et qu'il est de type instantan&eacute;, vous pouvez effectuer l'analyse &agrave; l'aide des intervalles temporels. Vous pouvez d&eacute;finir trois param&egrave;tres lorsque vous utilisez le temps&nbsp;:
                <ul>
                    <li> <b>Intervalle temporel</b>
                    </li>
                    <li> <b>Fr&eacute;quence de r&eacute;p&eacute;tition de l'intervalle</b>
                    </li>
                    <li> <b>Heure sur laquelle aligner les intervalles temporels</b>
                    </li>
                </ul>
                
            </p>
            <p>Si, par exemple, vous avez des donn&eacute;es repr&eacute;sentant une ann&eacute;e et voulez les analyser selon un intervalle hebdomadaire, d&eacute;finissez  <b>Time step interval (Intervalle temporel)</b> sur <code>1&nbsp;week (1&nbsp;semaine)</code>. 
            </p>
            <p>Si, par exemple,  vous poss&eacute;dez des donn&eacute;es repr&eacute;sentant un an et voulez l&rsquo;analyser &agrave; l&rsquo;aide de la premi&egrave;re semaine du mois, d&eacute;finissez  <b>Time step interval (Intervalle temporel)</b> sur <code>1 week (1&nbsp;semaine)</code>, <b>How often to repeat the time step (Fr&eacute;quence de r&eacute;p&eacute;tition de l&rsquo;intervalle) (Fr&eacute;quence de r&eacute;p&eacute;tition de l&rsquo;intervalle)</b> sur <code>1 month (1 mois)</code> et <b>Time to align the time steps to (Heure sur laquelle aligner les intervalles temporels)</b> sur <code>January&nbsp;1, at 12:00&nbsp;am (1er&nbsp;janvier &agrave; 12&nbsp;h&nbsp;00)</code>.
            </p>
        </div>
    </div>
    <div id="timeInterval">
        <div><h2>Intervalle temporel</h2></div>
        <hr/>
        <div>
            <p>Intervalle de temps utilis&eacute; pour g&eacute;n&eacute;rer des intervalles temporels. Un   <b>intervalle temporel (Time step interval)</b> peut  &ecirc;tre utilis&eacute; seul ou  avec le param&egrave;tre <b>How often to repeat the time step (Fr&eacute;quence de r&eacute;p&eacute;tition de l&rsquo;intervalle) </b> ou <b>Time to align the time steps to</b> parameter (Heure sur laquelle aligner les intervalles temporels).
            </p>
            <p>Si, par exemple, vous voulez cr&eacute;er des intervalles qui ont lieu tous les lundis de 9&nbsp;h&nbsp;00 &agrave; 10&nbsp;h&nbsp;00, d&eacute;finissez  <b>Time step interval (Intervalle temporel)</b> sur <code>1 hour (1&nbsp;heure)</code>, <b>How often to repeat the time step (Fr&eacute;quence de r&eacute;p&eacute;tition de l&rsquo;intervalle)</b> sur <code>1&nbsp;week (1&nbsp;semaine)</code> et <b>Time to align the time steps to (Heure sur laquelle aligner les intervalles temporels)</b> sur <code>9:00:00&nbsp;a.m. on a Monday (9&nbsp;h&nbsp;00 un lundi)</code>.
            </p>
        </div>
    </div>
    <div id="timeStep">
        <div><h2>Fréquence de répétition de l'intervalle</h2></div>
        <hr/>
        <div>
            <p> Intervalle utilis&eacute; pour calculer un intervalle. Le param&egrave;tre <b>How often to repeat the time step (Fr&eacute;quence de r&eacute;p&eacute;tition de l&rsquo;intervalle)</b> peut &ecirc;tre utilis&eacute; seul ou avec <b>Time step interval (Intervalle temporel)</b>, avec <b>Reference Time (Heure de r&eacute;f&eacute;rence)</b>, ou avec &agrave; la fois <b>Time step interval (Intervalle temporel)</b> et <b>Time to align the time steps to (Heure sur laquelle aligner les intervalles temporels)</b>.
            </p>
            <p>Si,  par exemple,   vous voulez  cr&eacute;er des intervalles qui  ont   lieu tous les lundis de 9&nbsp;h&nbsp;00 &agrave; 10&nbsp;h&nbsp;00, d&eacute;finissez <b>Time step interval (Intervalle temporel) </b> sur <code>1 hour (1 heure)</code>, <b>How often to repeat the time step (Fr&eacute;quence de r&eacute;p&eacute;tition de l&rsquo;intervalle) </b> sur <code>1 week (1 semaine) </code>, et <b>Time to align the time steps to (Heure sur laquelle aligner les intervalles temporels) </b> sur <code>9:00:00 a.m. on a Monday (9&nbsp;h&nbsp;00 un lundi)</code>.
            </p>
        </div>
    </div>
    <div id="timeReference">
        <div><h2>Heure sur laquelle aligner les intervalles temporels</h2></div>
        <hr/>
        <div>
            <p>La date et l'heure utilis&eacute;es pour aligner les tranches horaires. Les intervalles temporels commencent &agrave; partir de cette heure et progressent vers le pass&eacute;. Si aucune heure de r&eacute;f&eacute;rence n'est s&eacute;lectionn&eacute;e, les intervalles temporels s'alignent sur le 1er&nbsp;janvier&nbsp;1970. 
            </p>
            <p> Si, par exemple, vous voulez cr&eacute;er des intervalles qui  ont lieu tous les lundis de 9&nbsp;h&nbsp;00 &agrave; 10&nbsp;h&nbsp;00, d&eacute;finissez <b>Time step interval (Intervalle temporel) </b> sur <code>1 hour (1&nbsp;heure)</code>, <b>How often to repeat the time step (Fr&eacute;quence de r&eacute;p&eacute;tition de l&rsquo;intervalle)</b> sur <code>1&nbsp;week (1&nbsp;semaine)</code>, et <b>Time to align the time steps to (Heure sur laquelle aligner les intervalles temporels) </b> sur <code>9:00:00&nbsp;a.m. on a Monday (9&nbsp;h&nbsp;00 un lundi).</code>.
            </p>
        </div>
    </div>
    <div id="summaryFields">
        <div><h2>Ajouter des statistiques (facultatif)</h2></div>
        <hr/>
        <div>
            <p> Vous pouvez calculer des statistiques sur des entit&eacute;s synth&eacute;tis&eacute;es. Dans les champs num&eacute;riques,  vous pouvez calculer ce qui suit&nbsp;:
                <ul>
                    <li>Count (Total)&nbsp;: calcule le nombre de valeurs non Null. Il peut &ecirc;tre utilis&eacute; sur des champs num&eacute;riques ou des cha&icirc;nes. Le total de [Null, 0, 2] est &eacute;gal &agrave; 2.
                    </li>
                    <li>Somme&nbsp;: somme des valeurs num&eacute;riques dans un champ. La somme de [Null, 0, 3] est &eacute;gale &agrave; 3.
                    </li>
                    <li>Moyenne&nbsp;: moyenne des valeurs num&eacute;riques. La moyenne de [0, 2, Null] est &eacute;gale &agrave; 1.
                    </li>
                    <li>Min&nbsp;: valeur minimale d'un champ num&eacute;rique. La valeur minimale de [0, 2, Null] est &eacute;gale &agrave; 0. 
                    </li>
                    <li>Max&nbsp;: valeur maximale d'un champ num&eacute;rique. La valeur maximale de [0, 2, Null] est &eacute;gale &agrave; 2.
                    </li>
                    <li>Plage&nbsp;: plage d'un champ num&eacute;rique. Elle est calcul&eacute;e pour correspondre aux valeurs minimales soustraites de la valeur maximale. La plage de [0, Null, 1] est &eacute;gale &agrave; 1. La plage de [Null, 4] est &eacute;gale &agrave; 0.
                    </li>
                    <li>Variance&nbsp;: variance d'un champ num&eacute;rique dans une piste. La variance de [1] est la valeur Null. La variance de [null, 1,0,1,1] est &eacute;gale &agrave; 0,25.
                    </li>
                    <li>Ecart type&nbsp;: &eacute;cart type d'un champ num&eacute;rique. L'&eacute;cart type de [1] est la valeur Null. L&rsquo;&eacute;cart type de [null, 1,0,1,1] est &eacute;gale &agrave; 0,5. 
                    </li>
                </ul>
                
            </p>
            <p>Dans les champs de type cha&icirc;ne,  vous pouvez calculer ce qui suit&nbsp;:
                <ul>
                    <li>Total&nbsp;: le nombre de cha&icirc;nes diff&eacute;rentes de la valeur Null.
                    </li>
                    <li>Tout&nbsp;: cette statistique est un &eacute;chantillon al&eacute;atoire d'une valeur de cha&icirc;ne dans le champ sp&eacute;cifi&eacute;.
                    </li>
                </ul>
                Toutes les statistiques sont calcul&eacute;es sur des valeurs non nulles. La couche obtenue contient un nouveau champ pour chaque statistique calcul&eacute;e. Vous pouvez ajouter des statistiques en choisissant un attribut et une statistique. 
            </p>
        </div>
    </div>
    <div id="spatialReference">
        <div><h2>Référence spatiale (wkid)</h2></div>
        <hr/>
        <div>
            <p>Il s'agit d'un param&egrave;tre temporaire de la version pr&eacute;liminaire qui permet de d&eacute;finir la r&eacute;f&eacute;rence spatiale de traitement. De nombreux outils Big Data n&eacute;cessitent l'utilisation d'un syst&egrave;me de coordonn&eacute;es projet&eacute;es comme r&eacute;f&eacute;rence spatiale pour le traitement. Par d&eacute;faut, l'outil utilise le syst&egrave;me de coordonn&eacute;es en entr&eacute;e, mais &eacute;choue s'il s'agit d'un syst&egrave;me de coordonn&eacute;es g&eacute;ographiques. Pour d&eacute;finir un syst&egrave;me de coordonn&eacute;es projet&eacute;es, saisissez le WKID. Par exemple,  <b>Web Mercator</b> est saisi sous la forme <code>3857</code>.
            </p>
        </div>
    </div>
    <div id="dataStore">
        <div><h2>Choisir une instance ArcGIS Data Store dans laquelle enregistrer les résultats</h2></div>
        <hr/>
        <div>
            <p>Les r&eacute;sultats de g&eacute;oanalyse sont stock&eacute;s dans un r&eacute;pertoire de donn&eacute;es et s&rsquo;affichent en tant que couche d&rsquo;entit&eacute;s dans  Portal for ArcGIS. Dans la plupart des cas, les r&eacute;sultats doivent &ecirc;tre stock&eacute;s dans le stockage des donn&eacute;es spatio-temporelles, ce qui est le param&egrave;tre par d&eacute;faut. Dans certains cas, il peut &ecirc;tre judicieux d&rsquo;enregistrer les r&eacute;sultats dans un data store relationnel. Voici les raisons pour lesquelles stocker les r&eacute;sultats dans le data store relationnel&nbsp;: 
                <ul>
                    <li>Vous pouvez utiliser les r&eacute;sultats en mode de collaboration de portail &agrave; portail.
                    </li>
                    <li>Vous pouvez activer la synchronisation de vos r&eacute;sultats.
                    </li>
                </ul>
                
            </p>
            <p>Vous ne devez pas utiliser le data store relationnel&nbsp;si vous pensez que vos r&eacute;sultats GeoAnalytics vont augmenter et que vous devez tirer parti des fonctionnalit&eacute;s du le data store Big Data spatio-temporel pour g&eacute;rer les grands volumes de donn&eacute;es.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nom de la couche de résultat</h2></div>
        <hr/>
        <div>
            <p> Nom de la couche &agrave; cr&eacute;er. Si vous &eacute;crivez sur une instance ArcGIS Data Store, les r&eacute;sultats seront enregistr&eacute;s dans  <b>My Content (Mon contenu)</b> et ajout&eacute;s &agrave; la carte. Si vous &eacute;crivez sur un partage de fichiers Big Data, les r&eacute;sultats seront enregistr&eacute;s dans le partage de fichiers Big Data et ajout&eacute;s &agrave; son manifeste. Il ne sera pas ajout&eacute; &agrave; la carte. Le nom par d&eacute;faut repose sur le nom de l'outil et sur le nom de la couche en entr&eacute;e. Si la couche existe d&eacute;j&agrave;, l'outil &eacute;choue.
            </p>
            <p>Lors de l&rsquo;&eacute;criture sur  ArcGIS Data Store (r&eacute;pertoire de donn&eacute;es relationnelles ou spatio-temporelles) via la zone de liste d&eacute;roulante  <b>Save result in (Enregistrer le r&eacute;sultat dans)</b>, vous pouvez sp&eacute;cifier le nom d&rsquo;un dossier dans <b>My Content (Mon contenu)</b> o&ugrave; le r&eacute;sultat sera enregistr&eacute;.
            </p>
        </div>
    </div>
</div>
</html>
