<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="smallsize">
        <h2>Paramètres de l'environnement d'analyse du portail</h2><p/>
        <h2></h2>
        <hr/>
    <p>  Param&egrave;tres d&rsquo;environnement pour l&rsquo;analyse dans Portal for ArcGIS et  ArcGIS Online. 
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="overwriteResult">
        <div><h2>Remplacer la couche de résultat</h2></div>
        <hr/>
        <div>
            
            <p>Sp&eacute;cifie s&rsquo;il faut remplacer les couches existantes. Lorsque cette option est s&eacute;lectionn&eacute;e, s'il existe une couche du m&ecirc;me nom dans votre contenu, elle sera remplac&eacute;e.
            </p>
            <p>
                <ul>
                    <li>Coch&eacute;e&nbsp;: s'il existe une couche du m&ecirc;me nom dans votre contenu, elle sera remplac&eacute;e. La sortie pr&eacute;sentera le m&ecirc;me syst&egrave;me de coordonn&eacute;es que les donn&eacute;es en entr&eacute;e.
                    </li>
                    <li>Non coch&eacute;e&nbsp;: si le nom de la couche de r&eacute;sultat existe d&eacute;j&agrave;, une erreur se produit et la couche de r&eacute;sultat doit &ecirc;tre renomm&eacute;e pour que l&rsquo;outil puisse &ecirc;tre ex&eacute;cut&eacute;. Il s&rsquo;agit de l&rsquo;option par d&eacute;faut.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="closeAnalysisWidget">
        <div><h2>Fermer le widget d'analyse après l'exécution de l'analyse</h2></div>
        <hr/>
        <div>
            <p>Sp&eacute;cifie si la bo&icirc;te de dialogue d&rsquo;analyse reste ouverte et activ&eacute;e pendant l&rsquo;ex&eacute;cution de l&rsquo;outil. Ce param&egrave;tre permet de modifier vos param&egrave;tres d&rsquo;analyse alors que l&rsquo;analyse pr&eacute;c&eacute;dente se poursuit. L&rsquo;analyse est un processus it&eacute;ratif et en gardant la bo&icirc;te de dialogue de l&rsquo;outil ouverte, vous pouvez modifier les param&egrave;tres et ex&eacute;cuter une nouvelle fois l&rsquo;analyse.
            </p>
            <p>
                <ul>
                    <li>Coch&eacute;e&nbsp;: la bo&icirc;te de dialogue de l&rsquo;outil d&rsquo;analyse se ferme et vous &ecirc;tes redirig&eacute; vers la table des mati&egrave;res. Il s'agit du param&egrave;tre par d&eacute;faut.
                    </li>
                    <li>Non coch&eacute;e&nbsp;: la bo&icirc;te de dialogue de l&rsquo;outil d&rsquo;analyse reste ouverte et activ&eacute;e.   
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="storeAnalysisResults">
        <div><h2>Stocker les résultats de l'analyse en tant que couches d'entités hébergées</h2></div>
        <hr/>
        <div>
            
            <p>Indique si la couche de r&eacute;sultats cr&eacute;&eacute;e &agrave; partir de votre analyse sera une couche d&rsquo;entit&eacute;s h&eacute;berg&eacute;es ou une collecte d&rsquo;entit&eacute;s. 
            </p>
            <p>
                <ul>
                    <li>Coch&eacute;e&nbsp;: les r&eacute;sultats de votre analyse g&eacute;n&eacute;reront une couche d&rsquo;entit&eacute;s h&eacute;berg&eacute;es, et un &eacute;l&eacute;ment sera cr&eacute;&eacute; dans votre contenu. Il s&rsquo;agit de l&rsquo;option par d&eacute;faut.
                    </li>
                    <li>Non coch&eacute;e&nbsp;: les r&eacute;sultats de votre analyse vont g&eacute;n&eacute;rer une collecte d'entit&eacute;s.     
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="outputCoordinateSystem">
        <div><h2>Système de coordonnées en sortie</h2></div>
        <hr/>
        <div>
            <p>Sp&eacute;cifie le syst&egrave;me de coordonn&eacute;es de la couche de r&eacute;sultats pour l&rsquo;analyse raster.    
            </p>
            <p>
                <ul>
                    <li> <b>Identique &agrave; l'entr&eacute;e</b>&nbsp;: le r&eacute;sultat de votre analyse appara&icirc;tra dans le m&ecirc;me syst&egrave;me de coordonn&eacute;es que les donn&eacute;es en entr&eacute;e. Il s&rsquo;agit de l&rsquo;option par d&eacute;faut.
                    </li>
                    <li> <b>As specified (Comme sp&eacute;cifi&eacute;)</b>&nbsp;: les r&eacute;sultats de votre analyse appara&icirc;tront dans le syst&egrave;me de coordonn&eacute;es que vous choisissez. Lorsque cette option est s&eacute;lectionn&eacute;e, cliquez sur le bouton repr&eacute;sentant le globe et choisissez un &eacute;l&eacute;ment dans la liste des syst&egrave;mes de coordonn&eacute;es connus ou ajoutez le WKID de r&eacute;f&eacute;rence spatiale dans la zone appropri&eacute;e.
                    </li>
                    <li> <b>Layer &lt;name&gt; (Couche &lt;nom&gt;)</b>&nbsp;: les r&eacute;sultats de votre analyse appara&icirc;tront dans le m&ecirc;me syst&egrave;me de coordonn&eacute;es que toute couche existante choisie dans votre carte web.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="processingCoordinateSystem">
        <div><h2>Traitement du système de coordonnées</h2></div>
        <hr/>
        <div>
            <p>Sp&eacute;cifie le syst&egrave;me de coordonn&eacute;es que l&rsquo;analyse utilisera pendant l&rsquo;ex&eacute;cution de la g&eacute;oanalyse.   
            </p>
            <p>Pour la g&eacute;oanalyse, certaines analyses exigent que le traitement soit ex&eacute;cut&eacute; dans un syst&egrave;me de coordonn&eacute;es projet&eacute;es.   Tous les outils ayant classifi&eacute; des donn&eacute;es ou des unit&eacute;s lin&eacute;aires n&eacute;cessite un syst&egrave;me de coordonn&eacute;es projet&eacute;es. 
            </p>
            <p>
                <ul>
                    <li> <b>Identique &agrave; l'entr&eacute;e</b>&nbsp;: votre analyse sera trait&eacute;e dans le m&ecirc;me syst&egrave;me de coordonn&eacute;es que les donn&eacute;es en entr&eacute;e. Il s&rsquo;agit de l&rsquo;option par d&eacute;faut.
                    </li>
                    <li> <b>As specified (Comme sp&eacute;cifi&eacute;)</b>&nbsp;: votre analyse appara&icirc;tra dans le syst&egrave;me de coordonn&eacute;es que vous choisissez. Lorsque cette option est s&eacute;lectionn&eacute;e, cliquez sur le bouton repr&eacute;sentant le globe et choisissez un &eacute;l&eacute;ment dans la liste des syst&egrave;mes de coordonn&eacute;es projet&eacute;es ou ajoutez le WKID de r&eacute;f&eacute;rence spatiale dans la zone appropri&eacute;e.
                    </li>
                    <li> <b>Layer &lt;name&gt; (Couche &lt;nom&gt;)</b>&nbsp;: votre analyse appara&icirc;tra dans le m&ecirc;me syst&egrave;me de coordonn&eacute;es que toute couche existante choisie dans votre carte web.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="processingExtent">
        <div><h2>Etendue</h2></div>
        <hr/>
        <div>
            <p>Indique l&rsquo;&eacute;tendue ou la limite utilis&eacute;e pendant l&rsquo;ex&eacute;cution de l&rsquo;analyse. Toutes les entit&eacute;s en entr&eacute;e se trouvant int&eacute;gralement dans l'&eacute;tendue sp&eacute;cifi&eacute;e ou qui intersectent cette derni&egrave;re seront utilis&eacute;es dans l'analyse.
            </p>
            <p>
                <ul>
                    <li> <b>Default (Par d&eacute;faut)</b>&nbsp;: &eacute;tendue fournie par l&rsquo;outil.
                    </li>
                    <li> <b>As specified (Comme sp&eacute;cifi&eacute;)</b>&nbsp;: l&rsquo;&eacute;tendue est d&eacute;finie par les coordonn&eacute;es que vous avez fournies.
                    </li>
                    <li> <b>Layer &lt;name&gt; (Couche &lt;nom&gt;)</b>&nbsp;: l&rsquo;&eacute;tendue utilis&eacute;e pour traiter votre analyse sera identique &agrave; l&rsquo;&eacute;tendue spatiale d&rsquo;une couche existante que vous avez choisie dans votre carte web. 
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="snapRaster">
        <div><h2>Raster de capture</h2></div>
        <hr/>
        <div>
            <p>Ajuste l&rsquo;&eacute;tendue de la couche raster en sortie afin qu&rsquo;elle corresponde &agrave; l&rsquo;alignement des cellules de la couche  <b>Snap Raster</b> sp&eacute;cifi&eacute;e dans l&rsquo;analyse raster.
            </p>
        </div>
    </div>
    <div id="cellSize">
        <div><h2>Taille de cellule</h2></div>
        <hr/>
        <div>
            <p>Sp&eacute;cifie la taille de cellule ou la r&eacute;solution qui sera utilis&eacute;e pour cr&eacute;er la couche raster en sortie dans l&rsquo;analyse raster. La r&eacute;solution en sortie par d&eacute;faut est d&eacute;termin&eacute;e par la taille de cellule la plus importante dans la couche raster en entr&eacute;e.
            </p>
            <p>
                <ul>
                    <li> <b>Minimum d&rsquo;entr&eacute;es</b>&nbsp;: utilise la plus petite taille de cellule de toutes les couches en entr&eacute;e.
                    </li>
                    <li> <b>Maximum d&rsquo;entr&eacute;es</b>&nbsp;: utilise la plus grande taille de cellule de toutes les couches en entr&eacute;e. Il s&rsquo;agit de l&rsquo;option par d&eacute;faut.
                    </li>
                    <li> <b>Comme sp&eacute;cifi&eacute;</b>&nbsp;: indique une valeur num&eacute;rique pour d&eacute;finir la taille de cellule. Si cette option est s&eacute;lectionn&eacute;e, la valeur par d&eacute;faut est&nbsp;1.
                    </li>
                    <li> <b>&lt;Nom&gt;</b> de la couche&nbsp;: d&eacute;finit la taille de cellule sur la couche raster choisie.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="mask">
        <div><h2>Masque</h2></div>
        <hr/>
        <div>
            <p>Sp&eacute;cifie une couche qui permettra de d&eacute;finir votre zone d&rsquo;int&eacute;r&ecirc;t dans l&rsquo;analyse raster. Seules les cellules comprises dans le masque d'analyse seront prises en compte lors de l'analyse.
            </p>
            <ul>
                <li>Le masque peut &ecirc;tre un raster ou une couche d'entit&eacute;s.
                </li>
                <li>Si le masque d'analyse est un raster, toutes les cellules ayant une valeur sont prises en compte pour d&eacute;finir le masque. Les cellules d'un raster de masque de type NoData seront consid&eacute;r&eacute;es comme &eacute;tant en dehors du masque et auront donc une valeur NoData dans la couche de r&eacute;sultat d'analyse. 
                </li>
                <li>Si le masque d'analyse est une couche d'entit&eacute;s, il est converti en interne en raster lors de l'ex&eacute;cution. Vous devez donc vous assurer que les options  <b>Cell Size (Taille de cellule)</b> et <b>Snap Raster (Raster de capture)</b> sont correctement param&eacute;tr&eacute;s pour votre analyse.
                </li>
            </ul>
             
        </div>
    </div>
    <div id="dataStore">
        <div><h2>Magasin de données</h2></div>
        <hr/>
        <div>
            <p>Les r&eacute;sultats de la g&eacute;oanalyse sont stock&eacute;s dans une instance  ArcGIS Data Store et s&rsquo;affichent en tant que couche d&rsquo;entit&eacute;s dans  Portal for ArcGIS ou dans un partage de fichiers Big Data configur&eacute;. 
            </p>
            <p>Lorsque vous conservez un r&eacute;sultat dans  ArcGIS Data Store, les r&eacute;sultats doivent figurer, dans la plupart des cas, dans le r&eacute;pertoire de donn&eacute;es spatio-temporelles. Il s'agit de l'option par d&eacute;faut. Voici les raisons pour lesquelles stocker les r&eacute;sultats dans un stockage des donn&eacute;es relationnelles&nbsp;: 
                <ul>
                    <li>Utiliser vos r&eacute;sultats dans une collaboration de portail &agrave; portail
                    </li>
                    <li>Permettre la synchronisation de vos r&eacute;sultats
                    </li>
                </ul>
                
            </p>
            <p>Vous ne devez pas utiliser un stockage des donn&eacute;es relationnelles si vous pensez que vos r&eacute;sultats GeoAnalytics vont augmenter et que vous souhaitez tirer part des fonctionnalit&eacute;s du stockage de Big Data spatio-temporelles pour g&eacute;rer les grands volumes de donn&eacute;es. 
            </p>
        </div>
    </div>
    <div id="parallelProcessingFactor">
        <div><h2>Facteur de traitement parallèle</h2></div>
        <hr/>
        <div>
            <p>R&eacute;partit l&rsquo;analyse sur plusieurs instances du service de traitement raster. 
            </p>
            <p>Les outils qui respectent l&rsquo;environnement  <b>Parallel processing factor (Facteur de traitement parall&egrave;le)</b> permettent de contr&ocirc;ler le nombre d&rsquo;instances du service de traitement raster pouvant &ecirc;tre utilis&eacute;s en vue du traitement des donn&eacute;es.
            </p>
            <p>Si l&rsquo;outil ne respecte pas le  <b>type de processeur (Processor type)</b> ou si l&rsquo;environnement <b>Processor type (Type de processeur)</b> est d&eacute;fini sur <b>CPU</b>, l&rsquo;environnement <b>Parallel processing factor (Facteur de traitement parall&egrave;le)</b> contr&ocirc;le les instances de service (CPU) de traitement raster. Si <b>Processor type (Type de processeur)</b> est d&eacute;fini sur <b>GPU</b>, l&rsquo;environnement <b>Parallel processing factor (Facteur de traitement parall&egrave;le)</b> contr&ocirc;le le nombre d&rsquo;instances GPU de traitement raster.
            </p> 
            <p>En configurant l&rsquo;environnement  <b>Parallel processing factor (Facteur de traitement parall&egrave;le)</b>, vous pouvez demander le nombre de processus parall&egrave;les que le serveur d&rsquo;imagerie d&rsquo;analyse raster utilise pour traiter une t&acirc;che d&rsquo;analyse raster. En revanche, si le nombre total de processus parall&egrave;les d&eacute;passe le nombre maximum d&rsquo;instances de service (CPU or GPU) de traitement raster, les processus parall&egrave;les suppl&eacute;mentaires seront mis en attente.
            </p>
            <p>Si le  <b>facteur de traitement parall&egrave;le</b> n&rsquo;est pas sp&eacute;cifi&eacute; (option par d&eacute;faut), l&rsquo;outil utilisera 80&nbsp;pour cent du nombre maximum d&rsquo;instances de service de traitement parall&egrave;le. Un nombre entier ou un pourcentage peut &ecirc;tre sp&eacute;cifi&eacute; en tant que facteur de traitement parall&egrave;le.
            </p>
        </div>
    </div>
    <div id="processorType">
        <div><h2>Type de processeur</h2></div>
        <hr/>
        <div>
            <p>Les outils qui respectent l&rsquo;environnement  <b>Processor type (Type de processeur)</b> permet de choisir l&rsquo;emplacement et la mani&egrave;re de traiter vos donn&eacute;es. Vous pouvez traiter vos donn&eacute;es &agrave; l&rsquo;aide de l&rsquo;unit&eacute; de traitement centrale de l&rsquo;ordinateur (CPU) ou de l&rsquo;unit&eacute; de traitement graphique (GPU) du serveur. Si l&rsquo;environnement <b>Processor type (Type de processeur)</b> est vide, l&rsquo;outil utilise le CPU pour traiter les donn&eacute;es. Il s&rsquo;agit de l&rsquo;option par d&eacute;faut.
            </p> 
            <p>Le traitement CPU peut &ecirc;tre parall&eacute;lis&eacute; sur plusieurs c&oelig;urs et instances, comme avec l&rsquo;environnement  <b>Parallel processing factor (Facteur de traitement parall&egrave;le)</b>.
            </p>
            <p>Les GPU sont efficaces pour traiter les graphiques et les images. Leur structure hautement parall&egrave;les leur permet de traiter efficacement des blocs de donn&eacute;es volumineux de mani&egrave;re r&eacute;p&eacute;titive. Les outils d&rsquo;analyse raster qui respectent cet environnement peuvent distribuer leur travail sur plusieurs instances GPU au niveau de plusieurs serveurs d&rsquo;analyse raster, comme avec l&rsquo;environnement  <b>Parallel processing factor (Facteur de traitement parall&egrave;le)</b>.
            </p>
            <p>
                <ul>
                    <li> <b>GPU (Unit&eacute; de traitement graphique)</b>&nbsp;: les donn&eacute;es seront trait&eacute;es &agrave; l&rsquo;aide de l&rsquo;unit&eacute; de traitement graphique.
                    </li>
                    <li> <b>CPU (Unit&eacute; de traitement centrale)</b>&nbsp;: les donn&eacute;es seront trait&eacute;es &agrave; l&rsquo;aide de l&rsquo;unit&eacute; de traitement centrale de l&rsquo;ordinateur.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
</div>
</html>
