<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Calculer la densité</h2><p/>
        <h2><img src="../images/GUID-38AD3C19-0400-4E5A-9282-BDE42F2BBFC1-web.png" alt="Calculer la densit&eacute;"></h2>
        <hr/>
    <p>L'outil Calculer la densit&eacute; cr&eacute;e une carte de densit&eacute; &agrave; partir d'entit&eacute;s ponctuelles en r&eacute;partissant des quantit&eacute;s connues de certains ph&eacute;nom&egrave;nes (repr&eacute;sent&eacute;s sous forme d'attributs des points) sur la carte. Il en r&eacute;sulte une couche de surfaces class&eacute;es des moins denses aux plus denses.   

    </p>
    <p>Pour le point en entr&eacute;e, chaque point doit repr&eacute;senter l&rsquo;emplacement d&rsquo;un &eacute;v&eacute;nement ou incident, et la couche de r&eacute;sultat repr&eacute;sente un nombre d&rsquo;incidents par zone unitaire. Une valeur de densit&eacute; sup&eacute;rieure dans un nouvel emplacement indique qu&rsquo;il existe plus de points &agrave; proximit&eacute; de cet emplacement. Dans de nombreux cas, la couche de r&eacute;sultat peut &ecirc;tre interpr&eacute;t&eacute;e comme une zone &agrave; risque pour des &eacute;v&eacute;nements futurs. Par exemple, si les points en entr&eacute;e repr&eacute;sentent les emplacements d'&eacute;clairs, la couche de r&eacute;sultat peut &ecirc;tre interpr&eacute;t&eacute;e comme une zone &agrave; risque pour les &eacute;clairs &agrave; venir.
    </p>
    <p>Voici les autres cas d'utilisation de cet outil :
        <ul>
            <li>Cr&eacute;ation de cartes de densit&eacute; criminelle afin d&rsquo;aider les services de police &agrave; allouer convenablement les ressources sur les zones &agrave; forte criminalit&eacute;.
            </li>
            <li>Calcul des densit&eacute;s des h&ocirc;pitaux au sein d'un comt&eacute;. La couche de r&eacute;sultat affiche les zones dont l'accessibilit&eacute; aux h&ocirc;pitaux est &eacute;lev&eacute;e ou faible et ces informations peuvent servir &agrave; choisir o&ugrave; implanter de nouveaux h&ocirc;pitaux.
            </li>
            <li>Identification des zones pr&eacute;sentant de forts risques d'incendies forestiers en fonction des emplacements historiques des incendies forestiers.
            </li>
            <li>Localisation des communaut&eacute;s qui se trouvent &agrave; l'&eacute;cart des principaux axes routiers en vue de planifier la construction de nouvelles routes.
            </li>
        </ul>
        
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Choisir une couche de points à partir de laquelle calculer la densité</h2></div>
        <hr/>
        <div>
            <p>La couche de points sur laquelle la densit&eacute; est calcul&eacute;e.
            </p>
            <p>Outre le fait de choisir une couche de votre carte, vous pouvez s&eacute;lectionner  <b>Choose Analysis Layer (Choisir une couche d&rsquo;analyse)</b> au bas de la liste d&eacute;roulante pour parcourir votre contenu et rechercher une couche d&rsquo;entit&eacute;s ou un jeu de donn&eacute;es de partage de fichiers Big Data.
            </p>
        </div>
    </div>
    <div id="fields">
        <div><h2>Choisir un ou plusieurs champs sur lesquels calculer la densité (facultatif)</h2></div>
        <hr/>
        <div>
            <p>Fournissez un ou plusieurs champs sp&eacute;cifiant le nombre d&rsquo;incidents &agrave; chaque emplacement. Par exemple, si des points repr&eacute;sentent des villes, vous pouvez utiliser un champ repr&eacute;sentant la population de la ville sous forme de champ de nombre. La couche de densit&eacute; de la population r&eacute;sultant calcule alors les densit&eacute;s de population sup&eacute;rieures &agrave; proximit&eacute; des villes dont la population est plus &eacute;lev&eacute;e.
            </p>
            <p>La densit&eacute; du nombre de points est toujours calcul&eacute;e. Si aucun champ n&rsquo;est s&eacute;lectionn&eacute;, chaque emplacement est cens&eacute; repr&eacute;senter un seul nombre.
            </p>
        </div>
    </div>
    <div id="binType">
        <div><h2>Choisir une forme de groupe</h2></div>
        <hr/>
        <div>
            <p>La forme des groupes dans lesquels les points sont agr&eacute;g&eacute;s et utilis&eacute;s pour le calcul de la densit&eacute;.
            </p>
            <p>L'analyse &agrave; l'aide de groupes  <b>carr&eacute;s</b> ou <b>hexagonaux</b> requiert un syst&egrave;me de coordonn&eacute;es projet&eacute;es. Vous pouvez d&eacute;finir le <b>syst&egrave;me de coordonn&eacute;es de traitement</b> dans <b>Environnements d'analyse</b>. Si votre syst&egrave;me de coordonn&eacute;es de traitement n&rsquo;est pas d&eacute;fini sur un syst&egrave;me de coordonn&eacute;es projet&eacute;es, vous &ecirc;tes invit&eacute; &agrave; le configurer lorsque vous lancez <b>Run analysis (Ex&eacute;cuter l&rsquo;analyse)</b> .
            </p>
        </div>
    </div>
    <div id="binSizing">
        <div><h2>Sélectionner la taille du groupe pour l'agrégation</h2></div>
        <hr/>
        <div>
            <p>La taille des groupes g&eacute;n&eacute;r&eacute;s. Pour un groupe carr&eacute;, la taille repr&eacute;sente la hauteur du carr&eacute;. Pour un hexagone, la taille repr&eacute;sente la hauteur de l&rsquo;hexagone (&agrave; partir des c&ocirc;t&eacute;s parall&egrave;les).
            </p>
        </div>
    </div>
    <div id="weight">
        <div><h2>Sélectionner la pondération de densité à appliquer</h2></div>
        <hr/>
        <div>
            <p>Le type de pond&eacute;ration appliqu&eacute; au calcul de la densit&eacute;. Deux options sont disponibles :
                <ul>
                    <li> <b>Uniform (Uniforme)</b>&mdash;Cette option calcule une grandeur par carte.
                    </li>
                    <li> <b>Kernel (Noyau)</b>&mdash;Applique une fonction de noyau pour ajuster une surface effil&eacute;e r&eacute;guli&egrave;re &agrave; chaque point.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="neighborhood">
        <div><h2>Sélectionner la taille du voisinage</h2></div>
        <hr/>
        <div>
            <p>La taille de la surface utilis&eacute;e pour calculer la densit&eacute;. La taille du voisinage doit &ecirc;tre sup&eacute;rieure &agrave; la taille du groupe.
            </p>
        </div>
    </div>
    <div id="areaUnits">
        <div><h2>Choisir les unités en sortie pour la densité</h2></div>
        <hr/>
        <div>
            <p>Les unit&eacute;s en sortie souhait&eacute;es pour les valeurs de densit&eacute;. Par d&eacute;faut, cette valeur est d&eacute;finie en kilom&egrave;tres carr&eacute;s ou en miles carr&eacute;s, selon les unit&eacute;s par d&eacute;faut sp&eacute;cifi&eacute;es dans votre profil. Si les valeurs de densit&eacute; sont tr&egrave;s faibles, vous pouvez augmenter la taille des unit&eacute;s de surface (par exemple, m&egrave;tres carr&eacute;s vers kilom&egrave;tres carr&eacute;s) afin de renvoyer des valeurs plus grandes. Les valeurs mettent uniquement le r&eacute;sultat &agrave; l&rsquo;&eacute;chelle.  

            </p>
        </div>
    </div>
    <div id="timeSlicing">
        <div><h2>Calculer la densité à l'aide d'intervalles temporels (facultatif)</h2></div>
        <hr/>
        <div>
            <p>Si le temps est activ&eacute; sur la couche ponctuelle en entr&eacute;e et qu'il est de type instantan&eacute;, vous pouvez effectuer l'analyse &agrave; l'aide des intervalles temporels. Vous pouvez d&eacute;finir trois param&egrave;tres lorsque vous utilisez le temps&nbsp;:
                <ul>
                    <li> <b>Intervalle temporel</b>
                    </li>
                    <li> <b>Fr&eacute;quence de r&eacute;p&eacute;tition de l'intervalle</b>
                    </li>
                    <li> <b>Heure sur laquelle aligner les intervalles temporels</b>
                    </li>
                </ul>
                
            </p>
            <p>Si, par exemple, vous avez des donn&eacute;es repr&eacute;sentant une ann&eacute;e et voulez les analyser selon un intervalle hebdomadaire, d&eacute;finissez  <b>Time step interval (Intervalle temporel)</b> sur <code>1&nbsp;week (1&nbsp;semaine)</code>. 
            </p>
            <p>Si, par exemple,  vous poss&eacute;dez des donn&eacute;es repr&eacute;sentant un an et voulez l&rsquo;analyser &agrave; l&rsquo;aide de la premi&egrave;re semaine du mois, d&eacute;finissez  <b>Time step interval (Intervalle temporel)</b> sur <code>1 week (1&nbsp;semaine)</code>, <b>How often to repeat the time step (Fr&eacute;quence de r&eacute;p&eacute;tition de l&rsquo;intervalle) (Fr&eacute;quence de r&eacute;p&eacute;tition de l&rsquo;intervalle)</b> sur <code>1 month (1 mois)</code> et <b>Time to align the time steps to (Heure sur laquelle aligner les intervalles temporels)</b> sur <code>January&nbsp;1, at 12:00&nbsp;am (1er&nbsp;janvier &agrave; 12&nbsp;h&nbsp;00)</code>.
            </p>
        </div>
    </div>
    <div id="timeInterval">
        <div><h2>Intervalle temporel</h2></div>
        <hr/>
        <div>
            <p>Intervalle de temps utilis&eacute; pour g&eacute;n&eacute;rer des intervalles temporels. Un   <b>intervalle temporel (Time step interval)</b> peut  &ecirc;tre utilis&eacute; seul ou  avec le param&egrave;tre <b>How often to repeat the time step (Fr&eacute;quence de r&eacute;p&eacute;tition de l&rsquo;intervalle) </b> ou <b>Time to align the time steps to</b> parameter (Heure sur laquelle aligner les intervalles temporels).
            </p>
            <p>Si, par exemple, vous voulez cr&eacute;er des intervalles qui ont lieu tous les lundis de 9&nbsp;h&nbsp;00 &agrave; 10&nbsp;h&nbsp;00, d&eacute;finissez  <b>Time step interval (Intervalle temporel)</b> sur <code>1 hour (1&nbsp;heure)</code>, <b>How often to repeat the time step (Fr&eacute;quence de r&eacute;p&eacute;tition de l&rsquo;intervalle)</b> sur <code>1&nbsp;week (1&nbsp;semaine)</code> et <b>Time to align the time steps to (Heure sur laquelle aligner les intervalles temporels)</b> sur <code>9:00:00&nbsp;a.m. on a Monday (9&nbsp;h&nbsp;00 un lundi)</code>.
            </p>
        </div>
    </div>
    <div id="timeStep">
        <div><h2>Fréquence de répétition de l'intervalle</h2></div>
        <hr/>
        <div>
            <p> Intervalle utilis&eacute; pour calculer un intervalle. Le param&egrave;tre <b>How often to repeat the time step (Fr&eacute;quence de r&eacute;p&eacute;tition de l&rsquo;intervalle)</b> peut &ecirc;tre utilis&eacute; seul ou avec <b>Time step interval (Intervalle temporel)</b>, avec <b>Reference Time (Heure de r&eacute;f&eacute;rence)</b>, ou avec &agrave; la fois <b>Time step interval (Intervalle temporel)</b> et <b>Time to align the time steps to (Heure sur laquelle aligner les intervalles temporels)</b>.
            </p>
            <p>Si,  par exemple,   vous voulez  cr&eacute;er des intervalles qui  ont   lieu tous les lundis de 9&nbsp;h&nbsp;00 &agrave; 10&nbsp;h&nbsp;00, d&eacute;finissez <b>Time step interval (Intervalle temporel) </b> sur <code>1 hour (1 heure)</code>, <b>How often to repeat the time step (Fr&eacute;quence de r&eacute;p&eacute;tition de l&rsquo;intervalle) </b> sur <code>1 week (1 semaine) </code>, et <b>Time to align the time steps to (Heure sur laquelle aligner les intervalles temporels) </b> sur <code>9:00:00 a.m. on a Monday (9&nbsp;h&nbsp;00 un lundi)</code>.
            </p>
        </div>
    </div>
    <div id="timeReference">
        <div><h2>Heure sur laquelle aligner les intervalles temporels</h2></div>
        <hr/>
        <div>
            <p>La date et l'heure utilis&eacute;es pour aligner les tranches horaires. Les intervalles temporels commencent &agrave; partir de cette heure et progressent vers le pass&eacute;. Si aucune heure de r&eacute;f&eacute;rence n'est s&eacute;lectionn&eacute;e, les intervalles temporels s'alignent sur le 1er&nbsp;janvier&nbsp;1970. 
            </p>
            <p> Si, par exemple, vous voulez cr&eacute;er des intervalles qui  ont lieu tous les lundis de 9&nbsp;h&nbsp;00 &agrave; 10&nbsp;h&nbsp;00, d&eacute;finissez <b>Time step interval (Intervalle temporel) </b> sur <code>1 hour (1&nbsp;heure)</code>, <b>How often to repeat the time step (Fr&eacute;quence de r&eacute;p&eacute;tition de l&rsquo;intervalle)</b> sur <code>1&nbsp;week (1&nbsp;semaine)</code>, et <b>Time to align the time steps to (Heure sur laquelle aligner les intervalles temporels) </b> sur <code>9:00:00&nbsp;a.m. on a Monday (9&nbsp;h&nbsp;00 un lundi).</code>.
            </p>
        </div>
    </div>
    <div id="spatialReference">
        <div><h2>Référence spatiale (wkid)</h2></div>
        <hr/>
        <div>
            <p>Il s'agit d'un param&egrave;tre temporaire de la version pr&eacute;liminaire qui permet de d&eacute;finir la r&eacute;f&eacute;rence spatiale de traitement. De nombreux outils Big Data n&eacute;cessitent l'utilisation d'un syst&egrave;me de coordonn&eacute;es projet&eacute;es comme r&eacute;f&eacute;rence spatiale pour le traitement. Par d&eacute;faut, l'outil utilise le syst&egrave;me de coordonn&eacute;es en entr&eacute;e, mais &eacute;choue s'il s'agit d'un syst&egrave;me de coordonn&eacute;es g&eacute;ographiques. Pour d&eacute;finir un syst&egrave;me de coordonn&eacute;es projet&eacute;es, saisissez le WKID. Par exemple,  <b>Web Mercator</b> est saisi sous la forme <code>3857</code>.
            </p>
        </div>
    </div>
    <div id="dataStore">
        <div><h2>Choisir un stockage des données</h2></div>
        <hr/>
        <div>
            <p>Les r&eacute;sultats de g&eacute;oanalyse sont stock&eacute;s dans un r&eacute;pertoire de donn&eacute;es et s&rsquo;affichent en tant que couche d&rsquo;entit&eacute;s dans  Portal for ArcGIS. Dans la plupart des cas, les r&eacute;sultats doivent &ecirc;tre stock&eacute;s dans le stockage des donn&eacute;es spatio-temporelles, ce qui est le param&egrave;tre par d&eacute;faut. Dans certains cas, il peut &ecirc;tre judicieux d&rsquo;enregistrer les r&eacute;sultats dans un data store relationnel. Voici les raisons pour lesquelles stocker les r&eacute;sultats dans le data store relationnel&nbsp;: 
                <ul>
                    <li>Vous pouvez utiliser les r&eacute;sultats en mode de collaboration de portail &agrave; portail.
                    </li>
                    <li>Vous pouvez activer la synchronisation de vos r&eacute;sultats.
                    </li>
                </ul>
                
            </p>
            <p>Vous ne devez pas utiliser le data store relationnel&nbsp;si vous pensez que vos r&eacute;sultats GeoAnalytics vont augmenter et que vous devez tirer parti des fonctionnalit&eacute;s du le data store Big Data spatio-temporel pour g&eacute;rer les grands volumes de donn&eacute;es.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nom de la couche de résultat</h2></div>
        <hr/>
        <div>
            <p> Nom de la couche &agrave; cr&eacute;er. Si vous &eacute;crivez sur une instance ArcGIS Data Store, les r&eacute;sultats seront enregistr&eacute;s dans  <b>My Content (Mon contenu)</b> et ajout&eacute;s &agrave; la carte. Si vous &eacute;crivez sur un partage de fichiers Big Data, les r&eacute;sultats seront enregistr&eacute;s dans le partage de fichiers Big Data et ajout&eacute;s &agrave; son manifeste. Il ne sera pas ajout&eacute; &agrave; la carte. Le nom par d&eacute;faut repose sur le nom de l'outil et sur le nom de la couche en entr&eacute;e. Si la couche existe d&eacute;j&agrave;, l'outil &eacute;choue.
            </p>
            <p>Lors de l&rsquo;&eacute;criture sur  ArcGIS Data Store (r&eacute;pertoire de donn&eacute;es relationnelles ou spatio-temporelles) via la zone de liste d&eacute;roulante  <b>Save result in (Enregistrer le r&eacute;sultat dans)</b>, vous pouvez sp&eacute;cifier le nom d&rsquo;un dossier dans <b>My Content (Mon contenu)</b> o&ugrave; le r&eacute;sultat sera enregistr&eacute;.
            </p>
        </div>
    </div>
</div>
</html>
