<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="smallsize">
        <h2>Extraire les données</h2><p/>
        <h2><img src="../images/GUID-CE24332B-74C0-412F-BB94-31415A02195A-web.png" alt="Extraire les donn&eacute;es"></h2>
        <hr/>
    <p>Cet outil vous permet de s&eacute;lectionner et de t&eacute;l&eacute;charger les donn&eacute;es d'une zone d'int&eacute;r&ecirc;t en particulier. Les couches que vous s&eacute;lectionnez sont ajout&eacute;es dans un fichier ZIP, CSV ou KMZ.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="InputLayers">
        <div><h2>Couches à extraire</h2></div>
        <hr/>
        <div>
            <p>Il s'agit des couches de la table des mati&egrave;res &agrave; partir de laquelle vous pouvez extraire les entit&eacute;s. Les couches qui sont s&eacute;lectionn&eacute;es sont extraites et comprises dans le fichier ZIP ou CSV obtenu.
            </p>
            <p>Pour qu'une couche fasse partie de la liste des couches &agrave; extraire, les donn&eacute;es doivent vous appartenir ou le propri&eacute;taire des donn&eacute;es doit permettre leur exportation. Pour permettre l'exportation des donn&eacute;es qui vous appartiennent&nbsp;: 
                <ul>
                    <li>Ouvrez la description de l'&eacute;l&eacute;ment des donn&eacute;es.
                    </li>
                    <li>Cliquez sur l'onglet  <b>Param&egrave;tres</b>.
                    </li>
                    <li>Faites d&eacute;filer jusqu'&agrave; la section  <b>Exporter des donn&eacute;es</b>.
                    </li>
                    <li>Cochez la case  <b>Autoriser d'autres utilisateurs &agrave; exporter vers diff&eacute;rents formats</b>.  Cliquez sur <b>Enregistrer</b> lorsque vous avez termin&eacute;.
                    </li>
                </ul>
                
            </p>
            <p>Si votre couche d'analyse contient des pi&egrave;ces jointes, notez que ces pi&egrave;ces jointes seront extraites uniquement si les donn&eacute;es en sortie sont au format g&eacute;odatabase fichier et que la case &agrave; cocher  <b>D&eacute;couper des entit&eacute;s</b> est d&eacute;sactiv&eacute;e.
            </p>
        </div>
    </div>
    <div id="AreaOfInterest">
        <div><h2>Zone d´étude</h2></div>
        <hr/>
        <div>
            <p>La zone qui d&eacute;finit les entit&eacute;s &agrave; inclure dans le fichier ZIP ou CSV en sortie. Vous pouvez s&eacute;lectionner l'un des &eacute;l&eacute;ments suivants&nbsp;:
                <ul>
                    <li>L'&eacute;tendue courante visible de votre carte ( <b>Identique &agrave; l&acute;affichage</b>).
                    </li>
                    <li>Une des couches de votre table des mati&egrave;res. Si la couche s&eacute;lectionn&eacute;e comporte des entit&eacute;s lin&eacute;aires ou ponctuelles, l&rsquo;&eacute;tendue de la couche constitue la zone d&rsquo;&eacute;tude.
                    </li>
                    <li>Dessinez une surface pour d&eacute;finir la zone d'&eacute;tude.
                    </li>
                </ul>
                 Toutes les entit&eacute;s qui se trouvent enti&egrave;rement &agrave; l'int&eacute;rieur de l'&eacute;tendue de la carte sont extraites. Pour les entit&eacute;s qui croisent ou coupent la limite de l'&eacute;tendue de la carte, mais qui ne se trouvent pas enti&egrave;rement &agrave; l'int&eacute;rieur, deux possibilit&eacute;s s'offrent &agrave; vous&nbsp;:
                <ul>
                    <li> <b>S&eacute;lectionner des entit&eacute;s</b>&nbsp;: les entit&eacute;s enti&egrave;res qui croisent la limite de la zone d'&eacute;tude sont extraites.
                    </li>
                    <li> <b>D&eacute;couper des entit&eacute;s</b>&nbsp;: seules les parties des entit&eacute;s qui se trouvent &agrave; l'int&eacute;rieur de la zone d'&eacute;tude sont extraites.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="OutputFormat">
        <div><h2>Format de données de sortie</h2></div>
        <hr/>
        <div>
            <p>Format des donn&eacute;es qui sont extraites. Lorsque vous exportez des entit&eacute;s lin&eacute;aires ou surfaciques au format CSV, seuls les attributs non spatiaux sont extraits. Lorsque vous exportez des entit&eacute;s ponctuelles, les attributs spatiaux et non spatiaux sont extraits.  
            </p>
            <p>Les donn&eacute;es extraites utilisent la projection Web Mercator 1984.  Pour les fichiers CSV, les champs de latitude et longitude ( <i>Lat</i> et <i>Long</i>) sont ajout&eacute;s aux donn&eacute;es dont les coordonn&eacute;es sont exprim&eacute;es dans le syst&egrave;me Web Mercator 1984.
            </p> 
            <p>Les formats de sortie suivants sont pris en charge&nbsp;:
                <ul>
                    <li>Valeurs s&eacute;par&eacute;es par des virgules (CSV)&nbsp;:  <code>.csv</code> ou <code>.zip</code>
                    </li>
                    <li>G&eacute;odatabase fichier&nbsp;:  <code>.zip</code>
                    </li>
                    <li>KML (Keyhole Markup Language, langage &agrave; base de balises g&eacute;olocales)&nbsp;:  <code>.kmz</code> ou <code>.zip</code>
                    </li>
                    <li>Shapefile&nbsp;:  <code>.zip</code>
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="OutputName">
        <div><h2>Nom du fichier de sortie</h2></div>
        <hr/>
        <div>
            <p>Il s'agit du nom de l'&eacute;l&eacute;ment qui sera ajout&eacute; &agrave; votre page  <b>My Content (Mes contenus)</b>. Le nom de l'&eacute;l&eacute;ment repose sur le <b>format de donn&eacute;es en sortie</b> choisi.     Si l'&eacute;l&eacute;ment existe d&eacute;j&agrave;, vous devez fournir un autre nom.
            </p>
            <p>La zone de liste d&eacute;roulante  <b>Enregistrer le r&eacute;sultat dans</b> vous permet de sp&eacute;cifier le nom d'un dossier dans <b>Mon contenu</b> o&ugrave; le r&eacute;sultat sera enregistr&eacute;.
            </p>
        </div>
    </div>
</div>
</html>
