<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Rechercher des emplacements similaires</h2><p/>
        <h2><img src="../images/GUID-6262A84E-9087-4E48-930E-E9B89FECC836-web.png" alt="Rechercher des emplacements similaires"></h2>
        <hr/>
    <p>Selon les crit&egrave;res que vous sp&eacute;cifiez, l'outil Rechercher des emplacements similaires mesure la similarit&eacute; des emplacements dans votre couche de recherche de candidats par rapport &agrave; un ou plusieurs emplacements de r&eacute;f&eacute;rence. Cet outil permet de r&eacute;pondre &agrave; des questions du type&nbsp;: 
        <ul>
            <li>Lesquels de vos points de vente se rapprochent le plus de vos points de vente les plus performants, en termes de profils de clients&nbsp;?
            </li>
            <li>En fonction des caract&eacute;ristiques des villages les plus durement touch&eacute;s par la maladie, quels sont les autres villages les plus expos&eacute;s&nbsp;?
            </li>
        </ul>
        Pour r&eacute;pondre &agrave; des questions de ce type, indiquez les emplacements de r&eacute;f&eacute;rence, les emplacements de recherche de candidats et les champs repr&eacute;sentant les crit&egrave;res &agrave; respecter. La premi&egrave;re couche en entr&eacute;e doit contenir vos emplacements de r&eacute;f&eacute;rence ou d'&eacute;tude.  Il peut s'agir par exemple d'une couche comportant vos points de vente les plus performants ou les villages les plus durement touch&eacute;s par la maladie. Sp&eacute;cifiez ensuite la couche contenant vos emplacements de recherche de candidats. Il peut s'agir de tous vos points de vente ou de tous les autres villages. Enfin, identifiez un ou plusieurs champs &agrave; utiliser pour mesurer la similarit&eacute;. L'outil Rechercher des emplacements similaires classe ensuite tous les emplacements de recherche de candidats selon leur degr&eacute; de correspondance avec vos emplacements de r&eacute;f&eacute;rence dans tous les champs que vous avez s&eacute;lectionn&eacute;s.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Choisissez la couche contenant les emplacements de référence</h2></div>
        <hr/>
        <div>
            <p>La couche contenant les emplacements de r&eacute;f&eacute;rence &agrave; apparier. 
            </p>
            <p>Outre le fait de choisir une couche de votre carte, vous pouvez s&eacute;lectionner  <b>Choose Analysis Layer (Choisir une couche d&rsquo;analyse)</b> au bas de la liste d&eacute;roulante pour parcourir votre contenu et rechercher une couche d&rsquo;entit&eacute;s ou un jeu de donn&eacute;es de partage de fichiers Big Data.
            </p>
        </div>
    </div>
    <div id="inputLayerSel">
        <div><h2>Vous pouvez utiliser tous les emplacements ou effectuer une sélection</h2></div>
        <hr/>
        <div>
            <p>Vous pouvez utiliser les boutons de s&eacute;lection pour d&eacute;signer les emplacements de r&eacute;f&eacute;rence. Cette option n'est disponible que si les entit&eacute;s sont dessin&eacute;es sur la carte (non disponible pour un partage de fichiers Big Data).  Par exemple, si la couche en entr&eacute;e contient tous les emplacements (les emplacements de r&eacute;f&eacute;rence, ainsi que les emplacements de recherche de candidats), vous devez utiliser un des outils de s&eacute;lection pour identifier les emplacements de r&eacute;f&eacute;rence.  Si vous cr&eacute;ez deux couches distinctes, une contenant les emplacements de r&eacute;f&eacute;rence et l'autre contenant tous les emplacements de recherche de candidats, vous n'avez pas besoin d'effectuer une s&eacute;lection.
            </p>
            <p>S'il existe plusieurs emplacements de r&eacute;f&eacute;rence, un seul emplacement est cr&eacute;&eacute; en calculant la moyenne des valeurs de chacun des champs utilis&eacute;s pour analyser la similarit&eacute;.
            </p>
        </div>
    </div>
    <div id="searchLayer">
        <div><h2>Rechercher des emplacements similaires dans</h2></div>
        <hr/>
        <div>
            <p>Les entit&eacute;s de recherche de candidats de cette couche sont class&eacute;es de la plus similaire &agrave; la moins similaire. 
            </p>
            <p>Outre le fait de choisir une couche de votre carte, vous pouvez s&eacute;lectionner  <b>Choose Analysis Layer (Choisir une couche d&rsquo;analyse)</b> au bas de la liste d&eacute;roulante pour parcourir votre contenu et rechercher une couche d&rsquo;entit&eacute;s ou un jeu de donn&eacute;es de partage de fichiers Big Data.
            </p>
        </div>
    </div>
    <div id="analysisFields">
        <div><h2>Baser la similarité sur</h2></div>
        <hr/>
        <div>
            <p>Les champs que vous s&eacute;lectionnez constituent les crit&egrave;res utilis&eacute;s pour &eacute;valuer la similarit&eacute;. Si vous s&eacute;lectionnez un champ de population et de revenu, par exemple, les emplacements de recherche de candidats avec les classements les plus faibles (les meilleurs) sont ceux dont les valeurs de population et de revenu sont similaires aux valeurs de vos emplacements de r&eacute;f&eacute;rence.
            </p>
        </div>
    </div>
    <div id="matchMethod">
        <div><h2>Déterminer les plus et moins similaires avec</h2></div>
        <hr/>
        <div>
            <p>Le mode d'appariement est d&eacute;termin&eacute; par la m&eacute;thode s&eacute;lectionn&eacute;e. 
                <ul>
                    <li>La m&eacute;thode  <b>valeurs de champ</b> utilise les diff&eacute;rences au carr&eacute; des valeurs standardis&eacute;es. Il s'agit de l'option par d&eacute;faut.
                    </li>
                    <li>La m&eacute;thode  <b>profils de champ</b> utilise des calculs de similarit&eacute; cosinuso&iuml;dale pour comparer le profil de valeurs standardis&eacute;es. Au moins deux champs d'analyse sont n&eacute;cessaires si vous utilisez des profils attributaires.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="numberOfResults">
        <div><h2>Me montrer</h2></div>
        <hr/>
        <div>
            <p>Vous pouvez voir tous les emplacements de recherche de candidats class&eacute;s du plus similaire au moins similaire, ou sp&eacute;cifier le nombre de r&eacute;sultats que vous souhaitez afficher. 
                <ul>
                    <li>Si vous sp&eacute;cifiez  <b>tous les emplacements du plus similaire au moins similaire</b>, toutes les entit&eacute;s de la couche de recherche de candidats sont comprises dans la couche de r&eacute;sultats selon l'ordre de classement. Un maximum de 10&nbsp;000&nbsp;r&eacute;sultats peuvent &ecirc;tre renvoy&eacute;s.
                    </li>
                    <li>Si vous sp&eacute;cifiez le  <code>nombre d'</code> <b>emplacements</b> <code>les plus similaires, les moins similaires ou les plus et les moins similaires</code>, vous d&eacute;terminez le nombre de candidats les plus, les moins ou les plus et les moins similaires devant &ecirc;tre inclus dans la couche de r&eacute;sultat. La valeur maximum autoris&eacute;e est 10&nbsp;000.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="appendFields">
        <div><h2>Choisir les champs dans lesquels ajouter les résultats</h2></div>
        <hr/>
        <div>
            <p>Vous pouvez &eacute;galement ajouter des champs &agrave; vos donn&eacute;es &agrave; partir de votre couche de recherche. Par d&eacute;faut, tous les champs sont ajout&eacute;s.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nom de la couche résultat</h2></div>
        <hr/>
        <div>
            <p> Nom de la couche &agrave; cr&eacute;er. Si vous &eacute;crivez sur une instance ArcGIS Data Store, les r&eacute;sultats seront enregistr&eacute;s dans  <b>My Content (Mon contenu)</b> et ajout&eacute;s &agrave; la carte. Si vous &eacute;crivez sur un partage de fichiers Big Data, les r&eacute;sultats seront enregistr&eacute;s dans le partage de fichiers Big Data et ajout&eacute;s &agrave; son manifeste. Il ne sera pas ajout&eacute; &agrave; la carte. Le nom par d&eacute;faut repose sur le nom de l'outil et sur le nom de la couche en entr&eacute;e. Si la couche existe d&eacute;j&agrave;, l'outil &eacute;choue.
            </p>
            <p>Cette couche de r&eacute;sultat contiendra les emplacements de r&eacute;f&eacute;rence et le nombre d'entit&eacute;s de recherche de candidats class&eacute;es que vous avez sp&eacute;cifi&eacute;.   Si le nom de la couche de r&eacute;sultats existe d&eacute;j&agrave;, vous devez renommer la couche.
            </p>
            <p>Lors de l&rsquo;&eacute;criture sur  ArcGIS Data Store (r&eacute;pertoire de donn&eacute;es relationnelles ou spatio-temporelles) via la zone de liste d&eacute;roulante  <b>Save result in (Enregistrer le r&eacute;sultat dans)</b>, vous pouvez sp&eacute;cifier le nom d&rsquo;un dossier dans <b>My Content (Mon contenu)</b> o&ugrave; le r&eacute;sultat sera enregistr&eacute;.
            </p>
        </div>
    </div>
</div>
</html>
