<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Beregn rejseomkostninger som polylinje</h2><p/>
        <h2><img src="../images/GUID-9A27DEB7-0276-483C-A12F-3E70D636550D-web.png" alt="Illustration af v&aelig;rkt&oslash;jet Beregn rejseomkostninger som polylinje"></h2>
        <hr/>
    <p>Dette v&aelig;rkt&oslash;j beregner polylinjeruten med de laveste omkostninger mellem kilder og kendte destinationer.
    </p>
    <p>Eksempler p&aring; anvendelse:
        <ul>
            <li>Find den bedste rutef&oslash;ring til en ny vej med hensyn til anl&aelig;gsudgifter.
                

            </li>
            <li>Find ruten fra flere forst&aelig;der (kilder) til n&aelig;rmeste indk&oslash;bscenter (destination).
                

            </li>
        </ul>
        
    </p>
    <p>Hvis  <b>Anvend aktuel kortudstr&aelig;kning</b> er markeret, vil kun de steder i inputlagene, der er synlige i den aktuelle kortudstr&aelig;kning, blive analyseret. Hvis markeringen fjernes, analyseres alle steder i begge inputlag, ogs&aring; selvom de er placeret uden for den aktuelle kortudstr&aelig;kning.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputSourceRasterOrFeatures">
        <div><h2>Vælg det raster- eller vektorkildelag, der skal beregnes ruter fra</h2></div>
        <hr/>
        <div>
            <p>En billedtjeneste eller featuretjeneste, der identificerer de celler, hvorfra ruten med de laveste omkostninger til destinationen med de laveste omkostninger fastl&aelig;gges.
            </p>
            <p>Hvis input er en billedtjeneste, best&aring;r input af ​​celler, der har gyldige v&aelig;rdier (nul er en gyldig v&aelig;rdi), og de resterende celler skal tildeles NoData.
            </p>
        </div>
    </div>
    <div id="inputCostRaster">
        <div><h2>Vælg rasterlag for rejseomkostninger</h2></div>
        <hr/>
        <div>
            <p>En raster, der definerer impedans eller omkostning ved at bev&aelig;ge sig planimetrisk gennem hver celle.
            </p>
            <p>V&aelig;rdien ved hver cellelokation repr&aelig;senterer omkostning pr. enhed-afstanden ved at bev&aelig;ge sig gennem cellen. V&aelig;rdien ved hver cellelokation ganges med celleopl&oslash;sningen, og der kompenseres for diagonal bev&aelig;gelse for at f&aring; de samlede omkostninger ved at bev&aelig;ge sig gennem cellen.
            </p>
            <p>V&aelig;rdierne af omkostningsrasteren kan v&aelig;re heltal eller flydende komma, men de kan ikke v&aelig;re negative eller nul (man kan ikke have omkostninger, der er negative eller nul).
            </p>
        </div>
    </div>
    <div id="inputDestinationRasterOrFeatures">
        <div><h2>Input destinationsraster eller objekter</h2></div>
        <hr/>
        <div>
            <p>Et input, der definerer de destinationer, som bruges til at beregne afstanden. Laget kan v&aelig;re et rasterlag eller et vektorlag.
            </p>
            <p>Hvis input er en billedtjeneste, best&aring;r input af ​​celler, der har gyldige v&aelig;rdier (nul er en gyldig v&aelig;rdi), og de resterende celler skal tildeles NoData.
            </p>
        </div>
    </div>
    <div id="outputPolylineName">
        <div><h2>Navn på det resulterende polylinjelag</h2></div>
        <hr/>
        <div>
            <p>Navnet p&aring; det lag, som oprettes under  <b>Mit indhold</b> og f&oslash;jes til kortet. Standardnavnet er baseret p&aring; navnet p&aring; v&aelig;rkt&oslash;jet og navnet p&aring; inputlaget. Hvis laget allerede findes, vil du blive bedt om at angive et andet navn.
            </p>
            <p>Du kan angive navnet p&aring; en mappe i  <b>Mit indhold</b>, hvor resultatet bliver gemt ved at benytte rullelisten <b>Gem resultat i</b>.
            </p>
        </div>
    </div>
    <div id="pathType">
        <div><h2>Vælg den type ruter, der skal beregnes</h2></div>
        <hr/>
        <div>
            <p>Definerer den m&aring;de, hvorp&aring; v&aelig;rdierne og zoner p&aring; inputdestinationsdataene bliver fortolket i beregningerne af rutens omkostninger.
            </p>
            <ul>
                <li>Bedste enkelt &ndash; For alle celler eller placeringer p&aring; inputdestinationsdataene findes ruten med de laveste omkostninger fra den placering, der har det laveste antal lavomkostningsruter til kildeplaceringen. Dette er standardv&aelig;rdien.
                    

                </li>
                <li>Til hver celle &ndash; For hver celle eller placering med gyldige v&aelig;rdier p&aring; inputdestinationsdataene bestemmes en lavomkostningsrute, som gemmes p&aring; output-featuretjenesten. Med denne indstilling behandles hver celle i inputdestinationsdataene separat, og der fasstl&aelig;gges en lavomkostningsrute for hver celle.
                    

                </li>
                <li>Til hver zone &ndash; For hver zone p&aring; inputdestinationsdataene bestemmes en lavomkostningsrute, som gemmes p&aring; output-featuretjenesten. Med denne mulighed begynder lavomkostningsruten ved den celle eller placering med den laveste pris/afstands-v&aelig;gtning i zonen.
                    

                </li>
            </ul>
            
        </div>
    </div>
</div>
</html>
