<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Rekonstruér spor</h2><p/>
        <h2><img src="../images/GUID-80807DB7-0CA7-4FD8-9702-B4486285D4FC-web.png" alt="Rekonstru&eacute;r spor"></h2>
        <hr/>
    <p> Dette v&aelig;rkt&oslash;j arbejder med et tidsafh&aelig;ngigt lag best&aring;ende af enten punkt- eller omr&aring;de-objekter, der repr&aelig;senterer et <code>&oslash;jeblik</code> i tiden. Det bestemmer f&oslash;rst, hvilke objekter der tilh&oslash;rer et spor ved hj&aelig;lp af en identifikator. Ved at benytte tid i forhold til hver position arrangeres sporene i r&aelig;kkef&oslash;lge og transformeres til en linje eller et omr&aring;de, der repr&aelig;senterer bev&aelig;gelsen over tid. Input kan evt. placeres i en buffer, der udg&oslash;res af et felt, som vil oprette et omr&aring;de ved hver position. Disse bufferpunkter, eller input- omr&aring;der, forbindes derefter i r&aelig;kkef&oslash;lge for at oprette et spor som et omr&aring;de, hvor bredden repr&aelig;senterer attributten for interesse. De resulterende spor har en start- og en sluttid, som i tidssammenh&aelig;ng repr&aelig;senterer det f&oslash;rste og sidste spor i et givent spor. N&aring;r sporene oprettes, beregnes der statistik vedr&oslash;rende inputobjekterne, og de statistiske data knyttes til outputsporet. Den mest grundl&aelig;ggende statistik er opt&aelig;llingen af punkterne i omr&aring;det, men der kan ogs&aring; beregnes andre statistiske data.
    </p>
    <p>Objekter i tidsafh&aelig;ngige lag kan vises p&aring; en af f&oslash;lgende to m&aring;der:
        <ul>
            <li>&Oslash;jeblik &ndash; Et enkelt &oslash;jeblik i tiden
            </li>
            <li>Interval &ndash; En start- og en sluttid
            </li>
        </ul>
        
    </p>
    <p>Forestil dig f.eks., at du f&aring;r GPS-m&aring;linger af orkaner hvert 10. minut. Hver GPS-m&aring;ling registrerer orkanens navn, position, registreringstidspunkt samt vindhastighed. Med disse oplysninger kunne du oprette spor for hver orkan ved at benytte dens navn som sporidentifikation, og sporene for hver orkan ville s&aring; blive genereret. Du kunne desuden beregne statistik, s&aring;som middel-, maksimal- og minimal vindhastighed for hver orkan, og du kunne t&aelig;lle m&aring;lingerne inden for hvert spor.
    </p>
    <p>Du kunne desuden placere sporene i buffere p&aring; grundlag af vindhastigheden. Dette ville placere hver m&aring;ling i en buffer baseret p&aring; vindhastigheden p&aring; den p&aring;g&aelig;ldende position, og bufferomr&aring;derne ville blive forbundet, hvilket ville oprette et omr&aring;de, der ville repr&aelig;sentere sporretningen samt &aelig;ndringer i vindhastigheden, mens orkanerne udvikler sig.   
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Vælg objekter for at rekonstruere spor ud fra</h2></div>
        <hr/>
        <div>
            <p>Punkt- eller omr&aring;de-lag, der rekonstrueres til spor. Inputlaget skal v&aelig;re tidsaktiveret med objekter, der repr&aelig;senterer et &oslash;jeblik i tiden. Laget skal v&aelig;re placeret i et projiceret koordinatsystem, eller den spatiale reference til behandling skal v&aelig;re indstillet til et projiceret koordinatsystem ved hj&aelig;lp af  <b>Analysemilj&oslash;erne</b>, hvis der anvendes en buffer.
            </p>
            <p>Udover at du kan v&aelig;lge et lag i dit kort, kan du v&aelig;lge  <b>V&aelig;lg analyselag</b> nederst p&aring; rullelisten for at g&aring; til dit indhold til et big data-fildelingsdatas&aelig;t eller -vektorlag.
            </p>
        </div>
    </div>
    <div id="trackFields">
        <div><h2>Vælg ét eller flere felter til identifikation af spor</h2></div>
        <hr/>
        <div>
            <p>Felter, der repr&aelig;senterer sporidentifikatoren. 
            </p>
            <p>Hvis du f.eks. skulle rekonstruere spor af orkaner, kunne du benytte orkanens navn som sporingsfelt.
            </p>
        </div>
    </div>
    <div id="method">
        <div><h2>Vælg den metode, der skal bruges til at rekonstruere spor</h2></div>
        <hr/>
        <div>
            <p>Metode, der benyttes til at forbinde spor samt anvende buffere (hvis det er relevant).  <b>Planar</b>-metoden kan muligvis beregne resultaterne hurtigere, men vil ikke knytte sporene til den internationale datolinje eller tage h&oslash;jde for jordens faktiske runding ved oprettelse af buffere. Den <b>geod&aelig;tiske</b> metode vil knytte sporene til den internationale datolinje, hvis det er p&aring;kr&aelig;vet, og den vil bruge en geod&aelig;tisk buffer til at tage h&oslash;jde for jordens runding.
            </p>
        </div>
    </div>
    <div id="bufferField">
        <div><h2>Opret et udtryk til at placere inputobjekter i en buffer efter (valgfrit)</h2></div>
        <hr/>
        <div>
            <p>Ligning, der benyttes til at beregne bufferafstanden omkring inputobjekterne. Denne ligning kan genereres ved hj&aelig;lp af en bufferberegner, og grundl&aelig;ggende handlinger, s&aring;som addition, subtraktion, multiplikation og division underst&oslash;ttes. V&aelig;rdierne beregnes ved at benytte analysekoordinatsystemet. Laget skal v&aelig;re placeret i et projiceret koordinatsystem, eller den spatiale reference til behandling skal v&aelig;re indstillet til et projiceret koordinatsystem ved hj&aelig;lp af  <b>Analysemilj&oslash;erne</b>, hvis der anvendes en buffer.
            </p>
            <p>En ligning som f.eks.  <code>$feature.windspeed * 1000</code> ville anvende en buffer p&aring; 1.000 multipliceret med feltet for <i>windspeed</i>. Du kan benytte mere end &eacute;t felt til bufferberegningen.
            </p>
            <p> Du kan ogs&aring; angive et sporingsparat udtryk. Du kan f.eks.beregne summen af ​​feltv&aelig;rdien <i>windspeed</i> for det aktuelle objekt og de foreg&aring;ende to objekter med en ligning som <code>$track.field(windspeed).history(-3)</code>. P&aring; hvert sted beregnes summen af den aktuelle <i>windspeed</i> og de foreg&aring;ende to m&aring;linger placeres i en buffer.
            </p>
        </div>
    </div>
    <div id="timeSplit">
        <div><h2>Vælg en tidsangivelse, som spor skal opdeles efter (valgfrit)</h2></div>
        <hr/>
        <div>
            <p>Den tid, der benyttes til at opdele spor. Hvis inputpunkter eller -omr&aring;der har l&aelig;ngere tidsvarighed mellem sig end angivet af tidsopdelingen, vil de blive opdelt i forskellige spor.
            </p>
            <p>Hvis du angiver en tidsopdeling og en afstandsopdeling, opdeles sporene, n&aring;r den ene eller begge betingelser er opfyldt. 
            </p>
            <p>Forestil dig, at du f.eks. har punktobjekter, der repr&aelig;senterer flyvninger, hvor sporingsfeltet udg&oslash;r flyets ID. Dette fly kunne foretage adskillige flyvninger, som alle ville v&aelig;re repr&aelig;senteret af et enkelt spor.  Hvis du vidste, at der var en pause p&aring; 1 time mellem hver flyvning, kunne du benytte  <code>1 time</code> som din sporopdeling, hvorefter hver flyvning ville blive opdelt og derved f&aring; sit eget spor.
            </p>
        </div>
    </div>
    <div id="splitTracks">
        <div><h2>Opdelte spor (valgfri)</h2></div>
        <hr/>
        <div>
            <p>Du kan opdele spor ved hj&aelig;lp af tre forskellige metoder. Du kan bruge en kombination af ingen, alle eller nogle af opdelingsmetoderne. 
            </p>
            <p>Opdeling kan udf&oslash;res p&aring; f&oslash;lgende m&aring;der:
                <ul>
                    <li> <b>Baseret p&aring; en afstand mellem inputs</b> - Hvis inputpunkter eller -omr&aring;der har en st&oslash;rre afstand mellem sig end den angivne afstand, vil de blive opdelt i forskellige spor. Hvis du f.eks. har angivet en afstand p&aring; 10 kilometer, bliver sekventielle punkter, som er st&oslash;rre end 10 kilometer, separate spor.
                    </li>
                    <li> <b>Baseret p&aring; tid mellem inputs</b> - Hvis inputpunkter eller -omr&aring;der har en st&oslash;rre varighed mellem sig end tidsintervallet, bliver de opdelt i forskellige spor. Hvis du f.eks. har punktobjekter, der repr&aelig;senterer flyvninger, hvor sporingsfeltet udg&oslash;r flyets ID. Dette fly kunne foretage adskillige flyvninger, som alle ville v&aelig;re repr&aelig;senteret af et enkelt spor.  Hvis du vidste, at der var en pause p&aring; 1 time mellem hver flyvning, kunne du benytte <code>1 time</code> som din sporopdeling, hvorefter hver flyvning ville blive opdelt og derved f&aring; sit eget spor.
                    </li>
                    <li> <b>Ved definerede tidsintervaller</b> - Opdeling med regelm&aelig;ssige intervaller, angivet ved et tidsinterval og et referencetidspunkt. Hvis du ikke angiver et referencetidspunkt, benyttes 1. januar 1970. Hvis du f.eks. har angivet 1 &aring;r med referencetidspunktet 2. februar 1990 kl. 10:00, deler du sporene ved 2. februar 1990 kl. 10:00, 2. februar 1991 og forts&aelig;tter med intervaller p&aring; et &aring;r.
                    </li>
                </ul>
                
            </p>
            <p>Hvis du angiver flere opdelingmuligheder, opdeles sporene, n&aring;r en eller flere betingelser er opfyldt. 
            </p>
        </div>
    </div>
    <div id="distanceSplit">
        <div><h2>Vælg en afstand, som spor skal opdeles efter (valgfrit)</h2></div>
        <hr/>
        <div>
            <p>Den afstand, der benyttes til at opdele spor. Hvis inputpunkter eller -omr&aring;der har en st&oslash;rre afstand mellem sig end angivet af afstandsopdelingen, vil de blive opdelt i forskellige spor.
            </p>
            <p>Hvis du angiver en tidsopdeling og en afstandsopdeling, opdeles sporene, n&aring;r den ene eller begge betingelser er opfyldt. 
            </p>
        </div>
    </div>
    <div id="summaryFields">
        <div><h2>Tilføj statistik (valgfrit)</h2></div>
        <hr/>
        <div>
            <p> Du kan beregne statistik for objekter, der er summeret.Dukan beregne f&oslash;lgende for numeriske felter :
                <ul>
                    <li>Antal &ndash; Beregner antallet af ikke-nul-v&aelig;rdier.Det anvendes til numeriske felter eller strenge. Opt&aelig;llingen af [null, 0, 2] er 2.
                    </li>
                    <li>Sum &ndash; Summen af numeriske v&aelig;rdier i et felt. Summen af [null, null, 3] er 3.
                    </li>
                    <li>Middelv&aelig;rdi &ndash; Middelv&aelig;rdier af de numeriske v&aelig;rdier. Middelv&aelig;rdien af [0, 2, null] er 1.
                    </li>
                    <li>Min. &ndash; Minimumv&aelig;rdien for et numerisk felt. Minimumsv&aelig;rdien af [0, 2, null] er 0. 
                    </li>
                    <li>Maks. &ndash; Maksimumv&aelig;rdien for et numerisk felt. Maksimumv&aelig;rdien af [0, 2, null] er 2.
                    </li>
                    <li>Omr&aring;de &ndash; Omr&aring;det for et numerisk felt. Dette beregnes som minimumv&aelig;rdierne, der er trukket fra maksimumv&aelig;rdien. Omr&aring;det for [0, null, 1] er 1. Omr&aring;det for [null, 4] er 0.
                    </li>
                    <li>Varians &ndash; Variansen af et numerisk felt i et spor. Variansen af [1] er nul. Variansen af [null, 1,0, 1,1] er 0,25.
                    </li>
                    <li>Standardafvigelse &ndash; Standardafvigelsen for et numerisk felt. Standardafvigelsen for [1] er nul. Standardafvigelsen for [null, 1,0, 1,1] er 0,5. 
                    </li>
                </ul>
                
            </p>
            <p>Du kan beregne f&oslash;lgende for strengfelter :
                <ul>
                    <li>Antal &ndash; Antallet af ikke-nul-strenge.
                    </li>
                    <li>Vilk&aring;rlig &ndash; Denne statistik er et vilk&aring;rligt eksempel p&aring; en strengv&aelig;rdi i det angivne felt.
                    </li>
                </ul>
                Alle statistiske data beregnes ud fra ikke-nul-v&aelig;rdier. Resultatlaget vil indeholde et nyt felt for hver beregnet statistik. Du kan tilf&oslash;je et vilk&aring;rligt antal statistikker ved at v&aelig;lge attributter og statistikker. 
            </p>
        </div>
    </div>
    <div id="dataStore">
        <div><h2>Vælg et ArcGIS-datalager, som resultaterne kan gemmes i</h2></div>
        <hr/>
        <div>
            <p>GeoAnalytic-resultater lagres i et datalager og vises som et vektorlag i  Portal for ArcGIS. I de fleste tilf&aelig;lde b&oslash;r resultaterne blive lagret i et spatiotemporalt datalager, hvilket ogs&aring; er standarden. I nogle tilf&aelig;lde er det at lagre resultaterne i et relationsdatalager en god mulighed. Her er &aring;rsagerne til, at du m&aring;ske &oslash;nsker at lagre resultaterne i et relationsdatalager: 
                <ul>
                    <li>Du kan  bruge resultaterne i portalen-til-portalsamarbejde.
                    </li>
                    <li>Du kan  aktivere synkroniseringsfunktioner i forbindelse med dine resultater
                    </li>
                </ul>
                
            </p>
            <p>Du b&oslash;r benytte et relationsdatalager, hvis du forventer, at m&aelig;ngden af dine GeoAnalytics-resultater vil blive st&oslash;rre, og du &oslash;nsker at drage fordel af det spatiotemporale big data-lagers muligheder for at h&aring;ndtere store datam&aelig;ngder.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Navn på resultatlag</h2></div>
        <hr/>
        <div>
            <p> Navnet p&aring; det lag, som oprettes. Hvis du skriver til et ArcGIS Data Store, bliver  dine resultater gemt i  <b>Mit indhold</b> og f&oslash;jet til kortet. Hvis du skriver til en big data-fildeling, bliver dine resultater gemt i big data-fildelingen og f&oslash;jet til dens manifest. De bliver ikke f&oslash;jes til kortet. Standardnavnet er baseret p&aring; navnet p&aring; v&aelig;rkt&oslash;jet og navnet p&aring; inputlaget. Hvis laget allerede findes, vil v&aelig;rkt&oslash;jet ikke fungere.
            </p>
            <p>N&aring;r du skriver til   ArcGIS Data Store  (relationelt eller spatiotemporalt big data-lager) ved hj&aelig;lp af rullelisten  <b>Gem resultat i </b>, kan du angive navnet p&aring; en mappe i <b>Mit indhold</b>, hvor resultatet gemmes.
            </p>
        </div>
    </div>
</div>
</html>
