<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="smallsize">
        <h2>Các Vị trí Mã hóa địa lý từ Bảng</h2><p/>
        <h2><img src="../images/GUID-E4194410-7BBF-4349-98C9-22781D35183E-web.png" alt="C&aacute;c Vị tr&iacute; M&atilde; h&oacute;a địa l&yacute; Từ Bảng"></h2>
        <hr/>
    <p>M&atilde; h&oacute;a địa l&yacute; chuyển đổi địa chỉ th&agrave;nh tọa độ. C&ocirc;ng cụ n&agrave;y chuyển đổi địa chỉ từ một bảng chia sẻ tệp dữ liệu lớn th&agrave;nh một lớp đối tượng c&oacute; c&aacute;c tọa độ l&agrave; c&aacute;c cột bổ sung.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputTable">
        <div><h2>Chọn một bảng đầu vào</h2></div>
        <hr/>
        <div>
            <p>Bảng đầu v&agrave;o với c&aacute;c địa chỉ đ&atilde; được m&atilde; h&oacute;a địa l&yacute;. 
            </p>
        </div>
    </div>
    <div id="geocodeServiceURL">
        <div><h2>Chọn một bộ định vị</h2></div>
        <hr/>
        <div>
            <p>Chọn một dịch vụ định vị để chuần bị M&atilde; h&oacute;a địa l&yacute;. Nếu dịch vụ định vị bạn muốn sử dụng kh&ocirc;ng c&oacute; trong menu xổ xuống, h&atilde;y li&ecirc;n hệ với quản trị vi&ecirc;n của bạn để cấu h&igrave;nh th&ecirc;m dịch vụ định vị n&agrave;y cho quy tr&igrave;nh tự động m&atilde; h&oacute;a địa l&yacute;.  

            </p>
        </div>
    </div>
    <div id="sourceCountry">
        <div><h2>Quốc gia</h2></div>
        <hr/>
        <div>
            <p>Nếu tất cả c&aacute;c địa chỉ của bạn đến từ một quốc gia, h&atilde;y chọn quốc gia đ&oacute; để đảm bảo c&aacute;c kết quả ch&iacute;nh x&aacute;c nhất. Nếu kh&ocirc;ng, h&atilde;y để trống th&ocirc;ng số n&agrave;y.
            </p>
        </div>
    </div>
    <div id="geocodeParameters">
        <div><h2>Chọn các Trường Dữ liệu</h2></div>
        <hr/>
        <div>
            <p>Dịch vụ định vị y&ecirc;u cầu c&aacute;c trường cụ thể c&oacute; trong dữ liệu n&agrave;y, v&iacute; dụ như địa chỉ, th&agrave;nh phố, tiểu bang v&agrave; m&atilde; bưu điện hay m&atilde; ZIP. Nối c&aacute;c trường dữ liệu trong tệp hoặc bảng đầu v&agrave;o với c&aacute;c trường m&agrave; bộ định vị y&ecirc;u cầu, sử dụng c&aacute;c hộp xổ xuống. Bạn vạch ra c&agrave;ng nhiều trường, kết quả sẽ c&agrave;ng ch&iacute;nh x&aacute;c. Nếu bảng đầu v&agrave;o c&oacute; tất cả dữ liệu nằm trong c&ugrave;ng một cột, h&atilde;y chọn  <b>Trường Đơn</b> v&agrave; chọn một trường dữ liệu từ menu xổ xuống. Nếu kh&ocirc;ng, h&atilde;y chọn <b>Đa Trường</b> v&agrave; chỉ ra c&aacute;c trường định vị ph&ugrave; hợp với c&aacute;c cột đa trường trong bảng của bạn.
            </p>
        </div>
    </div>
    <div id="includeAttributes">
        <div><h2>Đối với từng vị trí</h2></div>
        <hr/>
        <div>
            <p>Bao gồm c&aacute;c trường bổ sung được dịch vụ định vị trả lại. Nếu t&ugrave;y chọn n&agrave;y được đ&aacute;nh dấu, tất cả c&aacute;c trường được bộ định vị tạo ra sẽ được trả lại. Nếu t&ugrave;y chọn n&agrave;y kh&ocirc;ng được đ&aacute;nh dấu, dữ liệu đầu v&agrave;o của bạn sẽ được trả lại c&ugrave;ng với tọa độ được m&atilde; h&oacute;a địa l&yacute;. 
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Tên kết quả đầu ra</h2></div>
        <hr/>
        <div>
            <p> T&ecirc;n lớp sẽ được tạo. Nếu bạn đang ghi v&agrave;o ArcGIS Data Store, kết quả của bạn sẽ được lưu v&agrave;o phần  <b>Nội dung của t&ocirc;i</b> v&agrave; được th&ecirc;m v&agrave;o bản đồ. Nếu bạn đang ghi v&agrave;o một phần chia sẻ tệp dữ liệu lớn, kết quả của bạn sẽ được lưu v&agrave;o phần chia sẻ tệp dữ liệu lớn v&agrave; được th&ecirc;m v&agrave;o bản k&ecirc; của n&oacute;. N&oacute; sẽ kh&ocirc;ng được th&ecirc;m v&agrave;o bản đồ. T&ecirc;n mặc định dựa v&agrave;o t&ecirc;n c&ocirc;ng cụ v&agrave; t&ecirc;n lớp đầu v&agrave;o. Nếu lớp đ&atilde; tồn tại, c&ocirc;ng cụ sẽ thất bại.
            </p>
            <p>Khi ghi v&agrave;o  ArcGIS Data Store (kho dữ liệu lớn li&ecirc;n quan hoặc kho dữ liệu lớn kh&ocirc;ng gian thời gian) sử dụng hộp xổ xuống  <b>Lưu kết quả v&agrave;o</b>, bạn c&oacute; thể chỉ định t&ecirc;n thư mục trong mục <b>Nội dung của t&ocirc;i</b> để lưu trữ kết quả v&agrave;o.
            </p>
        </div>
    </div>
</div>
</html>
