<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="smallsize">
        <h2>Các Vị trí Mã hóa địa lý từ Bảng</h2><p/>
        <h2><img src="../images/GUID-E4194410-7BBF-4349-98C9-22781D35183E-web.png" alt="C&aacute;c Vị tr&iacute; M&atilde; h&oacute;a địa l&yacute; Từ Bảng"></h2>
        <hr/>
    <p>M&atilde; h&oacute;a địa l&yacute; l&agrave; c&aacute;ch để chuyển c&aacute;c địa chỉ th&agrave;nh c&aacute;c tọa độ. C&ocirc;ng cụ n&agrave;y chuyển c&aacute;c địa chỉ từ bảng, tệp CSV, hay tệp Excel th&agrave;nh lớp đối tượng hoặc tệp đầu ra với c&aacute;c tọa độ như c&aacute;c cột bổ sung.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputTable">
        <div><h2>Chọn một bảng đầu vào</h2></div>
        <hr/>
        <div>
            <p>Bảng đầu v&agrave;o với c&aacute;c địa chỉ đ&atilde; được m&atilde; h&oacute;a địa l&yacute;. Đầu v&agrave;o phải l&agrave; một bảng, một tệp CSV, hay tệp Excel.
            </p>
        </div>
    </div>
    <div id="geocodeServiceURL">
        <div><h2>Chọn một bộ định vị</h2></div>
        <hr/>
        <div>
            <p>Chọn một dịch vụ bộ định vị để chuần bị M&atilde; h&oacute;a địa l&yacute;. Nếu dịch vụ bộ định vị bạn muốn sử dụng kh&ocirc;ng c&oacute; trong menu xổ xuống, h&atilde;y li&ecirc;n hệ với quản trị vi&ecirc;n của bạn để c&oacute; dịch vụ bộ định vị được cấu h&igrave;nh cho quy tr&igrave;nh tự động m&atilde; h&oacute;a địa l&yacute;.  

            </p>
        </div>
    </div>
    <div id="sourceCountry">
        <div><h2>Quốc gia</h2></div>
        <hr/>
        <div>
            <p>Nếu tất cả c&aacute;c địa chỉ của bạn đến từ một quốc gia, h&atilde;y chọn quốc gia đ&oacute; để đảm bảo c&aacute;c kết quả ch&iacute;nh x&aacute;c nhất. Nếu kh&ocirc;ng, h&atilde;y để trống th&ocirc;ng số n&agrave;y.
            </p>
        </div>
    </div>
    <div id="geocodeParameters">
        <div><h2>Chọn các Trường Dữ liệu</h2></div>
        <hr/>
        <div>
            <p>Dịch vụ bộ định vị y&ecirc;u cầu c&aacute;c trường cụ thể trong dữ liệu n&agrave;y, v&iacute; dụ như địa chỉ, th&agrave;nh phố, tiểu bang v&agrave; m&atilde; bưu điện. Nối c&aacute;c trường dữ liệu trong tệp hoặc bảng đầu v&agrave;o với c&aacute;c trường m&agrave; bộ định vị dự kiến sử dụng c&aacute;c hộp xổ xuống. Bạn vạch ra c&agrave;ng nhiều trường, kết quả sẽ c&agrave;ng ch&iacute;nh x&aacute;c. Nếu bảng đầu v&agrave;o c&oacute; tất cả c&aacute;c dữ liệu nằm trong c&ugrave;ng một cột, h&atilde;y chọn  <b>Trường Đơn</b> v&agrave; chọn một trường dữ liệu từ menu xổ xuống. Nếu kh&ocirc;ng, h&atilde;y chọn <b>Đa Trường</b> v&agrave; vạch ra c&aacute;c trường bộ định vị ph&ugrave; hợp với c&aacute;c cột đa trường trong bảng của bạn.
            </p>
        </div>
    </div>
    <div id="outputType">
        <div><h2>Chọn một định dạng đầu ra</h2></div>
        <hr/>
        <div>
            <p>Định dạng của c&aacute;c kết quả đầu ra. Nếu bạn chọn tạo một dịch vụ đối tượng, c&aacute;c địa chỉ từ bảng đầu v&agrave;o sẽ được th&ecirc;m v&agrave;o bản đồ như một lớp c&aacute;c đối tượng điểm. C&aacute;c t&ugrave;y chọn CSV v&agrave; XLS th&ecirc;m c&aacute;c tệp c&oacute; c&aacute;c kết quả của c&ocirc;ng việc m&atilde; h&oacute;a địa l&yacute; đến  <b>Nội dung của T&ocirc;i</b> khi ho&agrave;n th&agrave;nh c&ocirc;ng việc.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Tên kết quả đầu ra</h2></div>
        <hr/>
        <div>
            <p>Đ&acirc;y l&agrave; t&ecirc;n lớp sẽ được tạo trong mục  <b>Nội dung của T&ocirc;i</b> v&agrave; th&ecirc;m v&agrave;o bản đồ. T&ecirc;n mặc định dựa v&agrave;o t&ecirc;n c&ocirc;ng cụ v&agrave; t&ecirc;n lớp đầu v&agrave;o. Nếu t&ecirc;n lớp đ&atilde; tồn tại, bạn sẽ được y&ecirc;u cầu cung cấp t&ecirc;n kh&aacute;c.
            </p>
            <p>Sử dụng chức năng  <b>Lưu kết quả trong</b> menu thả xuống, bạn c&oacute; thể chỉ định t&ecirc;n thư mục trong phần <b>Nội dung của T&ocirc;i</b> nơi sẽ lưu trữ kết quả của bạn.
            </p>
        </div>
    </div>
</div>
</html>
