<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Vytvořit viditelný povrch (Create Viewshed)</h2><p/>
        <h2><img src="../images/GUID-BB8B8CAF-330E-4C41-9D94-AF4728D0D0F3-web.png" alt="N&aacute;stroj Vytvořit viditeln&yacute; povrch"></h2>
        <hr/>
    <p>Tento n&aacute;stroj identifikuje oblasti, kter&eacute; může pozorovatel vidět, podle povrchov&eacute; topografie. Um&iacute;stěn&iacute; vstupn&iacute;ch bodů mohou představovat buď pozorovatele (např. lid&eacute; na zemi nebo hl&iacute;dky v pož&aacute;rn&iacute; věži), nebo pozorovan&eacute; objekty (např. větrn&eacute; turb&iacute;ny, vodojemy, vozidla nebo lid&eacute;). V&yacute;sledky definuj&iacute; oblasti, kter&eacute; lze vidět z&nbsp;m&iacute;sta pozorovatele.
    </p>
    <p>Pozorovatel&eacute; i pozorovan&eacute; objekty mohou m&iacute;t udanou v&yacute;&scaron;ku nad zem&iacute; a tyto v&yacute;&scaron;ky se použ&iacute;vaj&iacute; k&nbsp;určen&iacute; viditelnosti. Např&iacute;klad viditeln&yacute; povrch vypoč&iacute;tan&yacute; pro 100 metrů vysok&eacute; větrn&eacute; turb&iacute;ny a 180 cm vysokou osobu stoj&iacute;c&iacute; na zemi bude zpravidla vět&scaron;&iacute; než viditeln&yacute; povrch vypoč&iacute;tan&yacute; pro 60 m vysok&eacute; turb&iacute;ny a osobu vysokou 150 cm.
    </p>
    <p>V&yacute;sledn&aacute; vrstva zaznamen&aacute;v&aacute;, kolikr&aacute;t je možn&eacute; každ&eacute; um&iacute;stěn&iacute; buňky ve vstupn&iacute;m rastru povrchu vidět ze vstupn&iacute;ch pozorovac&iacute;ch bodů. Neviditeln&yacute;m buňk&aacute;m je přidělena hodnota NoData.
    </p>
    <p>Pokud je za&scaron;krtnuto pole  <b>Použ&iacute;vat aktu&aacute;ln&iacute; rozsah mapy</b>, dojde k&nbsp;anal&yacute;ze pouze rastrov&eacute; oblasti a pozorovac&iacute;ch bodů viditeln&yacute;ch v&nbsp;aktu&aacute;ln&iacute;m rozsahu mapy. Pokud pole za&scaron;krtnuto nen&iacute;, budou analyzov&aacute;ny v&scaron;echny body pozorovatele ve vstupn&iacute; vrstvě, včetně těch, kter&eacute; se nach&aacute;z&iacute; mimo aktu&aacute;ln&iacute; rozsah mapy.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="elevationSurface">
        <div><h2>Povrch reprezentující výšku</h2></div>
        <hr/>
        <div>
            <p>Povrch reprezentuj&iacute;c&iacute; v&yacute;&scaron;ku použit&yacute; pro v&yacute;počet viditeln&eacute;ho povrchu.
            </p>
            <p>Pokud se vertik&aacute;ln&iacute; jednotky vstupn&iacute;ho povrchu li&scaron;&iacute; od horizont&aacute;ln&iacute;ch jednotek, např. když jsou v&yacute;&scaron;kov&eacute; hodnoty uvedeny ve stop&aacute;ch, ale souřadnicov&yacute; syst&eacute;m je v&nbsp;metrech, mus&iacute; m&iacute;t povrch definov&aacute;n v&yacute;&scaron;kov&yacute; souřadnicov&yacute; syst&eacute;m. Důvodem je, že n&aacute;stroj použ&iacute;v&aacute; vertik&aacute;ln&iacute; (Z) a horizont&aacute;ln&iacute; (XY) jednotky k&nbsp;v&yacute;počtu Z-faktoru pro anal&yacute;zu viditelnosti. Bez v&yacute;&scaron;kov&eacute;ho souřadnicov&eacute;ho syst&eacute;mu a potažmo bez dostupn&yacute;ch informac&iacute; o jednotk&aacute;ch Z bude n&aacute;stroj předpokl&aacute;dat, že jednotky Z jsou stejn&eacute; jako jednotky XY. V&nbsp;důsledku toho bude pro anal&yacute;zu použit vnitřn&iacute; Z-faktor s&nbsp;hodnotou 1,0, což může v&eacute;st k&nbsp;nečekan&yacute;m v&yacute;sledkům.
            </p>
            <p>Povrch reprezentuj&iacute;c&iacute; v&yacute;&scaron;ku může b&yacute;t cel&eacute; nebo desetinn&eacute; č&iacute;slo.
            </p>
        </div>
    </div>
    <div id="observerFeatures">
        <div><h2>Bodové prvky, které budou představovat umístění pozorovatele.</h2></div>
        <hr/>
        <div>
            <p>Bodov&eacute; prvky představuj&iacute;c&iacute; um&iacute;stěn&iacute; pozorovatelů při v&yacute;počtu viditeln&eacute;ho povrchu.
            </p>
        </div>
    </div>
    <div id="optimizeFor">
        <div><h2>Optimalizovat pro</h2></div>
        <hr/>
        <div>
            <p>Metoda optimalizace použit&aacute; pro v&yacute;počet viditeln&eacute;ho povrchu.
            </p>
            <ul>
                <li>Speed &mdash; 
Tato metoda optimalizuje rychlost zpracov&aacute;n&iacute; a obětuje trochu přesnosti v&nbsp;z&aacute;jmu vy&scaron;&scaron;&iacute;ho v&yacute;konu. Jedn&aacute; se o v&yacute;choz&iacute; nastaven&iacute;.

                </li>
                <li>Accuracy &mdash; 
Tato metoda optimalizuje přesnost v&yacute;sledků na &uacute;kor doby zpracov&aacute;n&iacute;.

                </li>
            </ul>
        </div>
    </div>
    <div id="maximumDistance">
        <div><h2>Maximální sledovací vzdálenost</h2></div>
        <hr/>
        <div>
            <p>Zadejte hraničn&iacute; vzd&aacute;lenost, za kterou vypoč&iacute;t&aacute;v&aacute;n&iacute; viditeln&yacute;ch oblast&iacute; skonč&iacute;. Za touto vzd&aacute;lenost&iacute; nebude určeno, zda na sebe pozorovac&iacute; body a jin&eacute; objekty vid&iacute;.
            </p>
            <p>Můžete zadat č&iacute;selnou hodnotu představuj&iacute;c&iacute; line&aacute;rn&iacute; vzd&aacute;lenost nebo vybrat č&iacute;seln&eacute; pole ze vstupn&iacute;ch prvků pozorovatele. Když je zad&aacute;no pole, hodnoty v něm obsažen&eacute; mus&iacute; b&yacute;t ve stejn&yacute;ch jednotk&aacute;ch jako jednotky XY vstupn&iacute;ho povrchu nadmořsk&eacute; v&yacute;&scaron;ky.
            </p>
            <p>Mějte na paměti, že vy&scaron;&scaron;&iacute; hodnoty zvy&scaron;uj&iacute; dobu zpracov&aacute;n&iacute;. Pokud nen&iacute; uvedena, bude v&yacute;choz&iacute; maxim&aacute;ln&iacute; vzd&aacute;lenost vypoč&iacute;t&aacute;na na z&aacute;kladě rozli&scaron;en&iacute; a rozsahu vstupn&iacute;ho povrchu reprezentuj&iacute;c&iacute;ho v&yacute;&scaron;ku.
            </p>
            <p>Tento parametr je užitečn&yacute; pro modelov&aacute;n&iacute; určit&yacute;ch jevů. Omezen&iacute;m rozsahu viditelnosti můžete např&iacute;klad modelovat povětrnostn&iacute; podm&iacute;nky, jako je m&iacute;rn&aacute; mlha. Stejně tak v&aacute;m může omezen&iacute; rozsahu viditelnosti poskytnout č&aacute;stečnou kontrolu nad denn&iacute; dobou, protože přibližně simuluje viditelnost za &scaron;era.
            </p>
        </div>
    </div>
    <div id="maximumDistanceField">
        <div><h2>Maximální sledovací vzdálenost</h2></div>
        <hr/>
        <div>
            
        </div>
    </div>
    <div id="minimumDistance">
        <div><h2>Minimální sledovací vzdálenost</h2></div>
        <hr/>
        <div>
            <p>Zadejte hraničn&iacute; vzd&aacute;lenost, za kterou vypoč&iacute;t&aacute;v&aacute;n&iacute; viditeln&yacute;ch oblast&iacute; začne. Buňky na povrchu bliž&scaron;&iacute; než tato vzd&aacute;lenost nejsou viditeln&eacute; ve v&yacute;stupu, ale st&aacute;le mohou blokovat viditelnost buněk mezi minim&aacute;ln&iacute; a maxim&aacute;ln&iacute; sledovac&iacute; vzd&aacute;lenost&iacute;.
            </p>
            <p>Můžete zadat č&iacute;selnou hodnotu představuj&iacute;c&iacute; line&aacute;rn&iacute; vzd&aacute;lenost nebo vybrat č&iacute;seln&eacute; pole ze vstupn&iacute;ch prvků pozorovatele. Když je zad&aacute;no pole, hodnoty v něm obsažen&eacute; mus&iacute; b&yacute;t ve stejn&yacute;ch jednotk&aacute;ch jako jednotky XY vstupn&iacute;ho povrchu nadmořsk&eacute; v&yacute;&scaron;ky.
            </p>
            <p>Tento parametr je užitečn&yacute; pro nastaven&iacute; oblasti anal&yacute;zy viditelnosti na určitou vzd&aacute;lenost od pozorovatele. Pokud např&iacute;klad vyhodnocujete viditelnost ze střechy budovy do vzd&aacute;len&eacute;ho parku, můžete nastavit minim&aacute;ln&iacute; sledovac&iacute; vzd&aacute;lenost, abyste vyloučili bliž&scaron;&iacute; oblasti, kter&eacute; v&aacute;s nezaj&iacute;maj&iacute;, a dos&aacute;hli rychlej&scaron;&iacute;ho zpracov&aacute;n&iacute;.
            </p>
        </div>
    </div>
    <div id="minimumDistanceField">
        <div><h2>Minimální sledovací vzdálenost</h2></div>
        <hr/>
        <div>
            
        </div>
    </div>
    <div id="viewingDistance3D">
        <div><h2>Vzdálenost je 3D</h2></div>
        <hr/>
        <div>
            <p>Určete, zda se parametry minim&aacute;ln&iacute; a maxim&aacute;ln&iacute; sledovac&iacute; vzd&aacute;lenosti měř&iacute; trojrozměrn&yacute;m, nebo jednodu&scaron;&scaron;&iacute;m dvourozměrn&yacute;m způsobem. Když je tato možnost za&scaron;krtnuta, sledovac&iacute; vzd&aacute;lenosti jsou br&aacute;ny jako 3D vzd&aacute;lenost. Když je možnost neza&scaron;krtnuta, jsou br&aacute;ny jako 2D vzd&aacute;lenosti.
            </p> 
            <p>2D vzd&aacute;lenost je jednoduch&aacute; line&aacute;rn&iacute; vzd&aacute;lenost mezi pozorovatelem a c&iacute;lem využ&iacute;vaj&iacute;c&iacute; jejich um&iacute;stěn&iacute; prom&iacute;tnut&eacute; na &uacute;roveň hladiny moře. 3D vzd&aacute;lenost poskytuje realističtěj&scaron;&iacute; hodnotu, protože bere v&nbsp;potaz jejich relativn&iacute; v&yacute;&scaron;ky.
            </p>  
        </div>
    </div>
    <div id="observersElevation">
        <div><h2>Nadmořská výška umístění pozorovatelů</h2></div>
        <hr/>
        <div>
            <p>Zadejte nadmořskou v&yacute;&scaron;ku um&iacute;stěn&iacute; pozorovatelů.
            </p>
            <p>Můžete zadat č&iacute;selnou hodnotu představuj&iacute;c&iacute; nadmořskou v&yacute;&scaron;ku v&scaron;ech pozorovatelů nebo určit pole, kter&eacute; představuje nadmořskou v&yacute;&scaron;ku každ&eacute;ho pozorovatele. Když je zad&aacute;no pole, hodnota v&nbsp;něm obsažen&aacute; mus&iacute; b&yacute;t ve stejn&yacute;ch jednotk&aacute;ch jako jednotky Z vstupn&iacute;ho povrchu reprezentuj&iacute;c&iacute;ho v&yacute;&scaron;ku.
            </p>
        </div>
    </div>
    <div id="observersElevationField">
        <div><h2>Nadmořská výška umístění pozorovatelů</h2></div>
        <hr/>
        <div>
            
        </div>
    </div>
    <div id="observersHeight">
        <div><h2>Výška pozorovatelů</h2></div>
        <hr/>
        <div>
            <p>Zadejte v&yacute;&scaron;ku nad zem&iacute; pro um&iacute;stěn&iacute; pozorovatelů.
            </p> 
            <p>Můžete zadat č&iacute;selnou hodnotu pro v&yacute;&scaron;ku nebo vybrat č&iacute;seln&eacute; pole ze vstupn&iacute;ch prvků pozorovatele. Když je zad&aacute;no pole, hodnota v&nbsp;něm obsažen&aacute; mus&iacute; b&yacute;t ve stejn&yacute;ch jednotk&aacute;ch jako jednotky Z vstupn&iacute;ho povrchu reprezentuj&iacute;c&iacute;ho v&yacute;&scaron;ku.
            </p>
            <p>V&yacute;choz&iacute; hodnota je 6 stop (1,8 metru). Pokud se d&iacute;v&aacute;te z&nbsp;vyv&yacute;&scaron;en&eacute;ho um&iacute;stěn&iacute;, např. rozhledny nebo vysok&eacute; budovy, použijte jeho v&yacute;&scaron;ku. Při v&yacute;počtu viditelnosti bude tato hodnota přičtena k&nbsp;nadmořsk&eacute; v&yacute;&scaron;ce pozorovatele, je-li zad&aacute;na. V opačn&eacute;m př&iacute;padě bude přičtena k&nbsp;interpolovan&eacute; hodnotě Z povrchu.
            </p>
        </div>
    </div>
    <div id="observersHeightField">
        <div><h2>Výška pozorovatelů</h2></div>
        <hr/>
        <div>
            
        </div>
    </div>
    <div id="targetHeight">
        <div><h2>Výška cíle</h2></div>
        <hr/>
        <div>
            <p>Zadejte v&yacute;&scaron;ku struktur nebo lid&iacute; na zemi použitou pro určen&iacute; viditelnosti.
            </p>
            <p>Můžete zadat č&iacute;selnou hodnotu pro v&yacute;&scaron;ku nebo vybrat č&iacute;seln&eacute; pole ze vstupn&iacute;ch prvků pozorovatele. Když je zad&aacute;no pole, hodnota v&nbsp;něm obsažen&aacute; mus&iacute; b&yacute;t ve stejn&yacute;ch jednotk&aacute;ch jako jednotky Z vstupn&iacute;ho povrchu reprezentuj&iacute;c&iacute;ho v&yacute;&scaron;ku.
            </p>
            <p>V&yacute;sledn&aacute; viditelnost identifikuje oblasti, ze kter&yacute;ch může pozorovac&iacute; bod vidět tyto objekty na zemi. Plat&iacute; to i obr&aacute;ceně &ndash; objekty na zemi mohou vidět pozorovac&iacute; bod. 
            </p>
            <p>Zde je několik př&iacute;kladů nastaven&iacute; c&iacute;lov&eacute; v&yacute;&scaron;ky:
            </p>
            <ul>
                <li>Pokud va&scaron;e vstupn&iacute; body představuj&iacute; větrn&eacute; turb&iacute;ny a chcete určit, odkud na ně lid&eacute; stoj&iacute;c&iacute; na zemi mohou vidět, zadejte průměrnou v&yacute;&scaron;ku člověka (přibližně 1,8 metru).
                    

                </li>
                <li>Pokud va&scaron;e vstupn&iacute; body představuj&iacute; pož&aacute;rn&iacute; pozorovac&iacute; věže a chcete určit, ze kter&yacute;ch věž&iacute; je možn&eacute; vidět kouřov&yacute; oblak vysok&yacute; 6 a v&iacute;ce metrů, zadejte jako c&iacute;lovou v&yacute;&scaron;ku 6 metrů.
                    

                </li>
                <li>Pokud va&scaron;e vstupn&iacute; body představuj&iacute; krajinn&eacute; vyhl&iacute;dky pod&eacute;l silnic nebo stezek a chcete určit, kter&eacute; větrn&eacute; turb&iacute;ny vysok&eacute; 130 metrů nebo v&iacute;ce je z&nbsp;nich možn&eacute; vidět, zadejte jako v&yacute;&scaron;ku 130 metrů.
                    

                </li>
                <li>Pokud va&scaron;e vstupn&iacute; body představuj&iacute; krajinn&eacute; vyhl&iacute;dky a chcete určit, kolik zemsk&eacute;ho povrchu mohou lid&eacute; stoj&iacute;c&iacute; na vyhl&iacute;dce vidět, zadejte jako c&iacute;lovou v&yacute;&scaron;ku 0. 
                    

                </li>
            </ul>
            
        </div>
    </div>
    <div id="targetHeightField">
        <div><h2>Výška pozorovatelů</h2></div>
        <hr/>
        <div>
            
        </div>
    </div>
    <div id="resultAglLayer">
        <div><h2>Výstupní výška pro zviditelnění</h2></div>
        <hr/>
        <div>
            <p>N&aacute;zev v&yacute;stupn&iacute;ho v&yacute;sledku nad zem&iacute; (AGL). V&yacute;sledek AGL je rastr, jehož každ&aacute; hodnota buňky je minim&aacute;ln&iacute; v&yacute;&scaron;ka, kterou je nutn&eacute; přič&iacute;st k&nbsp;jinak neviditeln&eacute; buňce, aby ji viděl aspoň jeden pozorovatel. Buňk&aacute;m, kter&eacute; již jsou viditeln&eacute;, je v&nbsp;tomto v&yacute;stupn&iacute;m rastru přiřazena hodnota 0.
            </p>
        </div>
    </div>
    <div id="resultLayer">
        <div><h2>Název výsledné vrstvy</h2></div>
        <hr/>
        <div>
            <p>N&aacute;zev vrstvy, kter&aacute; se vytvoř&iacute; ve složce  <b>Můj obsah</b> a přid&aacute; se do mapy. V&yacute;choz&iacute; n&aacute;zev se ř&iacute;d&iacute; n&aacute;zvem n&aacute;stroje a n&aacute;zvem vstupn&iacute; vrstvy. Pokud vrstva již existuje, budete pož&aacute;d&aacute;ni o zad&aacute;n&iacute; jin&eacute;ho n&aacute;zvu.
            </p>
            <p>Můžete zadat n&aacute;zev složky v  <b>Můj obsah</b>, kde bude v&yacute;sledek uložen pomoc&iacute; rozbalovac&iacute;ho seznamu <b>Uložit v&yacute;sledek do</b> .
            </p>
        </div>
    </div>
</div>
</html>
