<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Spojit vrstvy (Merge Layers)</h2><p/>
        <h2><img src="../images/GUID-BDDD6517-4EE7-4EEC-AE15-15DD9B709131-web.png" alt="Spojit vrstvy"></h2>
        <hr/>
    <p>Tento n&aacute;stroj zkombinuje vrstvy prvků do jedin&eacute; v&yacute;stupn&iacute; vrstvy. Vrstvy ke spojen&iacute; mus&iacute; m&iacute;t stejn&yacute; typ geometrie a typ času. Můžete zvolit způsob, jak&yacute;m se maj&iacute; vstupn&iacute; vrstvy spojit a kop&iacute;rovat. Např&iacute;klad:
        <ul>
            <li>M&aacute;te tři vrstvy pro Anglii, Wales a Skotsko a potřebujete jedinou vrstvu &ndash; Velkou Brit&aacute;nii. 
            </li>
            <li>M&aacute;te 2 vrstvy a každ&aacute; obsahuje informace o parcel&aacute;ch pro souvisl&eacute; městsk&eacute; oblasti. Potřebujete je sloučit do jedin&eacute; vrstvy a ponechat pouze pole, kter&aacute; maj&iacute; ve 2 vstupn&iacute;ch vrstv&aacute;ch stejn&yacute; n&aacute;zev a typ.
            </li>
        </ul>
        
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Vybrat vrstvu</h2></div>
        <hr/>
        <div>
            <p>Vrstva s tabulkov&yacute;mi, bodov&yacute;mi, liniov&yacute;mi nebo plo&scaron;n&yacute;mi prvky, kter&aacute; bude spojena s druhou vrstvou prvků.V&scaron;echna pole z t&eacute;to vrstvy budou obsažena ve v&yacute;stupn&iacute; vrstvě.
            </p>
        </div>
    </div>
    <div id="mergeLayer">
        <div><h2>Vyberte vrstvu ke spojení</h2></div>
        <hr/>
        <div>
            <p>Vrstva prvků, kter&aacute; se spoj&iacute; se vstupn&iacute; vrstvou. Vrstva ke spojen&iacute; mus&iacute; obsahovat stejn&yacute; typ geometrie a času jako vstupn&iacute; vrstva.
            </p>
        </div>
    </div>
    <div id="mergingAttributes">
        <div><h2>Upravit pole pro spojení</h2></div>
        <hr/>
        <div>
            <p>Při v&yacute;choz&iacute;m nastaven&iacute; budou do v&yacute;stupu zahrnuta v&scaron;echna pole z obou vstupn&iacute;ch vrstev. Můžete změnit způsob, jak&yacute;m se budou pole z vrstvy ke spojen&iacute; do v&yacute;stupu přen&aacute;&scaron;et:
                <ul>
                    <li> <b>Přejmenovat</b> &ndash; Pole se na v&yacute;stupu přejmenuje.
                    </li>
                    <li> <b>Odebrat</b> &ndash; Pole se z v&yacute;stupu odstran&iacute;.
                    </li>
                    <li> <b>Přiřadit</b> &ndash; N&aacute;zvy pol&iacute; budou shodn&eacute;.  Hodnota pole z vrstvy určen&eacute; ke spojen&iacute; se zkop&iacute;ruje do odpov&iacute;daj&iacute;c&iacute;ho v&yacute;stupn&iacute;ho pole.
                    </li>
                </ul>
                
            </p>
            <p>Pokud obě vrstvy obsahuj&iacute; pole se stejn&yacute;m n&aacute;zvem a typem dat, spoj&iacute; se obsah obou pol&iacute; do jednoho pole s t&iacute;mto n&aacute;zvem. To neplat&iacute; pro pole, kde se použ&iacute;v&aacute;  <b>Přiřadit</b> v parametru <b>Upravit pole pro spojen&iacute;</b>.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Název výsledné vrstvy</h2></div>
        <hr/>
        <div>
            <p> N&aacute;zev vytv&aacute;řen&eacute; vrstvy. Pokud zapisujete ArcGIS Data Store, va&scaron;e v&yacute;sledky budou uloženy v  <b>Můj obsah</b> a přid&aacute;ny na mapu. Pokud zapisujete sd&iacute;len&yacute; soubor velk&yacute;ch dat, va&scaron;e v&yacute;sledky budou uloženy ve sd&iacute;len&eacute;m souboru velk&yacute;ch dat a přid&aacute;ny do jejich manifestu.  Nebudou přid&aacute;ny na mapu. V&yacute;choz&iacute; n&aacute;zev se ř&iacute;d&iacute; n&aacute;zvem n&aacute;stroje a n&aacute;zvem vstupn&iacute; vrstvy. Pokud vrstva již existuje, n&aacute;stroj selže.
            </p>
            <p>Když zapisujete do   ArcGIS Data Store  (datov&eacute; &uacute;loži&scaron;tě relačn&iacute;ch a časoprostorov&yacute;ch velk&yacute;ch dat) pomoc&iacute; rozbalovac&iacute;ho seznamu  <b>Uložit v&yacute;sledek do</b> , můžete zadat n&aacute;zev složky v <b>Můj obsah</b>, kde budou v&yacute;sledky uloženy.
            </p>
        </div>
    </div>
</div>
</html>
