<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Souhrn hodnot v okolí (Summarize Nearby)</h2><p/>
        <h2><img src="../images/GUID-A5033D27-81B6-42E7-BA38-50D25C1CCCCA-web.png" alt="Souhrn hodnot v okol&iacute;"></h2>
        <hr/>
    <p>Tento n&aacute;stroj vyhled&aacute;v&aacute; a shrnuje prvky, kter&eacute; se nach&aacute;zej&iacute; v určen&eacute; vzd&aacute;lenosti od prvků v prvn&iacute; vstupn&iacute; vrstvě. Vzd&aacute;lenost lze měřit vzdu&scaron;nou čarou nebo podle zvolen&eacute;ho způsobu přepravy. Mezi možnosti způsobu přepravy patř&iacute;: vzd&aacute;lenost j&iacute;zdy autem, doba j&iacute;zdy autem, vzd&aacute;lenost j&iacute;zdy n&aacute;kladn&iacute;m vozem, doba j&iacute;zdy n&aacute;kladn&iacute;m vozem, vzd&aacute;lenost chůze a doba chůze. Pot&eacute; se vypoč&iacute;taj&iacute; statistiky pro nejbliž&scaron;&iacute; prvky. Např&iacute;klad
        <ul>
            <li>Spoč&iacute;tej celkov&yacute; počet obyvatel, kteř&iacute; žij&iacute; v&nbsp;pětiminutov&eacute; dojezdov&eacute; vzd&aacute;lenosti od navrhovan&eacute;ho um&iacute;stěn&iacute; nov&eacute;ho obchodu.
            </li>
            <li>Změř dostupnost obchodu zji&scaron;těn&iacute;m počtu n&aacute;jezdů, kter&eacute; se nach&aacute;zej&iacute; do dvou kilometrů j&iacute;zdn&iacute; vzd&aacute;lenosti od navrhovan&eacute;ho um&iacute;stěn&iacute; nov&eacute;ho obchodu.
            </li>
        </ul>
        
    </p>
    <p>Pokud je za&scaron;krtnuto pole  <b>Použ&iacute;t rozsah aktu&aacute;ln&iacute; mapy</b>, budou analyzov&aacute;ny pouze prvky ve vstupn&iacute; vrstvě a v sumarizovan&eacute; vrstvě, kter&eacute; jsou viditeln&eacute; v rozsahu aktu&aacute;ln&iacute; mapy.  Pokud toto pole za&scaron;krtnuto nen&iacute;, budou analyzov&aacute;ny v&scaron;echny prvky ve vstupn&iacute; a sumarizovan&eacute; vrstvě, včetně těch, kter&eacute; se nach&aacute;z&iacute; mimo aktu&aacute;ln&iacute; rozsah mapy.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="sumNearbyLayer">
        <div><h2>Vyberte vrstvu, od které budou měřeny vzdálenosti k prvkům ve vrstvě určené k sumarizaci.</h2></div>
        <hr/>
        <div>
            <p>Vrstva bodů, lini&iacute; nebo polygonů, kter&aacute; se použije k určen&iacute; poč&aacute;tečn&iacute;ch um&iacute;stěn&iacute; pro sumarizaci okoln&iacute;ch prvků.
            </p>
            <p>Vrstvu můžete vybrat ze sv&eacute; mapy nebo můžete zvolit možnost  <b>Vybrat vrstvu anal&yacute;zy</b>, kter&aacute; se nach&aacute;z&iacute; na konci rozbalovac&iacute;ho seznamu. Pomoc&iacute; t&eacute;to možnosti se otevře galerie, kde můžete proch&aacute;zet a&nbsp;vyb&iacute;rat datov&eacute; sady z&nbsp;různ&yacute;ch vrstev, kter&eacute; můžete použ&iacute;t ve sv&eacute; anal&yacute;ze. 
            </p>
            <p>N&aacute;stroj podporuje až 1 000 prvků v př&iacute;slu&scaron;n&eacute; vrstvě. 
            </p>
        </div>
    </div>
    <div id="Summarize">
        <div><h2>Vybrat vrstvu pro souhrn</h2></div>
        <hr/>
        <div>
            <p>Shrnuty budou prvky v t&eacute;to vrstvě spadaj&iacute;c&iacute; do určen&eacute; vzd&aacute;lenosti od prvků ve vrstvě určen&eacute; v&yacute;&scaron;e. 
            </p>
            <p>Vrstvu můžete vybrat ze sv&eacute; mapy nebo můžete zvolit možnost  <b>Vybrat vrstvu anal&yacute;zy</b>, kter&aacute; se nach&aacute;z&iacute; na konci rozbalovac&iacute;ho seznamu. Pomoc&iacute; t&eacute;to možnosti se otevře galerie, kde můžete proch&aacute;zet a&nbsp;vyb&iacute;rat datov&eacute; sady z&nbsp;různ&yacute;ch vrstev, kter&eacute; můžete použ&iacute;t ve sv&eacute; anal&yacute;ze. 
            </p> 
        </div>
    </div>
    <div id="BufferOption">
        <div><h2>Shrnout nejbližší prvky pomocí</h2></div>
        <hr/>
        <div>
            <p> Můžete definovat, jak&yacute; druh měřen&iacute; vzd&aacute;lenosti chcete použ&iacute;t: vzdu&scaron;nou čarou nebo pomoc&iacute; zvolen&eacute;ho způsobu přepravy. Způsoby přepravy lze použ&iacute;t pouze v př&iacute;padě, že prvn&iacute; vstupn&iacute; vrstva (vrstva, od kter&eacute; jsou měřeny vzd&aacute;lenosti) obsahuje body.  Dostupn&eacute; způsoby přepravy jsou určeny administr&aacute;torem organizace. Při použit&iacute; jednoho ze způsobů přepravy je vzd&aacute;lenost měřena pod&eacute;l silnic nebo chodn&iacute;ků a jsou respektov&aacute;na př&iacute;slu&scaron;n&aacute; pravidla, např&iacute;klad jednosměrn&eacute; ulice, nepovolen&eacute; man&eacute;vry atd. <b>Doba j&iacute;zdy</b>, <b>Doba j&iacute;zdy ve venkovsk&yacute;ch oblastech</b> a <b>Doba j&iacute;zdy n&aacute;kladn&iacute;m vozidlem</b> respektuje va&scaron;i volbu způsobu určov&aacute;n&iacute; rychlosti dopravy: na z&aacute;kladě aktu&aacute;ln&iacute;ch, nebo obvykl&yacute;ch dopravn&iacute;ch podm&iacute;nek. Aktu&aacute;ln&iacute; rychlosti jsou z&iacute;sk&aacute;v&aacute;ny prostřednictv&iacute;m živ&yacute;ch &uacute;dajů ze senzorů. Obvykl&eacute; rychlosti se vypoč&iacute;t&aacute;vaj&iacute; z historick&yacute;ch průměrů.
            </p>
            <p>Můžete zadat v&iacute;ce vzd&aacute;lenost&iacute;. Shrnuty budou prvky spadaj&iacute;c&iacute; do zadan&yacute;ch vzd&aacute;lenost&iacute; (nebo prvky ve vzd&aacute;lenosti shodn&eacute;).  
            </p>
            <p>Pokud je za&scaron;krtnuto pole  <b>Vr&aacute;tit hraničn&iacute; oblasti</b>, bude vr&aacute;cena v&yacute;sledn&aacute; vrstva plochy definovan&eacute; určen&yacute;m měřen&iacute;m vzd&aacute;lenosti. V&yacute;sledn&aacute; vrstva bude zahrnovat v&scaron;echny požadovan&eacute; souhrnn&eacute; informace. Např&iacute;klad při shrnut&iacute; bl&iacute;zk&yacute;ch bodů a použit&iacute; <b>Vzd&aacute;lenosti po linii</b> 8 km bude v&yacute;sledek obsahovat oblasti v okruhu 8 km kolem vstupn&iacute;ch prvků a v&scaron;echny souhrnn&eacute; informace, jako je počet bodů a přidan&eacute; statistiky. Pokud pole nen&iacute; za&scaron;krtnuto, vr&aacute;t&iacute; v&yacute;sledn&aacute; vrstva stejn&eacute; prvky jako prvn&iacute; vstupn&iacute; vrstva se v&scaron;emi požadovan&yacute;mi souhrnn&yacute;mi informacemi.
            </p>
        </div>
    </div>
    <div id="StatisticsPoint">
        <div><h2>Přidat statistiky z vrstvy k sumarizaci</h2></div>
        <hr/>
        <div>
            <p>Volitelně můžete spoč&iacute;tat statistiky jak&yacute;chkoliv č&iacute;seln&yacute;ch atributů nejbliž&scaron;&iacute;ch bodů. 
            </p>
            <p>Pokud za&scaron;krtnete pole  <b>Počet bodů</b>, bude vypoč&iacute;t&aacute;n celkov&yacute; počet nejbliž&scaron;&iacute;ch bodů.  Kromě toho můžete tak&eacute; spoč&iacute;tat statistiky č&iacute;seln&yacute;ch pol&iacute; nejbliž&scaron;&iacute;ch bodů.
            </p>
            <ul>
                <li> <b>Suma</b> &ndash; Celkov&aacute; hodnota určen&eacute;ho pole.
                </li>
                <li> <b>Průměr</b> &ndash; Průměrn&aacute; hodnota určen&eacute;ho pole.
                </li>
                <li> <b>Minimum</b> &ndash; Nejniž&scaron;&iacute; hodnota v&nbsp;určen&eacute;m poli.
                </li>
                <li> <b>Maximum</b> &ndash; Nejvy&scaron;&scaron;&iacute; hodnota v&nbsp;určen&eacute;m poli.
                </li>
                <li> <b>Směrodatn&aacute; odchylka</b> &ndash; Směrodatn&aacute; odchylka hodnot v&nbsp;určen&eacute;m poli.
                </li>
            </ul>
            
            <p>Pokud vrstva, kter&aacute; m&aacute; b&yacute;t sumarizov&aacute;na, nem&aacute; ž&aacute;dn&aacute; č&iacute;seln&aacute; pole, nebudou dal&scaron;&iacute; statistiky k dispozici.
            </p>
        </div>
    </div>
    <div id="StatisticsLine">
        <div><h2>Přidat statistiky z vrstvy k sumarizaci</h2></div>
        <hr/>
        <div>
            <p>Volitelně můžete spoč&iacute;tat statistiky jak&yacute;chkoliv č&iacute;seln&yacute;ch atributů nejbliž&scaron;&iacute;ch lini&iacute;. 
            </p>
            <p>Pokud za&scaron;krtnete pole  <b>Celkov&aacute; d&eacute;lka</b>, bude vypoč&iacute;t&aacute;na celkov&aacute; d&eacute;lka nejbliž&scaron;&iacute;ch lini&iacute;.  Kromě toho můžete tak&eacute; spoč&iacute;tat statistiky č&iacute;seln&yacute;ch pol&iacute; nejbliž&scaron;&iacute;ch lini&iacute;.
            </p>
            <ul>
                <li> <b>Suma</b> &ndash; Celkov&aacute; hodnota určen&eacute;ho pole.
                </li>
                <li> <b>Průměr</b> &ndash; Průměrn&aacute; hodnota určen&eacute;ho pole.
                </li>
                <li> <b>Minimum</b> &ndash; Nejniž&scaron;&iacute; hodnota v&nbsp;určen&eacute;m poli.
                </li>
                <li> <b>Maximum</b> &ndash; Nejvy&scaron;&scaron;&iacute; hodnota v&nbsp;určen&eacute;m poli.
                </li>
                <li> <b>Směrodatn&aacute; odchylka</b> &ndash; Směrodatn&aacute; odchylka hodnot v&nbsp;určen&eacute;m poli.
                </li>
            </ul>
            
            <p>Pokud vrstva, kter&aacute; m&aacute; b&yacute;t sumarizov&aacute;na, nem&aacute; ž&aacute;dn&aacute; č&iacute;seln&aacute; pole, nebudou dal&scaron;&iacute; statistiky k dispozici.
            </p>
        </div>
    </div>
    <div id="StatisticsPolygon">
        <div><h2>Přidat statistiky z vrstvy pro souhrn</h2></div>
        <hr/>
        <div>
            <p>Volitelně můžete spoč&iacute;tat statistiky jak&yacute;chkoliv č&iacute;seln&yacute;ch atributů nejbliž&scaron;&iacute;ch ploch. 
            </p>
            <p>Pokud za&scaron;krtnete pole  <b>Celkov&aacute; rozloha</b>, bude vypoč&iacute;t&aacute;na celkov&aacute; rozloha nejbliž&scaron;&iacute;ch prvků.  Kromě toho můžete tak&eacute; spoč&iacute;tat statistiky č&iacute;seln&yacute;ch pol&iacute; nejbliž&scaron;&iacute;ch prvků.
            </p>
            <ul>
                <li> <b>Suma</b> &ndash; Celkov&aacute; hodnota určen&eacute;ho pole.
                </li>
                <li> <b>Průměr</b> &ndash; Průměrn&aacute; hodnota určen&eacute;ho pole.
                </li>
                <li> <b>Minimum</b> &ndash; Nejniž&scaron;&iacute; hodnota v&nbsp;určen&eacute;m poli.
                </li>
                <li> <b>Maximum</b> &ndash; Nejvy&scaron;&scaron;&iacute; hodnota v&nbsp;určen&eacute;m poli.
                </li>
                <li> <b>Směrodatn&aacute; odchylka</b> &ndash; Směrodatn&aacute; odchylka hodnot v&nbsp;určen&eacute;m poli.
                </li>
            </ul>
            
            <p>Pokud vrstva, kter&aacute; m&aacute; b&yacute;t sumarizov&aacute;na, nem&aacute; ž&aacute;dn&aacute; č&iacute;seln&aacute; pole, nebudou dal&scaron;&iacute; statistiky k dispozici.
            </p>
        </div>
    </div>
    <div id="StatisticsNoLayer">
        <div><h2>Přidat statistiky z vrstvy pro souhrn</h2></div>
        <hr/>
        <div>
            <p>Po v&yacute;běru vrstvy pro souhrn můžete volitelně vypoč&iacute;tat statistiky libovoln&yacute;ch č&iacute;seln&yacute;ch atributů okoln&iacute;ch bodů, lini&iacute; či oblast&iacute;. 
            </p>
            <ul>
                <li> <b>Suma</b> &ndash; Celkov&aacute; hodnota určen&eacute;ho pole.
                </li>
                <li> <b>Průměr</b> &ndash; Průměrn&aacute; hodnota určen&eacute;ho pole.
                </li>
                <li> <b>Minimum</b> &ndash; Nejniž&scaron;&iacute; hodnota v&nbsp;určen&eacute;m poli.
                </li>
                <li> <b>Maximum</b> &ndash; Nejvy&scaron;&scaron;&iacute; hodnota v&nbsp;určen&eacute;m poli.
                </li>
                <li> <b>Směrodatn&aacute; odchylka</b> &ndash; Směrodatn&aacute; odchylka hodnot v&nbsp;určen&eacute;m poli.
                </li>
            </ul>
            
            <p>Podle toho, jak&eacute; typy prvků shrnujete, je možno vypoč&iacute;tat celkov&yacute; počet okoln&iacute;ch bodů, celkovou d&eacute;lku okoln&iacute;ch lini&iacute; nebo celkovou rozlohu okoln&iacute;ch prvků oblasti.
            </p>
            <p>Pokud vrstva, kter&aacute; m&aacute; b&yacute;t sumarizov&aacute;na, nem&aacute; ž&aacute;dn&aacute; č&iacute;seln&aacute; pole, nebudou dal&scaron;&iacute; statistiky k dispozici.
            </p>
        </div>
    </div>
    <div id="GroupBy">
        <div><h2>Vybrat pole k seskupení</h2></div>
        <hr/>
        <div>
            <p> Toto je atribut bl&iacute;zk&yacute;ch prvků, kter&yacute; lze použ&iacute;t k v&yacute;počtu samostatn&yacute;ch statistik pro každou jedinečnou hodnotu atributu. Předpokl&aacute;dejme např&iacute;klad, že prvn&iacute; vstupn&iacute; vrstva (vrstva, od kter&eacute; jsou měřeny vzd&aacute;lenosti) obsahuje informace o voln&yacute;ch parcel&aacute;ch a nejbliž&scaron;&iacute; prvky jsou tvořeny obrysy budov.  Jeden z atributů obrysů budov je <i>UseType</i>, kter&yacute; obsahuje např. hodnoty OBCHODN&Iacute;, OBYTN&Eacute;, PRŮMYSLOV&Eacute;, VEŘEJN&Eacute; atd. Chcete-li popsat budovy, kter&eacute; se nach&aacute;zej&iacute; pobl&iacute;ž voln&yacute;ch parcel, podle způsobu jejich využit&iacute;, můžete pomoc&iacute; atributu <i>UseType</i> budovy seskupit a spoč&iacute;tat celkovou rozlohu každ&eacute;ho způsobu využit&iacute; budov nach&aacute;zej&iacute;c&iacute;ch se nejd&aacute;le dva kilometry od voln&yacute;ch parcel.   Statistiky pro každou skupinu se spolu s počtem bl&iacute;zk&yacute;ch prvků zobraz&iacute; ve vyskakovac&iacute;m okně v&yacute;sledn&eacute; vrstvy.
            </p>    
        </div>
    </div>
    <div id="MinorityMajority">
        <div><h2>Přidat menšinu, většinu</h2></div>
        <hr/>
        <div>
            <p>Toto za&scaron;krt&aacute;vac&iacute; pol&iacute;čko se aktivuje, když zvol&iacute;te pole k seskupen&iacute;. Chcete-li zjistit, kter&eacute; hodnoty atributů v každ&eacute; skupině představuj&iacute; v r&aacute;mci zadan&eacute; vzd&aacute;lenosti či času men&scaron;inu (nejm&eacute;ně dominantn&iacute;) nebo vět&scaron;inu (nejdominantněj&scaron;&iacute;), zvolte možnost  <b>Přidat men&scaron;inu, vět&scaron;inu</b>.   Když vyberete možnost <b>Přidat men&scaron;inu, vět&scaron;inu</b>, do v&yacute;sledn&eacute; vrstvy budou přid&aacute;na dvě nov&aacute; pole.   Pokud vyberete i možnost <b>Přidat procenta</b>, budou do v&yacute;sledn&eacute; vrstvy přid&aacute;na dvě dodatečn&aacute; pole obsahuj&iacute;c&iacute; procentu&aacute;ln&iacute; pod&iacute;l men&scaron;inov&yacute;ch a vět&scaron;inov&yacute;ch hodnot atributů v&nbsp;r&aacute;mci každ&eacute; skupiny.
            </p>
            <ul>
                <li>Poč&iacute;t&aacute;te-li souhrn bodů v okol&iacute;, vypoč&iacute;t&aacute;vaj&iacute; se hodnoty men&scaron;iny a vět&scaron;iny na z&aacute;kladě počtu bodů v r&aacute;mci zadan&eacute; vzd&aacute;lenosti nebo času.
                </li>
                <li>Poč&iacute;t&aacute;te-li souhrn lini&iacute; v okol&iacute;, vypoč&iacute;t&aacute;vaj&iacute; se hodnoty men&scaron;iny a vět&scaron;iny na z&aacute;kladě d&eacute;lky lini&iacute; v r&aacute;mci zadan&eacute; vzd&aacute;lenosti nebo času.  
                </li>
                <li>Poč&iacute;t&aacute;te-li souhrn ploch v okol&iacute;, vypoč&iacute;t&aacute;vaj&iacute; se hodnoty men&scaron;iny a vět&scaron;iny na z&aacute;kladě ploch v r&aacute;mci zadan&eacute; vzd&aacute;lenosti nebo času.
                </li>
            </ul>
             
        </div>
    </div>
    <div id="PercentShape">
        <div><h2>Přidat procenta</h2></div>
        <hr/>
        <div>
            <p>Toto za&scaron;krt&aacute;vac&iacute; pol&iacute;čko se aktivuje, když zvol&iacute;te pole k seskupen&iacute;. Zvolte  <b>Přidat procenta</b>, pokud chcete zjistit procentu&aacute;ln&iacute; pod&iacute;l každ&eacute; hodnoty atributu pro každou skupinu. Do v&yacute;sledn&eacute; tabulky bude přid&aacute;no nov&eacute; pole obsahuj&iacute;c&iacute; procentu&aacute;ln&iacute; pod&iacute;l každ&eacute; hodnoty atributu pro každou skupinu. Pokud je za&scaron;krtnuto i pol&iacute;čko <b>Přidat men&scaron;inu, vět&scaron;inu</b>, budou do v&yacute;sledn&eacute; vrstvy přid&aacute;na dvě dodatečn&aacute; pole obsahuj&iacute;c&iacute; procentu&aacute;ln&iacute; pod&iacute;l men&scaron;inov&yacute;ch a vět&scaron;inov&yacute;ch hodnot atributů v r&aacute;mci každ&eacute; skupiny.
            </p>
        </div>
    </div>
    <div id="OutputName">
        <div><h2>Název výsledné vrstvy</h2></div>
        <hr/>
        <div>
            <p>Toto je n&aacute;zev vrstvy, kter&aacute; se vytvoř&iacute; ve složce  <b>Můj obsah</b> a přid&aacute; do mapy.  V&yacute;choz&iacute; n&aacute;zev se ř&iacute;d&iacute; n&aacute;zvem n&aacute;stroje a n&aacute;zvem vstupn&iacute; vrstvy. Pokud n&aacute;zev vrstvy již existuje, budete pož&aacute;d&aacute;ni o zad&aacute;n&iacute; jin&eacute;ho n&aacute;zvu.
            </p>
            <p>V rozbalovac&iacute; nab&iacute;dce  <b>Uložit v&yacute;sledek do</b> můžete zadat n&aacute;zev složky ve složce <b>Můj obsah</b>, do kter&eacute; se m&aacute; v&yacute;sledek uložit.
            </p>
        </div>
    </div>
</div>
</html>
