<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Agregar Pontos</h2><p/>
        <h2><img src="../images/GUID-6C1620D9-D176-41FA-8283-833D8B1CCCFC-web.png" alt="Agregar Pontos"></h2>
        <hr/>
    <p>Esta ferramenta trabalha com uma camada de fei&ccedil;&otilde;es de ponto e uma camada de fei&ccedil;&otilde;es de &aacute;rea.  As fei&ccedil;&otilde;es de &aacute;rea de entrada podem ser de uma camada de pol&iacute;gono ou podem ser caixas quadradas ou hexagonais calculadas quando a ferramenta &eacute; executada. A ferramenta primeira determina quais pontos caem dentro de cada &aacute;rea especificada. Ap&oacute;s determinar este relacionamento espacial do ponto na &aacute;rea, as estat&iacute;sticas sobre todos os pontos na &aacute;rea s&atilde;o calculadas e atribu&iacute;das para a &aacute;rea. A estat&iacute;stica mais b&aacute;sica &eacute; a contagem do n&uacute;mero de pontos dentro da &aacute;rea, mas voc&ecirc; tamb&eacute;m pode obter outras estat&iacute;sticas. 

    </p>
    <p>Por exemplo, suponha que voc&ecirc; tenha fei&ccedil;&otilde;es de ponto dos locais das cafeterias e fei&ccedil;&otilde;es de &aacute;rea dos munic&iacute;pios, e voc&ecirc; deseja resumir as vendas de caf&eacute; por munic&iacute;pio. Assumindo que as cafeterias t&ecirc;m um atributo  <i>TOTAL_SALES</i>, voc&ecirc; pode obter a soma de todos <i>TOTAL_SALES</i> dentro de cada munic&iacute;pio ou o <i>TOTAL_SALES</i> m&iacute;nimo ou m&aacute;ximo
 dentro de cada munic&iacute;pio, ou outra estat&iacute;stica como contagem, intervalo, desvio padr&atilde;o e vari&acirc;ncia.
    </p>
    <p>Esta ferramenta tamb&eacute;m pode trabalhar com dados que s&atilde;o habilitados ao tempo. Se o tempo estiver habilitado nos pontos de entrada, ent&atilde;o as op&ccedil;&otilde;es para dividir o tempo estar&atilde;o dispon&iacute;veis. A divis&atilde;o do tempo permite a voc&ecirc; calcular a rela&ccedil;&atilde;o do ponto na &aacute;rea ao visualizar uma parte espec&iacute;fica no tempo. Por exemplo, voc&ecirc; pode visualizar os intervalos de uma hora, o que resultar&aacute; em sa&iacute;das para cada hora. 
    </p>
    <p>Para um exemplo com tempo, suponha que voc&ecirc; tenha fei&ccedil;&otilde;es de ponto de cada transa&ccedil;&atilde;o feita em v&aacute;rios locais de cafeteria e nenhuma camada de &aacute;rea. Os dados foram registrados ao longo de um ano e cada transa&ccedil;&atilde;o tem um local e um espa&ccedil;o de tempo. Assumindo que cada transa&ccedil;&atilde;o tem um atributo  <i>TOTAL_SALES</i>, voc&ecirc; pode obter a soma de todos os atributos <i>TOTAL_SALES</i> dentro do espa&ccedil;o e tempo de interesse. Se estas transa&ccedil;&otilde;es forem para uma &uacute;nica cidade, poderiamos gerar &aacute;reas que s&atilde;o grades de 1 quil&ocirc;metro e visualizar partes de tempo semanalmente para resumir as transa&ccedil;&otilde;es em ambos o espa&ccedil;o e tempo.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="pointLayer">
        <div><h2>Escolha a camada contendo pontos para agregar nas áreas</h2></div>
        <hr/>
        <div>
            <p>A camada de ponto que ser&aacute; agregada nas &aacute;reas. As camadas de pontos que s&atilde;o agregadas nas caixas  <b>Quadrado </b> ou <b>Hex&aacute;gono</b> devem ter a refer&ecirc;ncia de processamento espacial definida para um sistema de coordenadas plana utilizando os <b>Ambientes de An&aacute;lise</b>.
            </p>
            <p>Al&eacute;m de escolher uma camada do seu mapa, voc&ecirc; pode selecionar  <b>Escolher Camada de An&aacute;lise</b> na parte inferior da lista suspensa para procurar por seu conte&uacute;do para um conjunto de dados de compartilhamento do arquivo de grandes dados ou camada de fei&ccedil;&atilde;o.
            </p>
        </div>
    </div>
    <div id="inputAggregation">
        <div><h2>Escolha uma camada de área para agregar</h2></div>
        <hr/>
        <div>
            <p>As &aacute;reas nas quais ser&atilde;o agregada as camadas de ponto. Voc&ecirc; pode escolher entre uma camada de &aacute;rea que voc&ecirc; fornece ou caixas que s&atilde;o geradas quando a ferramenta &eacute; executada.   Ao gerar caixas, para  <b>Quadrado</b>, o n&uacute;mero e unidades especificadas determinam a altura e comprimento do quadrado. Para <b>Hex&aacute;gono</b>, o n&uacute;mero e unidades especificadas determina a dist&acirc;ncia entre os lados paralelos.
            </p>
            <p>An&aacute;lise utilizando caixas  <b>Quadrado </b> ou <b>Hex&aacute;gono</b> exige um sistema de coordenadas plana. Voc&ecirc; pode configurar o <b>Processamento de sistema de coordenadas</b> nos <b>Ambientes de An&aacute;lise</b>. Se seu processamento de sistema de coordenadas n&atilde;o estiver configurado para um sistema de coordenada plana, voc&ecirc; ser&aacute; solicitado para defin&iacute;-lo quando voc&ecirc; <b>Executar An&aacute;lise</b> .
            </p>
        </div>
    </div>
    <div id="polygonLayer">
        <div><h2>Escolha uma camada de área para agregar</h2></div>
        <hr/>
        <div>
            <p>A camada de &aacute;rea na qual os pontos ser&atilde;o agregados. Quaisquer pontos que ca&iacute;rem dentro dos limites de &aacute;reas nesta camada ser&atilde;o contados e opcionalmente resumidos utilizando suas op&ccedil;&otilde;es de estat&iacute;stica. 
            </p>
            <p> <b>Tamanho da Caixa</b> para caixas ou <b>Camada de &Aacute;rea</b> deve ser configurado.
            </p>
        </div>
    </div>
    <div id="inputBins">
        <div><h2>Escolha uma distância para gerar bandeijas e agregar</h2></div>
        <hr/>
        <div>
            <p>A dist&acirc;ncia utilizada para gerar bandejas para agregar seus pontos de entrada. Para uma bandeja quadrada, o tamanho representa a altura do quadrado. Para hex&aacute;gono, o tamanho representa a altura do hex&aacute;gono (a partir dos lados paralelos).  
            </p>
            <p> <b>Tamanho da Caixa</b> para caixas ou <b>Camada de &Aacute;rea</b> deve ser configurado.
            </p>
        </div>
    </div>
    <div id="timeSlicing">
        <div><h2>Agregar utilizando partes de tempo (opcional)</h2></div>
        <hr/>
        <div>
            <p>Se o tempo estiver habilitado na camada de ponto de entrada e for do tipo momento, voc&ecirc; poder&aacute; analisar utilizando partes do tempo.  H&aacute; tr&ecirc;s par&acirc;metros que voc&ecirc; pode configurar ao utilizar o tempo:
                <ul>
                    <li> <b>Intervalo de tempo</b>
                    </li>
                    <li> <b>Com que frequ&ecirc;ncia repetir o intervalo de tempo</b>
                    </li>
                    <li> <b>Tempo para alinhar intervalos de tempo para</b>
                    </li>
                </ul>
                
            </p>
            <p>Por exemplo, se voc&ecirc; tiver dados que representam um ano no tempo e deseja analis&aacute;-los  utilizando etapas semanais, configure  <b>Intervalo de etapa de tempo</b> para <code>1 semana</code>. 
            </p>
            <p>Por exemplo, se voc&ecirc; tiver  dados que representam um ano no tempo e deseja para analis&aacute;-los   utilizando a primeira semana do m&ecirc;s, configure  <b>Intervalo de etapa de tempo</b> para <code>1 semana</code>, <b>Com que frequ&ecirc;ncia repetir a etapa de tempo</b> para <code>1 m&ecirc;s</code>, e <b>Tempo para alinhar as etapas de tempo</b> para <code>1 de janeiro, em 12:00 am</code>.
            </p>
        </div>
    </div>
    <div id="timeInterval">
        <div><h2>Intervalo de tempo</h2></div>
        <hr/>
        <div>
            <p>O intervalo de tempo utilizado para gerar etapas de tempo.  <b>O intervalo de tempo</b>  pode ser utilizado sozinho ou utilizado com os par&acirc;metros <b>Com que frequ&ecirc;ncia repetir o intervalo de tempo</b> ou par&acirc;metro <b>Tempo para alinhar os intervalos de tempo</b>.
            </p>
            <p>Por exemplo, se desejar criar etapas de tempo que  ocorrem toda segunda-feira de 9:00 a.m. At&eacute; 10:00 a.m., configure  <b>Intervalo de etapa de tempo</b> para <code>1 hora</code>, <b>Com que frequ&ecirc;ncia repetir a etapa de tempo</b> para <code>1 semana</code>, e <b>Tempo para alinhar as etapas de tempo </b> para <code>9:00:00 a.m. em uma segunda-feira</code>.
            </p>
        </div>
    </div>
    <div id="timeStep">
        <div><h2>Com que frequência repetir o intervalo de tempo</h2></div>
        <hr/>
        <div>
            <p> A etapa utilizada para calcular uma etapa do tempo. <b>Com que frequ&ecirc;ncia repetir o intervalo de tempo</b> pode ser utilizado sozinho, com <b>Intervalo de tempo</b>, com <b>Tempo de Refer&ecirc;ncia</b>, ou com ambos <b>Intervalo de tempo</b> e <b>Tempo para alinhar os intervalos de tempo</b>.
            </p>
            <p> Por exemplo, se desejar criar etapa de tempo  que  ocorrem toda segunda-feira de 9:00 a.m. at&eacute; 10:00 a.m., configure <b>Intervalo de etapa de tempo</b> para <code>1 hora</code>, <b>Com que frequ&ecirc;ncia repetir a etapa de tempo</b> para <code>1 semana</code>, e <b>Tempo para alinhar as etapas de tempo</b> para <code>9:00:00 a.m. em uma segunda-feira</code>.
            </p>
        </div>
    </div>
    <div id="timeReference">
        <div><h2>Tempo para alinhar intervalos de tempo para</h2></div>
        <hr/>
        <div>
            <p>A data e hora utilizadas para alinhar as partes de tempo. O intervalo de tempo come&ccedil;ar&aacute; em  sentido contr&aacute;rio deste tempo. Se nenhum tempo de refer&ecirc;ncia for selecionado, o intervalo de time alinhar&aacute; &agrave; 1 de Janeiro de 1970. 
            </p>
            <p> Por exemplo,  se desejar criar etapa de tempo  que  ocorre toda segunda-feira de 9:00 a.m. At&eacute; 10:00 a.m., configure <b>Intervalo de etapa de tempo</b> para <code>1 hora</code>, <b>Com que frequ&ecirc;ncia repetir a etapa de tempo</b> para <code>1 semana</code>, e <b>Tempo para alinhar as etapas de tempo</b> para <code>9:00:00 a.m. em uma segunda-feira</code>.
            </p>
        </div>
    </div>
    <div id="summaryFields">
        <div><h2>Adicionar estatísticas (opcional)</h2></div>
        <hr/>
        <div>
            <p> Voc&ecirc; pode calcular as estat&iacute;stica em fei&ccedil;&otilde;es que s&atilde;o resumidas.
Voc&ecirc; pode calcular o seguinte em campos num&eacute;ricos:
                <ul>
                    <li>Contagem&mdash;Calcula o n&uacute;mero de valores diferentes de nulo.
Pode ser utilizado em campos num&eacute;ricos ou strings. 'A contagem de [null, 0, 2] &eacute; 2.
                    </li>
                    <li>Soma&mdash;A soma de valores num&eacute;ricos em um campo. A soma de [null, null, 3] &eacute; 3.
                    </li>
                    <li>M&eacute;dia&mdash;A m&eacute;dia de valores num&eacute;ricos. A m&eacute;dia de [0, 2, null] &eacute; 1.
                    </li>
                    <li>M&iacute;n&mdash;O valor m&iacute;nimo de um campo num&eacute;rico. O m&iacute;nimo de [0, 2, null] &eacute; 0. 
                    </li>
                    <li>M&aacute;x&mdash;O valor m&aacute;ximo de um campo num&eacute;rico. O valor m&aacute;ximo de [0, 2, null] &eacute; 2.
                    </li>
                    <li>Alcance&mdash;O alcance de um campo num&eacute;rico. Isto &eacute; calculado como os valores m&iacute;nimos subtra&iacute;dos do valor m&aacute;ximo. O alcance de [0, null, 1] &eacute; 1. O alcance de [null, 4] &eacute; 0.
                    </li>
                    <li>Vari&acirc;ncia&mdash;A vari&acirc;ncia de um campo num&eacute;rico em um caminho. A vari&acirc;ncia de [1] &eacute; nula. A vari&acirc;ncia de [null, 1,0,1,1] &eacute; 0,25.
                    </li>
                    <li>Desvio padr&atilde;o&mdash;O desvio padr&atilde;o de um campo num&eacute;rico. O desvio padr&atilde;o de [1] &eacute; nulo. O desvio padr&atilde;o de [nulo, 1,0,1,1] &eacute; 0,5. 
                    </li>
                </ul>
                
            </p>
            <p>Voc&ecirc; pode calcular o seguinte em campos de strings:
                <ul>
                    <li>Contagem&mdash;O n&uacute;mero de strings diferente de nulo.
                    </li>
                    <li>Qualquer&mdash;Esta estat&iacute;stica &eacute; uma amostra aleat&oacute;ria de um valor de string no campo especificado.
                    </li>
                </ul>
                Todas as estat&iacute;sticas s&atilde;o calculadas em valores n&atilde;o nulos. A camada resultante conter&aacute; um novo atributo para cada estat&iacute;stica calculada. Qualquer n&uacute;mero de estat&iacute;stica pode ser adicionado ao escolher um atributo e estat&iacute;stica. 
            </p>
        </div>
    </div>
    <div id="spatialReference">
        <div><h2>SpatialReference (wkid)</h2></div>
        <hr/>
        <div>
            <p>Este &eacute; um par&acirc;metro tempor&aacute;rio do pr&eacute; lan&ccedil;amento para configurar a refer&ecirc;ncia de processamento espacial. Muitas ferramentas de big data exigem que um sistema de coordenada plana seja utilizada como a refer&ecirc;ncia espacial para processamento. Por padr&atilde;o, a ferramenta utilizar&aacute; o sistema de coordenadas de entrada mas falhar&aacute; se for um sistema de coordenadas geogr&aacute;ficas. Para configurar um sistema de coordenadas plana, insira o WKID. Por exemplo,  <b>Web Mercator</b> seria inserido como <code>3857</code>.
            </p>
        </div>
    </div>
    <div id="dataStore">
        <div><h2>Escolher um ArcGIS Data Store para salvar os resultados</h2></div>
        <hr/>
        <div>
            <p>Os resultados do GeoAnalytic s&atilde;o armazenados em um armazenamento de dados e expostos como uma camada de fei&ccedil;&atilde;o no  Portal for ArcGIS. Na maioria dos casos, os resultados devem ser armazenados no armazenamento de dados de espa&ccedil;o-tempo e este &eacute; o padr&atilde;o. Em alguns casos, salvar resultados no armazenamento de dados relacional &eacute; uma boa op&ccedil;&atilde;o. Abaixo est&atilde;o as raz&otilde;es pelas quais voc&ecirc; talvez queira armazenar resultados em  um armazenamento de dados relacional: 
                <ul>
                    <li>Voc&ecirc; pode  utilizar os resultados no portal-para-colabora&ccedil;&atilde;o do portal.
                    </li>
                    <li>Voc&ecirc; pode habilitar os recursos de sincroniza&ccedil;&atilde;o com seus resultados.
                    </li>
                </ul>
                
            </p>
            <p>Voc&ecirc; n&atilde;o deve utilizar um armazenamento de dados relacional se voc&ecirc; espera que os resultados do GeoAnalytics aumentem e deseja aproveitar os recursos do armazenamento de grandes dados de espa&ccedil;o-tempo para lidar com grandes quantidades de dados.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nome da camada resultante</h2></div>
        <hr/>
        <div>
            <p> O nome da camada que ser&aacute; criada.  Se voc&ecirc; estiver gravando em um ArcGIS Data Store, seus resultados ser&atilde;o salvos em  <b>Meu Conte&uacute;do</b> e adicionados no mapa. Se voc&ecirc; estiver gravando em um compartilhamento do arquivo de grandes dados, seus resultados ser&atilde;o armazenados compartilhamento do arquivo de grandes dados  e adicionados em seu   manifesto. N&atilde;o ser&atilde;o adicionados no mapa. O nome padr&atilde;o &eacute; baseado no nome da ferramenta e o nome da camada de entrada. Se a camada j&aacute; existe, a ferramenta falhar&aacute;.
            </p>
            <p>Ao gravar no  ArcGIS Data Store  (armazenamento de grandes dados de espa&ccedil;o-tempo ou relacional) utilizando a caixa suspensa  <b>Salvar resultados em</b> , voc&ecirc; pode especificar o nome de uma pasta em <b>Meu Conte&uacute;do</b> onde o resultado ser&aacute; salvo.
            </p>
        </div>
    </div>
</div>
</html>
