<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Calcular Densidade</h2><p/>
        <h2><img src="../images/GUID-4EE4838C-E210-43CE-99C7-1A648A18C10B-web.png" alt="Ferramenta Calcular Densidade"></h2>
        <hr/>
    <p>Esta ferramenta cria um mapa de densidade a partir das fei&ccedil;&otilde;es de ponto ou linha, espalhando quantidades conhecidas de algum fen&ocirc;meno (representado como atributos de pontos ou linhas) ao longo do mapa. O resultado &eacute; uma camada de &aacute;reas classificadas a partir da menos densa at&eacute; a mais densa.
    </p>
    <p>Na entrada de ponto, cada ponto deve representar o local de algum evento ou incidente, e a camada resultante representa uma contagem do incidente por &aacute;rea de unidade. Um valor de densidade mais alto em um novo local significa que h&aacute; mais pontos pr&oacute;ximos deste local. Em muitos casos, a camada resultante pode ser interpretada como uma superf&iacute;cie de risco para eventos futuros. Por exemplo, se os pontos de entrada representam locais de raios, a camada resultante pode ser interpretada como uma superf&iacute;cie de risco para futuros raios.
    </p>
    <p>Na entrada de linha, a superf&iacute;cie de densidade de linha representa a quantidade total de linhas que est&atilde;o pr&oacute;ximas de cada local. As unidades dos valores de densidade calculados s&atilde;o o comprimento da linha por &aacute;rea de unidade. Por exemplo, se as linhas representam rios, a camada resultante representar&aacute; o comprimento total de rios que est&atilde;o dentro do raio de pesquisa. Este resultado pode ser utilizado para identificar &aacute;reas que s&atilde;o hospitaleiras para animais de pasto.
    </p>
    <p>Outros casos de uso desta ferramenta incluem o seguinte:

        <ul>
            <li>Criar mapas da densidade de crime para ajudar departamentos de pol&iacute;cia a alocar corretamente recursos para &aacute;reas de alto crime.
                
 
            </li>
            <li>Calcular densidades dos hospitais dentro de um munic&iacute;pio. A camada resultante mostrar&aacute; &aacute;reas com acessibilidade alta e baixa para hospitais, e estas informa&ccedil;&otilde;es podem ser utilizadas para decidir onde novos hospitais devem ser constru&iacute;dos.
                
 
            </li>
            <li>Identificar &aacute;reas que est&atilde;o em alto risco de inc&ecirc;ndio em florestas baseado em hist&oacute;rico dos locais de inc&ecirc;ndio em florestas.
                
 
            </li>
            <li>Localizar comunidades que est&atilde;o longe de estradas importantes para planejar onde novas estradas devem ser constru&iacute;das.
                

            </li>
        </ul>
        
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputPointOrLineFeatures">
        <div><h2>Escolher camada de ponto ou linha de entrada da qual calcular a densidade</h2></div>
        <hr/>
        <div>
            <p>A camada de linha ou ponto de entrada que ser&aacute; utilizada para calcular a camada de densidade.
            </p>
        </div>
    </div>
    <div id="countField">
        <div><h2>Utilizar um campo de contagem</h2></div>
        <hr/>
        <div>
            <p>Forne&ccedil;a um campo especificando o n&uacute;mero de incidentes em cada local. Por exemplo, se voc&ecirc; tiver pontos que representam cidades, voc&ecirc; poder&aacute; utilizar um campo representando a popula&ccedil;&atilde;o da cidade como o campo de contagem, e a camada de densidade da popula&ccedil;&atilde;o resultante calcular&aacute; densidades de popula&ccedil;&atilde;o maiores pr&oacute;ximas &agrave;s cidades com popula&ccedil;&otilde;es maiores.
            </p>
            <p>Se a op&ccedil;&atilde;o padr&atilde;o de  <b>Nenhum</b> for utilizada, cada local ser&aacute; assumido para representar uma &uacute;nica contagem.
            </p>
        </div>
    </div>
    <div id="searchDistance">
        <div><h2>Distância de pesquisa</h2></div>
        <hr/>
        <div>
            <p>Insira uma dist&acirc;ncia especificando a dist&acirc;ncia de pesquisa para localizar fei&ccedil;&otilde;es de ponto ou linha ao calcular valores de densidade. Por exemplo, se voc&ecirc; fornecer uma dist&acirc;ncia de pesquisa de 10.000 metros, a densidade de qualquer local na camada de sa&iacute;da ser&aacute; calculada baseada em fei&ccedil;&otilde;es que est&atilde;o dentro de 10.000 metros do local. Qualquer local que n&atilde;o tiver quaisquer incidentes dentro de 10.000 metros receber&aacute; um valor de densidade de zero.
            </p>
            <p>Se nenhuma dist&acirc;ncia for fornecida, uma padr&atilde;o ser&aacute; calculada que &eacute; baseada em locais das fei&ccedil;&otilde;es de entrada e valores no campo de contagem (se um campo de contagem for fornecido).
            </p>
        </div>
    </div>
    <div id="outputAreaUnits">
        <div><h2>Unidades de área de saída</h2></div>
        <hr/>
        <div>
            <p>Especifique a unidade da &aacute;rea de sa&iacute;da. A densidade &eacute; a contagem dividida por &aacute;rea, e este par&acirc;metro especifica a unidade da &aacute;rea no c&aacute;lculo de densidade.
            </p>
            <p>As unidades a&eacute;reas dispon&iacute;veis s&atilde;o Milhas Quadradas, P&eacute;s Quadrados, Metros Quadrados e Quil&ocirc;metros Quadrados.
            </p>
        </div>
    </div>
    <div id="outputCellSize">
        <div><h2>Tamanho da Célula de Saída</h2></div>
        <hr/>
        <div>
            <p>O tamanho da c&eacute;lula e a unidade para os rasters de sa&iacute;da.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nome da camada resultante</h2></div>
        <hr/>
        <div>
            <p>O nome da camada que ser&aacute; criada em  <b>Meu Conte&uacute;do</b> e adicionada no mapa. O nome padr&atilde;o &eacute; baseado no nome da ferramenta e o nome da camada de entrada. Se a camada j&aacute; existir, voc&ecirc; ser&aacute; solicitado para fornecer outro nome.
            </p>
            <p>Voc&ecirc; pode especificar o nome de uma pasta em  <b>Meu Conte&uacute;do</b> onde o resultado ser&aacute; salvo utilizando a caixa suspensa <b>Salvar resultados em</b> .
            </p>
        </div>
    </div>
</div>
</html>
