<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Determinar Caminhos de Custo da Viagem Como Polilinha</h2><p/>
        <h2><img src="../images/GUID-9A27DEB7-0276-483C-A12F-3E70D636550D-web.png" alt="Ilustra&ccedil;&atilde;o da ferramenta Determinar Caminhos de Custo da Viagem como Polilinha"></h2>
        <hr/>
    <p>Esta ferramenta calcula o caminho de polilinha de menor custo entre origens e destinos conhecidos.
    </p>
    <p>Aplica&ccedil;&otilde;es de exemplo incluem o seguinte:
        <ul>
            <li>Encontrar a melhor rota para uma nova estrada em termos de custos de constru&ccedil;&atilde;o.
                

            </li>
            <li>Identificar o caminho a seguir a partir de v&aacute;rios locais suburbanos (fontes) at&eacute; o shopping center mais pr&oacute;ximo (destino).
                

            </li>
        </ul>
        
    </p>
    <p>Se  <b>Utilizar extens&atilde;o de mapa atual</b> estiver selecionada, somente estes locais nas camadas de entrada que s&atilde;o vis&iacute;veis dentro da extens&atilde;o de mapa atual ser&atilde;o analisados. Se n&atilde;o selecionada, todos os locais nas camadas de entrada ser&atilde;o analisadas, mesmo que estiverem fora da extens&atilde;o de mapa atual.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputSourceRasterOrFeatures">
        <div><h2>Escolher camada de origem da feição ou raster para determinar caminhos de</h2></div>
        <hr/>
        <div>
            <p>Um servi&ccedil;o de imagem ou servi&ccedil;o da fei&ccedil;&atilde;o que identifica as c&eacute;lulas a partir das quais o caminho de menor custo &eacute; determinado at&eacute; o destino mais barato.
            </p>
            <p>Se a entrada for um servi&ccedil;o de imagem, a entrada consistir&aacute; em c&eacute;lulas que t&ecirc;m valores v&aacute;lidos (zero &eacute; um valor v&aacute;lido) e as c&eacute;lulas restantes dever&atilde;o ser designadas de NoData.
            </p>
        </div>
    </div>
    <div id="inputCostRaster">
        <div><h2>Escolher camada de raster de custo da viagem</h2></div>
        <hr/>
        <div>
            <p>Um raster definindo o custo ou imped&acirc;ncia para mover planimetricamente atrav&eacute;s de cada c&eacute;lula.
            </p>
            <p>O valor de cada localiza&ccedil;&atilde;o da c&eacute;lula representa a dist&acirc;ncia de unidade por custo para mover pela c&eacute;lula. Cada valor de localiza&ccedil;&atilde;o de c&eacute;lula &eacute; multiplicado pela resolu&ccedil;&atilde;o de pixel, enquanto tamb&eacute;m compensando por movimento diagonal para obter o custo total de passagem pela c&eacute;lula.
            </p>
            <p>Os valores do custo de raster podem ser inteiros ou pontos flutuantes, mas eles n&atilde;o podem ser negativos ou zero (voc&ecirc; n&atilde;o pode ter um custo  negativo ou zero).
            </p>
        </div>
    </div>
    <div id="inputDestinationRasterOrFeatures">
        <div><h2>Feições ou Raster de Destino de Entrada</h2></div>
        <hr/>
        <div>
            <p>Uma entrada que define os destinos utilizados para calcular a dist&acirc;ncia. A camada pode ser raster ou fei&ccedil;&atilde;o.
            </p>
            <p>Se a entrada for um servi&ccedil;o de imagem, a entrada consistir&aacute; em c&eacute;lulas que t&ecirc;m valores v&aacute;lidos (zero &eacute; um valor v&aacute;lido) e as c&eacute;lulas restantes dever&atilde;o ser designadas de NoData.
            </p>
        </div>
    </div>
    <div id="outputPolylineName">
        <div><h2>Nome da camada de polilinha resultante</h2></div>
        <hr/>
        <div>
            <p>O nome da camada que ser&aacute; criada em  <b>Meu Conte&uacute;do</b> e adicionada no mapa. O nome padr&atilde;o &eacute; baseado no nome da ferramenta e o nome da camada de entrada. Se a camada j&aacute; existir, voc&ecirc; ser&aacute; solicitado para fornecer outro nome.
            </p>
            <p>Voc&ecirc; pode especificar o nome de uma pasta em  <b>Meu Conte&uacute;do</b> onde o resultado ser&aacute; salvo utilizando a caixa suspensa <b>Salvar resultados em</b> .
            </p>
        </div>
    </div>
    <div id="pathType">
        <div><h2>Escolher tipo de caminhos para determinar</h2></div>
        <hr/>
        <div>
            <p>Define a maneira pela qual os valores e zonas nos dados de destino de entrada ser&atilde;o interpretados nos c&aacute;lculos do caminho de custo.
            </p>
            <ul>
                <li>&Uacute;nico Melhor&mdash;Para todas as c&eacute;lulas ou locais nos dados de destino de entrada, o caminho de menor custo &eacute; derivado do local com o m&iacute;nimo dos caminhos de menor custo at&eacute; o local de origem. Este &eacute; o padr&atilde;o
                    

                </li>
                <li>Para Cada C&eacute;lula&mdash;Para cada c&eacute;lula ou local com valores v&aacute;lidos nos dados de destino de entrada, um caminho de menor custo &eacute; determinado e salvo no servi&ccedil;o da fei&ccedil;&atilde;o de sa&iacute;da. Com esta op&ccedil;&atilde;o, cada c&eacute;lula dos dados de destino de entrada &eacute; tratada separadamente e um caminho de menor custo &eacute; determinado para cada c&eacute;lula.
                    

                </li>
                <li>Para Cada Zona&mdash;Para cada zona nos dados de destino de entrada, um caminho de menor custo &eacute; determinado e salvo no servi&ccedil;o da fei&ccedil;&atilde;o de sa&iacute;da. Com esta op&ccedil;&atilde;o, o caminho de menor custo para cada zona come&ccedil;a na c&eacute;lula ou local com a menor pondera&ccedil;&atilde;o de dist&acirc;ncia de custo na zona.
                    

                </li>
            </ul>
            
        </div>
    </div>
</div>
</html>
