<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Juntar Camadas</h2><p/>
        <h2><img src="../images/GUID-BDDD6517-4EE7-4EEC-AE15-15DD9B709131-web.png" alt="Juntar Camadas"></h2>
        <hr/>
    <p>Esta ferramenta combina duas camadas de fei&ccedil;&atilde;o para criar uma &uacute;nica camada de sa&iacute;da. As camadas a serem unidas devem ter o mesmo tipo de geometria e tipo de tempo. Voc&ecirc; pode controlar como os campos das camadas de entrada s&atilde;o juntados e copiados. Por exemplo:
        <ul>
            <li>Eu tenho tr&ecirc;s camadas para a Inglaterra, Pa&iacute;s de Gales e Esc&oacute;cia e desejo uma &uacute;nica camada da Gr&atilde;-Bretanha. 
            </li>
            <li>Eu tenho 2 camadas e cada uma cont&eacute;m informa&ccedil;&otilde;es de lote para distritos municipais cont&iacute;guos. Eu desejo junt&aacute;-las em uma &uacute;nica camada, mantendo somente os campos que t&ecirc;m o mesmo nome e tipo nas 2 camadas de entrada.
            </li>
        </ul>
        
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Escolher camada</h2></div>
        <hr/>
        <div>
            <p>A camada com fei&ccedil;&otilde;es tabulares, de ponto, de linha ou de &aacute;rea na qual a segunda camada de fei&ccedil;&atilde;o ser&aacute; unida. Todos os campos desta camada ser&atilde;o inclu&iacute;dos na camada resultante.
            </p>
        </div>
    </div>
    <div id="mergeLayer">
        <div><h2>Escolha a camada para juntar</h2></div>
        <hr/>
        <div>
            <p>A camada de fei&ccedil;&atilde;o para unir com a camada de entrada. A camada a ser unida deve ter o mesmo tipo de geometria e tipo de tempo que a camada de entrada.
            </p>
        </div>
    </div>
    <div id="mergingAttributes">
        <div><h2>Modificar campos para juntar</h2></div>
        <hr/>
        <div>
            <p>Por padr&atilde;o, todos os campos das duas camadas de entrada ser&atilde;o inclu&iacute;dos na sa&iacute;da. Voc&ecirc; pode alterar como os campos da camada a serem unidos ser&atilde;o inclu&iacute;dos na sa&iacute;da com as seguintes op&ccedil;&otilde;es:
                <ul>
                    <li> <b>Renomear</b>&mdash;O campo ser&aacute; renomeado na sa&iacute;da.
                    </li>
                    <li> <b>Remover</b>&mdash;O campo ser&aacute; removido da sa&iacute;da.
                    </li>
                    <li> <b>Combinar</b>&mdash;Os nomes dos campos tornam-se equivalentes.  Os valores de campo da camada para juntar ser&atilde;o copiados para o campo de sa&iacute;da correspondente.
                    </li>
                </ul>
                
            </p>
            <p>Se ambas as camadas contiver um campo com um nome id&ecirc;ntico e tipo de dados, o conte&uacute;do de ambos os campos ser&aacute; juntado em um campo deste nome. Isto n&atilde;o se aplica a campos onde  <b>Igualar</b> &eacute; utilizado no par&acirc;metro <b>Modificar campos  de jun&ccedil;&atilde;o</b> .
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nome da camada resultante</h2></div>
        <hr/>
        <div>
            <p> O nome da camada que ser&aacute; criada.  Se voc&ecirc; estiver gravando em um ArcGIS Data Store, seus resultados ser&atilde;o salvos em  <b>Meu Conte&uacute;do</b> e adicionados no mapa. Se voc&ecirc; estiver gravando em um compartilhamento do arquivo de grandes dados, seus resultados ser&atilde;o armazenados compartilhamento do arquivo de grandes dados  e adicionados em seu   manifesto. N&atilde;o ser&atilde;o adicionados no mapa. O nome padr&atilde;o &eacute; baseado no nome da ferramenta e o nome da camada de entrada. Se a camada j&aacute; existe, a ferramenta falhar&aacute;.
            </p>
            <p>Ao gravar no  ArcGIS Data Store  (armazenamento de grandes dados de espa&ccedil;o-tempo ou relacional) utilizando a caixa suspensa  <b>Salvar resultados em</b> , voc&ecirc; pode especificar o nome de uma pasta em <b>Meu Conte&uacute;do</b> onde o resultado ser&aacute; salvo.
            </p>
        </div>
    </div>
</div>
</html>
