<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Resumir Raster Dentro</h2><p/>
        <h2><img src="../images/GUID-D61C156C-2B2C-488C-BF28-B6CB9277BF4B-web.png" alt="Ferramenta Resumir Raster Dentro"></h2>
        <hr/>
    <p>Esta ferramenta resume um raster baseado em &aacute;reas (zonas) definido pela primeira camada de entrada.
    </p>
    <p>Alguns aplicativos de exemplo incluem o seguinte:
    </p>
    <p>
        <ul>
            <li>Fornecida uma camada de limites da bacia e uma camada de limites de uso do solo por tipo de uso do solo, calcule a &aacute;rea total em acres do tipo de uso do solo para cada bacia.
                

            </li>
            <li>Fornecida uma camada de lotes em um munic&iacute;pio e uma camada de limites da cidade, resuma o valor m&eacute;dio de lotes desocupados dentro de cada limite da cidade.
                

            </li>
        </ul>
        
    </p>
    <p>Se  <b>Utilizar extens&atilde;o de mapa atual</b> estiver selecionada, somente estas fei&ccedil;&otilde;es na camada de entrada e a camada a ser resumida que s&atilde;o vis&iacute;veis dentro da extens&atilde;o de mapa atual ser&atilde;o analisadas.  Se n&atilde;o selecionada, todas as fei&ccedil;&otilde;es em ambas a camada de entrada e a camada a ser resumida ser&atilde;o analisadas, mesmo que estiverem fora da extens&atilde;o de mapa atual.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="sumWithinLayer">
        <div><h2>Escolher camada de área para resumir uma camada raster dentro dos limites definidos</h2></div>
        <hr/>
        <div>
            <p>A camada que define os limites das &aacute;reas ou zonas, que ser&atilde;o resumidas.
            </p>
            <p>A camada pode ser um raster ou dados de fei&ccedil;&atilde;o. Para rasters, as zonas s&atilde;o definidas por todos os locais na entrada que tenham o mesmo valor de c&eacute;lula. As &aacute;reas n&atilde;o t&ecirc;m que ser cont&iacute;guas.
            </p>
        </div>
    </div>
    <div id="zoneField">
        <div><h2>Escolher campo para definir os limites</h2></div>
        <hr/>
        <div>
            <p>Este &eacute; o atributo da camada que ser&aacute; utilizada para definir os limites das &aacute;reas.
            </p>
            <p>Por exemplo, suponha que a primeira camada de entrada define os limites da unidade de gerenciamento, com atributos que definem a regi&atilde;o, o distrito e o parcel ID de cada unidade. Voc&ecirc; tamb&eacute;m tem uma camada raster definindo um &iacute;ndice de biodiversidade de cada local. Com o campo que voc&ecirc; selecionar, voc&ecirc; pode decidir calcular a biodiversidade m&eacute;dia no local, distrito ou n&iacute;veis regionais.
            </p>
        </div>
    </div>
    <div id="sumRasterLayer">
        <div><h2>Escolher camada raster para resumir</h2></div>
        <hr/>
        <div>
            <p>As c&eacute;lulas raster desta camada ser&atilde;o resumidas pelas &aacute;reas (zonas) que elas caem dentro.
            </p>
        </div>
    </div>
    <div id="sumStatistic">
        <div><h2>Escolher estatística para calcular</h2></div>
        <hr/>
        <div>
            <p>Ap&oacute;s voc&ecirc; escolher uma camada para resumir, voc&ecirc; pode opcionalmente calcular estat&iacute;sticas de qualquer atributo num&eacute;rico dos pontos, linhas ou &aacute;reas dentro da camada de &aacute;rea de entrada.
            </p>
            <p>Os tipos de estat&iacute;sticas dispon&iacute;veis quando o campo selecionado for inteiro s&atilde;o M&eacute;dia, Maioria, M&aacute;ximo, Mediano, M&iacute;nimo, Minoria, Faixa, Desvio padr&atilde;o, Soma e Variedade.
            </p>
            <p>Se o campo for ponto flutuanrte, as op&ccedil;&otilde;es s&atilde;o M&eacute;dia, M&aacute;ximo, Mediano, M&iacute;nimo, Minoria, Faixa, Desvio padr&atilde;o e Soma.
            </p>
        </div>
    </div>
    <div id="missingValues">
        <div><h2>Ignorar valores ausentes no cálculo</h2></div>
        <hr/>
        <div>
            <p>Se voc&ecirc; optar por ignorar valores ausentes, somente as c&eacute;lulas que t&ecirc;m um valor na camada para ser resumida ser&atilde;o utilizadas para determinar o valor de sa&iacute;da desta &aacute;rea. Caso contr&aacute;rio, se houver valores ausentes em qualquer lugar em uma &aacute;rea, &eacute; julgado que n&atilde;o h&aacute; informa&ccedil;&otilde;es suficientes para executar os c&aacute;lculos estat&iacute;sticos de todas as c&eacute;lulas nesta zona e que a &aacute;rea receber&aacute; um valor nulo (NoData) na sa&iacute;da.
            </p>
        </div>
    </div>
    <div id="resultLayer">
        <div><h2>Nome da camada resultante</h2></div>
        <hr/>
        <div>
            <p>O nome da camada que ser&aacute; criada em  <b>Meu Conte&uacute;do</b> e adicionada no mapa. O nome padr&atilde;o &eacute; baseado no nome da ferramenta e o nome da camada de entrada. Se a camada j&aacute; existir, voc&ecirc; ser&aacute; solicitado para fornecer outro nome.
            </p>
            <p>Voc&ecirc; pode especificar o nome de uma pasta em  <b>Meu Conte&uacute;do</b> onde o resultado ser&aacute; salvo utilizando a caixa suspensa <b>Salvar resultados em</b> .
            </p>
        </div>
    </div>
</div>
</html>
