<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Toplanan Noktalar</h2><p/>
        <h2><img src="../images/GUID-6C1620D9-D176-41FA-8283-833D8B1CCCFC-web.png" alt="Toplanan Noktalar"></h2>
        <hr/>
    <p>Bu ara&ccedil;, nokta detayları katmanı ve alan detayları katmanı ile &ccedil;alışır.  Girdi alanı detayları bir alan katmanından oluşabileceği gibi, ara&ccedil; &ccedil;alıştırıldığında hesaplanan kare veya altıgen kutu bi&ccedil;iminde de olabilir. Ara&ccedil;, &ouml;nce belirtilen alanların her birine hangi noktaların d&uuml;şeceğini belirler. Alan i&ccedil;indeki bu noktalar mekansal ilişkiyi belirledikten sonra, alandaki t&uuml;m noktaların istatistikleri hesaplanır ve alana atanır En temel istatistik alan i&ccedil;indeki nokta sayısıdır, ancak diğer istatistikleri de alabilirsiniz. 

    </p>
    <p>&Ouml;rneğin, elinizde kahve d&uuml;kkanı konumlarının nokta detayları ve &uuml;lkelerin alan detayları var ve &uuml;lkeye g&ouml;re kahve satışlarını &ouml;zetlemek istiyorsunuz. Kahve d&uuml;kkanlarının bir  <i>TOTAL_SALES</i> &ouml;zniteliği olduğunu varsayalım, her &uuml;lkedeki t&uuml;m <i>TOTAL_SALES</i> toplamını ya da her &uuml;lkedeki minimum ya da maksimum <i>TOTAL_SALES</i>
 sayısını ya da sayı, aralık, standart sapma ve varyans gibi diğer istatistikleri elde edebilirsiniz.
    </p>
    <p>Bu ara&ccedil; ayrıca zamana duyarlı verilerle de &ccedil;alışabilir. Girdi noktalarında zaman etkinleştirildiği takdirde, zaman dilimleme se&ccedil;enekleri kullanılabilir. Zaman dilimleme &ouml;zelliği, zaman i&ccedil;inde belirli bir zaman dilimini incelerken alan i&ccedil;indeki nokta ilişkisini hesaplamanıza olanak tanır. &Ouml;rneğin, her saat i&ccedil;in &ccedil;ıktı değerlerini veren saatlik aralıkları inceleyebilirsiniz. 
    </p>
    <p>Zamanla ilgili bir &ouml;rnek vermek gerekirse, elinizde &ccedil;eşitli kahve d&uuml;kkanı konumlarındaki her işlemin nokta detaylarının olduğunu, ancak alan katmanı olmadığını varsayalım. It can be &quot;Veriler bir yıl boyunca kaydedildi ve her işlemin bir yeri ve zaman damgası var.&quot; Her işlemin bir  <i>TOTAL_SALES</i> &ouml;zniteliği bulunduğunu varsayarsak, dilediğiniz alan ve zamana ait t&uuml;m <i>TOTAL_SALES</i> toplamını elde edebilirsiniz. S&ouml;z konusu işlemler yalnızca bir şehir i&ccedil;inse, 1 kilometrelik kılavuzlar halinde alanlar oluşturulabilir ve hem zamana hem de alana g&ouml;re işlemleri &ouml;zetleyen haftalık zaman dilimleri incelenebilir.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="pointLayer">
        <div><h2>Alan olarak birleştirilecek noktaları içeren bir katman seçin</h2></div>
        <hr/>
        <div>
            <p>Alan olarak birleştirilecek nokta katmanı.  <b>Kare</b> veya <b>Altıgen</b> kutularda k&uuml;melenmiş nokta katmanlarının izd&uuml;ş&uuml;mlenmiş bir koordinat sistemine <b>Analiz Ortamları</b> kullanılarak izd&uuml;ş&uuml;ml&uuml; bir koordinat sistemine ayarlanmış işleme mekansal başvurusu olmalıdır.
            </p>
            <p>Haritanızdan bir katman se&ccedil;ebileceğiniz gibi, a&ccedil;ılan listenin en altından  <b>Analiz Katmanını Se&ccedil;</b> &ouml;gesini belirleyerek b&uuml;y&uuml;k veri dosya paylaşımı veri k&uuml;mesi veya detay katmanı i&ccedil;eriğinize g&ouml;z atabilirsiniz.
            </p>
        </div>
    </div>
    <div id="inputAggregation">
        <div><h2>Birleştirecek bir alan katmanı seçin</h2></div>
        <hr/>
        <div>
            <p>Nokta katmanının i&ccedil;inde birleştirileceği alanlar. Kendi belirleyeceğiniz bir alan katmanı se&ccedil;ebileceğiniz gibi, ara&ccedil; &ccedil;alıştırıldığında oluşturulan kutulardan da se&ccedil;im yapabilirsiniz.   Kutu oluşturulurken  <b>Kare</b> i&ccedil;in belirtilen sayı ve birim karenin y&uuml;ksekliğini ve uzunluğunu belirler. <b>Altıgen</b> i&ccedil;in ise, belirtilen sayı ve birimler paralel kenarlar arasındaki mesafeyi belirler.
            </p>
            <p> <b>Kare</b> veya <b>Altıgen</b> kutu kullanan analiz, izd&uuml;ş&uuml;ml&uuml; bir koordinat sistemi gerektirir. <b>İşlem koordinat sistemini</b> <b>Analiz Ortamları</b> i&ccedil;inden ayarlayabilirsiniz. 
 İşlem koordinat sisteminiz izd&uuml;ş&uuml;ml&uuml; bir koordinat sistemine ayarlanmamış ise, <b>Analizi &Ccedil;alıştır</b> dığınızda bu ayarlamayı yapmanız istenir.
            </p>
        </div>
    </div>
    <div id="polygonLayer">
        <div><h2>Birleştirmenin yapılacağı alan katmanını seçin</h2></div>
        <hr/>
        <div>
            <p>Noktaların birleştirileceği alan katmanıdır. Bu katmanda bulunan alanların sınırları i&ccedil;ine giren t&uuml;m noktalar sayılır ve isteğe bağlı olarak istatistiksel tercihiniz kullanılarak &ouml;zetlenir. 
            </p>
            <p>Kutular i&ccedil;in  <b>Kutu Boyutu</b> veya <b>Alan Katmanı</b> ayarlanmalıdır.
            </p>
        </div>
    </div>
    <div id="inputBins">
        <div><h2>Depo aralık mesafesini ve birleştirmenin toplanacağı yeri belirleyin</h2></div>
        <hr/>
        <div>
            <p>Girdi noktalarınızın i&ccedil;inde birleştirileceği kutuları oluşturmak i&ccedil;in kullanılan mesafe. Kare bir kutu i&ccedil;in boyut, karenin y&uuml;ksekliğini g&ouml;sterir. Altıgen i&ccedil;in boyut, altıgenin y&uuml;ksekliğini (paralel kenarlar arası mesafeyi) g&ouml;sterir.  
            </p>
            <p>Kutular i&ccedil;in  <b>Kutu Boyutu</b> veya <b>Alan Katmanı</b> ayarlanmalıdır.
            </p>
        </div>
    </div>
    <div id="timeSlicing">
        <div><h2>Zaman adımlarını kullanarak birleştirme (isteğe bağlı)</h2></div>
        <hr/>
        <div>
            <p>Girdi nokta katmanında zaman etkinleştirilmiş ve t&uuml;r&uuml; de anlık ise, zaman adımlamasını kullanarak analiz yapabilirsiniz. Zaman &ouml;gesini kullanırken ayarlayabileceğiniz &uuml;&ccedil; parametre vardır:
                <ul>
                    <li> <b>Zaman adımı aralığı</b>
                    </li>
                    <li> <b>Zaman adımını yineleme aralığı</b>
                    </li>
                    <li> <b>Zaman adımlarını d&uuml;zenleme s&uuml;resi</b>
                    </li>
                </ul>
                
            </p>
            <p>&Ouml;rneğin, bir yılı temsil eden verileriniz varsa ve bu verileri haftalık adımlar kullanarak analiz etmek istiyorsanız,  <b>Zaman adımı aralığı</b> &ouml;ğesini <code>1 hafta</code> olarak ayarlayın. 
            </p>
            <p>&Ouml;rneğin, bir yılı temsil eden verileriniz varsa ve bu verileri ayın ilk haftasını kullanarak analiz etmek istiyorsanız,  <b>Zaman adımı aralığı</b> &ouml;ğesini <code>1 hafta</code>, <b>Zaman adımı yineleme sıklığı</b> &ouml;ğesini <code>1 ay</code> ve <b>Zaman adımlarının ayarlanacağı zaman</b> &ouml;ğesini <code>1 Ocak saat g&uuml;nd&uuml;z 12:00</code> olarak ayarlayın.
            </p>
        </div>
    </div>
    <div id="timeInterval">
        <div><h2>Zaman adımı aralığı</h2></div>
        <hr/>
        <div>
            <p>Zaman adımı oluşturmak i&ccedil;in kullanılan zaman aralığı.  <b>Zaman adımı aralığını</b> tek başına veya <b>Zaman adımını tekrarlama sıklığı</b> ya da <b>Zaman adımlarının ayarlanacağı zaman</b> parametresiyle birlikte kullanabilirsiniz.
            </p>
            <p>&Ouml;rneğin,her Pazartesi saat 9:00 ile 10:00 arasında ger&ccedil;ekleşen zaman adımları oluşturmak isterseniz ,  <b>Zaman adımı aralığı</b> değerini <code>1 saat</code>, <b>Zaman adımını yineleme aralığı</b> değerini <code>1 hafta</code> ve <b>Zaman adımlarının ayarlanacağı zaman</b> değerini <code>Pazartesi g&uuml;n&uuml; sabah 9:00:00</code> olarak ayarlayın.
            </p>
        </div>
    </div>
    <div id="timeStep">
        <div><h2>Zaman adımını yineleme aralığı</h2></div>
        <hr/>
        <div>
            <p> Bir zaman adımını hesaplamak i&ccedil;in kullanılan adım. <b>Zaman adımını yineleme aralığı</b>  tek başına, <b>Zaman adımı aralığı</b> ile birlikte veya <b>Referans Zaman</b> ile birlikte ya da <b>Zaman adımı aralığı</b> ve <b>Zaman adımlarının ayarlanacağı zaman</b> parametrelerinin her ikisi ile birlikte kullanılabilir.
            </p>
            <p> &Ouml;rneğin, her Pazartesi saat 9:00 ile 10:00 arasında ger&ccedil;ekleşen zaman adımları oluşturmak isterseniz, <b>Zaman adımı aralığı</b> değerini <code>1 saat</code>, <b>Zaman adımını yineleme aralığı</b> değerini <code>1 hafta</code> ve <b>Zaman adımlarının ayarlanacağı zaman</b> değerini <code>Pazartesi g&uuml;n&uuml; sabah 9:00:00</code> olarak ayarlayın.
            </p>
        </div>
    </div>
    <div id="timeReference">
        <div><h2>Zaman adımlarını düzenleme süresi</h2></div>
        <hr/>
        <div>
            <p>Zaman dilimlemeyi eşleştirmek i&ccedil;in kullanılan tarih ve saat. Zaman adımlaması saatinde başlatılır ve buradan geriye doğru devam eder. Referans saat se&ccedil;ilmezse, zaman adımlaması 1 Ocak 1970&rsquo;ten başlatılır. 
            </p>
            <p> &Ouml;rneğin,  her Pazartesi saat 9:00 ile 10:00 arasında ger&ccedil;ekleşen zaman adımları oluşturmak isterseniz, <b>Zaman adımı aralığı</b> değerini <code>1 saat</code>, <b>Zaman adımını yineleme aralığı</b> değerini <code>1 hafta</code> ve <b>Zaman adımlarının ayarlanacağı zaman</b> değerini <code>Pazartesi g&uuml;n&uuml; sabah 9:00:00</code> olarak ayarlayın.
            </p>
        </div>
    </div>
    <div id="summaryFields">
        <div><h2>İstatistik ekle (isteğe bağlı)</h2></div>
        <hr/>
        <div>
            <p> &Ouml;zetlenen detaylarla ilgili istatistikleri hesaplayabilirsiniz. Aşağıdakileri sayısal alanlarda hesaplayabilirsiniz:
                <ul>
                    <li>Sayım&mdash;Null olmayan değerlerin sayısını hesaplar. Sayısal alan veya dizelerde kullanılabilir. [null, 0, 2] sonucu 2&rsquo;dir.
                    </li>
                    <li>Toplam; bir alandaki sayısal değerlerin toplamıdır. [null, null, 3] toplamı 3&rsquo;t&uuml;r.
                    </li>
                    <li>Ortalama; sayısal değerlerin ortalamasıdır. [0, 2, null] ortalaması 1&rsquo;dir.
                    </li>
                    <li>Min; bir sayısal alanın minimum değeridir. [0, 2, null] minimumu 0&rsquo;dır. 
                    </li>
                    <li>Maks; bir sayısal alanın maksimum değeridir. [0, 2, null] maksimum değeri 2&rsquo;dir.
                    </li>
                    <li>Aralık; bir sayısal alanın aralığıdır. Bu değer, minimum değerlerin maksimum değerlerden &ccedil;ıkartılmasıyla hesaplanır. [0, null, 1] aralığı 1&rsquo;dir. [null, 4] aralığı 0&rsquo;dır.
                    </li>
                    <li>Varyans; bir izdeki sayısal değerin sapmasını g&ouml;sterir. [1] sapması null&rsquo;dır. [null, 1,0,1,1] sapması 0,25&rsquo;dir.
                    </li>
                    <li>Standart sapma; bir sayısal alanın standart sapmasıdır. [1] standart sapması null&rsquo;dır. [null, 1,0,1,1] standart sapması 0,5&rsquo;dir. 
                    </li>
                </ul>
                
            </p>
            <p>Aşağıdakileri dize alanlarında hesaplayabilirsiniz:
                <ul>
                    <li>Sayım; null olmayan dizelerin sayısını hesaplar.
                    </li>
                    <li>Herhangi; bu istatistik belirtilen alandaki bir dize değerinin rastgele &ouml;rneğidir.
                    </li>
                </ul>
                T&uuml;m istatistikler null olmayan değerler &uuml;zerinde hesaplanır. Sonu&ccedil; katmanı hesaplanan her istatistik i&ccedil;in yeni bir alan i&ccedil;erir. Herhangi bir sayıda istatistik, &ouml;znitelik ve istatistik se&ccedil;ilerek eklenebilir. 
            </p>
        </div>
    </div>
    <div id="spatialReference">
        <div><h2>SpatialReference (wkid)</h2></div>
        <hr/>
        <div>
            <p>Bu, mekansal referansı ayarlamak amacıyla &ouml;n s&uuml;r&uuml;m i&ccedil;in ge&ccedil;ici bir parametredir. B&uuml;y&uuml;k veri ara&ccedil;larının pek &ccedil;oğu, işlem i&ccedil;in mekansal referans olarak izd&uuml;ş&uuml;mlendirilmiş bir koordinat sisteminin kullanılmasını gerektirir. Varsayılan olarak, ara&ccedil; girdi koordinat sistemini kullanır, ancak bu bir coğrafi koordinat sistemi olduğunda &ccedil;alışmaz. İzd&uuml;ş&uuml;mlendirilmiş bir koordinat sistemi ayarlamak i&ccedil;in WKID girin. &Ouml;rneğin,  <b>Web Mercator</b> değeri, <code>3857</code>olarak girilebilir.
            </p>
        </div>
    </div>
    <div id="dataStore">
        <div><h2>Sonuçların kaydedileceği bir ArcGIS Veri Deposu seçin</h2></div>
        <hr/>
        <div>
            <p>GeoAnalytics sonu&ccedil;ları,  bir veri deposunda saklanır ve  Portal for ArcGIS i&ccedil;inde bir detay katmanı olarak yansıtılır. Pek &ccedil;ok durumda sonu&ccedil;ların mekan-zamansal b&uuml;y&uuml;k veri deposuna depolanması gerekir ve bu varsayılan ayardır. Bazı durumlarda, sonu&ccedil;ların ilişkisel veri deposuna kaydedilmesi iyi bir se&ccedil;enektir. Sonu&ccedil;ların ilişkisel veri deposuna  saklanmasını isteyebileceğiniz nedenler aşağıda sunulmuştur: 
                <ul>
                    <li>Bu sonu&ccedil;ları, portaldan-portala işbirliğinde kullanabilirsiniz.
                    </li>
                    <li>Sonu&ccedil;larınızı eşzamanlama &ouml;zellikleriyle etkinleştirebilirsiniz.
                    </li>
                </ul>
                
            </p>
            <p>GeoAnalytics sonu&ccedil;larınızın artmasını bekliyorsanız, ilişkisel veri deposunu kullanmamalı ve b&uuml;y&uuml;k miktarda veri s&ouml;z konusu olduğunda bunları işlemek i&ccedil;in mekan-zamansal b&uuml;y&uuml;k veri deposunun avantajından yararlanmalısınız.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Sonuç katmanı adı</h2></div>
        <hr/>
        <div>
            <p> Oluşturulacak katmanın adı. Bir ArcGIS Data Store&lsquo;a yazdığınızda, sonu&ccedil;larınız  <b>İ&ccedil;eriğime</b> kaydedilir ve haritaya eklenir. Bir b&uuml;y&uuml;k veri dosya paylaşımına yazdığınızda,  sonu&ccedil;larınız b&uuml;y&uuml;k veri dosya paylaşımı i&ccedil;ine kaydedilir ve   manifestosuna eklenir.  haritaya eklenmez. Varsayılan ad, ara&ccedil; adına ve girdi katmanı adına dayanır. Detay katmanı zaten varsa ara&ccedil; &ccedil;alışmaz.
            </p>
            <p> ArcGIS Data Store&lsquo;a yazarken (ilişkisel ya da mekan-zamansal b&uuml;y&uuml;k veri deposu)  <b>Sonu&ccedil;ları kaydet</b> a&ccedil;ılır kutusunu kullanarak <b>İ&ccedil;eriğim</b> alanında sonucun kaydedileceği klas&ouml;r adını belirleyebilirsiniz.
            </p>
        </div>
    </div>
</div>
</html>
