<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Laske tiheys</h2><p/>
        <h2><img src="../images/GUID-4EE4838C-E210-43CE-99C7-1A648A18C10B-web.png" alt="Laske tiheys -ty&ouml;kalu"></h2>
        <hr/>
    <p>T&auml;m&auml; ty&ouml;kalu luo tiheyskartan piste- tai viivakohteista jakamalla tietyn ilmi&ouml;n tunnetut m&auml;&auml;r&auml;t (esitet&auml;&auml;n pisteiden ja viivojen ominaisuustietoina) kartan alueelle. Tuloksena syntyy karttataso, jonka alueet on luokiteltu v&auml;hiten tihe&auml;st&auml; tiheimp&auml;&auml;n.
    </p>
    <p>Pistel&auml;ht&ouml;aineiston kunkin pisteen tulee esitt&auml;&auml; jonkin tapahtuman tai tapauksen sijaintia. Tulostaso kuvaa tapausten m&auml;&auml;r&auml;&auml; tietyll&auml; yksik&ouml;n alueella. Suurempi tiheysarvo uudessa sijainnissa tarkoittaa, ett&auml; kyseisen sijainnin l&auml;hell&auml; on enemm&auml;n pisteit&auml;. Useissa tapauksissa tulostasoa voidaan tulkita tulevien tapahtumien riskimallina. Jos pistel&auml;ht&ouml;aineisto esitt&auml;&auml; esimerkiksi salamaniskujen sijainteja, tulostasoa voidaan tulkita tulevien salamaniskujen riskimallina.
    </p>
    <p>Viival&auml;ht&ouml;aineistossa viivojen tiheyspinta kuvaa kunkin sijainnin l&auml;hell&auml; olevien viivojen kokonaism&auml;&auml;r&auml;&auml;. Laskettujen tiheysarvojen yksikk&ouml; on viivan pituus tietyll&auml; yksikk&ouml;alueella. Jos viivat esitt&auml;v&auml;t esimerkiksi jokia, tulostaso kuvaa jokien kokonaispituutta etsint&auml;s&auml;teen alueella. T&auml;m&auml;n tuloksen avulla voidaan tunnistaa alueet, jotka sopivat el&auml;inten laiduntamiseen.
    </p>
    <p>Ty&ouml;kalua voi k&auml;ytt&auml;&auml; my&ouml;s esimerkiksi seuraaviin tarkoituksiin:

        <ul>
            <li>Rikostiheyden karttojen luominen voi auttaa poliisilaitoksia kohdentamaan resurssejaan alueille, joilla rikollisuustaso on korkea.
                
 
            </li>
            <li>Maakunnan sairaaloiden tiheyksien laskeminen. Tulostaso n&auml;ytt&auml;&auml; alueet, joilta sairaalaan p&auml;&auml;sy on helppoa tai vaikeaa. N&auml;it&auml; tietoja voidaan k&auml;ytt&auml;&auml; apuna p&auml;&auml;tett&auml;ess&auml; uusien sairaaloiden sijainneista.
                
 
            </li>
            <li>Mets&auml;paloille alttiiden alueiden tunnistaminen mets&auml;palojen historiallisten sijaintien perusteella.
                
 
            </li>
            <li>Kaukana valtateist&auml; sijaitsevien asutusten paikantaminen suunniteltaessa uusien teiden rakentamista.
                

            </li>
        </ul>
        
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputPointOrLineFeatures">
        <div><h2>Valitse lähtöaineiston piste- tai viivakarttataso, joista tiheys lasketaan</h2></div>
        <hr/>
        <div>
            <p>L&auml;ht&ouml;aineiston piste- tai viivakarttataso, jota k&auml;ytet&auml;&auml;n tiheyskarttatason laskemiseen.
            </p>
        </div>
    </div>
    <div id="countField">
        <div><h2>Käytä määräkenttää</h2></div>
        <hr/>
        <div>
            <p>M&auml;&auml;rit&auml; kentt&auml;, joka osoittaa tapausten m&auml;&auml;r&auml;n kussakin sijainnissa. Jos pisteet esitt&auml;v&auml;t esimerkiksi kaupunkeja, voit k&auml;ytt&auml;&auml; m&auml;&auml;r&auml;kentt&auml;n&auml; kentt&auml;&auml;, joka osoittaa kaupungin asukasluvun. Tuloksena syntyv&auml; v&auml;est&ouml;tiheyden karttataso laskee korkean v&auml;est&ouml;tiheyden asukasluvultaan suurien kaupunkien alueille.
            </p>
            <p>Jos k&auml;yt&auml;t  <b>Ei mit&auml;&auml;n</b> -oletusvalintaa, kunkin sijainnin oletetaan esitt&auml;v&auml;n yht&auml; tapausta.
            </p>
        </div>
    </div>
    <div id="searchDistance">
        <div><h2>Hakuetäisyys</h2></div>
        <hr/>
        <div>
            <p>M&auml;&auml;rit&auml; et&auml;isyys, joka osoittaa, kuinka suurelta alueelta piste- tai viivakohteet haetaan tiheysarvojen laskentaa varten. Jos hakuet&auml;isyydeksi m&auml;&auml;ritet&auml;&auml;n esimerkiksi 10&nbsp;000 metri&auml;, tuloskarttatason kunkin sijainnin tiheys lasketaan 10&nbsp;000 metrin s&auml;teell&auml; sijainnista olevien kohteiden perusteella. Jos yht&auml;&auml;n tapausta ei ole 10&nbsp;000 metrin s&auml;teell&auml; sijainnista, tiheysarvoksi m&auml;&auml;ritet&auml;&auml;n nolla.
            </p>
            <p>Jos et&auml;isyytt&auml; ei m&auml;&auml;ritet&auml;, oletusasetus lasketaan l&auml;ht&ouml;aineiston sijaintien ja m&auml;&auml;r&auml;kent&auml;n arvojen perusteella (jos m&auml;&auml;r&auml;kentt&auml; on m&auml;&auml;ritetty).
            </p>
        </div>
    </div>
    <div id="outputAreaUnits">
        <div><h2>Tulospinta-alan yksiköt</h2></div>
        <hr/>
        <div>
            <p>M&auml;&auml;rit&auml; tulosalueen yksik&ouml;t. Tiheys kuvaa m&auml;&auml;r&auml;&auml; tietty&auml; pinta-alaa kohden. T&auml;m&auml; parametri m&auml;&auml;ritt&auml;&auml; tiheyden laskennassa k&auml;ytett&auml;v&auml;n pinta-alayksik&ouml;n.
            </p>
            <p>K&auml;ytett&auml;viss&auml; olevat pinta-alayksik&ouml;t ovat neli&ouml;mailit, neli&ouml;jalat, neli&ouml;metrit ja neli&ouml;kilometrit.
            </p>
        </div>
    </div>
    <div id="outputCellSize">
        <div><h2>Tulosaineiston solukoko</h2></div>
        <hr/>
        <div>
            <p>Tulosaineiston rasterien solun koko ja yksikk&ouml;.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Tulostason nimi</h2></div>
        <hr/>
        <div>
            <p>Sen karttatason nimi, joka luodaan  <b>Oma sis&auml;lt&ouml;</b> -kohtaan ja lis&auml;t&auml;&auml;n karttaan. Oletusnimi perustuu ty&ouml;kalun nimeen ja l&auml;ht&ouml;karttatason nimeen. Jos taso on jo luotu, sinua pyydet&auml;&auml;n antamaan toinen nimi.
            </p>
            <p>Voit m&auml;&auml;ritt&auml;&auml; kansion nimen  <b>Oma sis&auml;lt&ouml;</b> -osiossa, johon tulos tallennetaan avattavan <b>Tallenna tulos kohteeseen</b> -valikon avulla.
            </p>
        </div>
    </div>
</div>
</html>
