<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="smallsize">
        <h2>Geokoodaa sijainnit taulukosta</h2><p/>
        <h2><img src="../images/GUID-E4194410-7BBF-4349-98C9-22781D35183E-web.png" alt="Geokoodaa sijainnit taulukosta"></h2>
        <hr/>
    <p>Geokoodaus on keino muuntaa osoitteet koordinaateiksi. T&auml;m&auml; ty&ouml;kalu muuntaa taulukon, CSV-tiedoston tai Excel-tiedoston osoitteet kohdekarttatasoksi tai tulosaineistotiedostoksi, jossa koordinaatit ovat lis&auml;sarakkeissa.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputTable">
        <div><h2>Valitse syöteaineistotaulukko</h2></div>
        <hr/>
        <div>
            <p>Geokoodattavat osoitteet sis&auml;lt&auml;v&auml; sy&ouml;teaineistotaulukko. Sy&ouml;teaineiston on oltava taulukko, CSV-tiedosto tai Excel-tiedosto.
            </p>
        </div>
    </div>
    <div id="geocodeServiceURL">
        <div><h2>Valitse paikannin</h2></div>
        <hr/>
        <div>
            <p>Valitse geokoodauksessa k&auml;ytett&auml;v&auml; paikannuspalvelu. Jos paikannuspalvelua, jota haluat k&auml;ytt&auml;&auml;, ei n&auml;y avattavassa valikossa, ota yhteys p&auml;&auml;k&auml;ytt&auml;j&auml;&auml;n ja pyyd&auml; h&auml;nt&auml; m&auml;&auml;ritt&auml;m&auml;&auml;n paikannuspalvelu er&auml;geokoodausta varten.  

            </p>
        </div>
    </div>
    <div id="sourceCountry">
        <div><h2>Maa</h2></div>
        <hr/>
        <div>
            <p>Jos kaikki osoitteesi ovat yhdest&auml; maasta, voit varmistaa mahdollisimman tarkat tulokset valitsemalla kyseisen maan. J&auml;t&auml; muussa tapauksessa t&auml;m&auml; parametri tyhj&auml;ksi.
            </p>
        </div>
    </div>
    <div id="geocodeParameters">
        <div><h2>Valitse aineistokentät</h2></div>
        <hr/>
        <div>
            <p>Paikannuspalvelu edellytt&auml;&auml;, ett&auml; aineisto sis&auml;lt&auml;&auml; tietyt kent&auml;t, kuten osoitteen, kaupungin, osavaltion ja postinumeron. T&auml;sm&auml;yt&auml; sy&ouml;teaineistotiedoston tai -taulukon tietokent&auml;t paikantimen edellytt&auml;miin kenttiin avattavan valikon ruutujen avulla. Mit&auml; useamman kent&auml;n t&auml;sm&auml;yt&auml;t, sit&auml; tarkemmat tulokset saat. Jos sy&ouml;teaineistotaulukon aineisto on yhdess&auml; sarakkeessa, valitse  <b>Yksi kentt&auml;</b> ja valitse tietokentt&auml; avattavasta valikosta. Muussa tapauksessa valitse <b>Useita kentti&auml;</b> ja t&auml;sm&auml;yt&auml; asianmukaiset paikantimen kent&auml;t taulukon useita kentti&auml; sis&auml;lt&auml;viin sarakkeisiin.
            </p>
        </div>
    </div>
    <div id="outputType">
        <div><h2>Valitse tulosaineiston muoto</h2></div>
        <hr/>
        <div>
            <p>Tulosaineiston tulosten muoto. Jos luot kohdepalvelun, sy&ouml;teaineistotaulukon osoitteet lis&auml;t&auml;&auml;n karttaan pistekohteiden karttatasona. CSV- ja XLS-vaihtoehdot lis&auml;&auml;v&auml;t geokoodausty&ouml;n tulosten tiedostot  <b>Oma sis&auml;lt&ouml;</b> -kohtaan, kun ty&ouml; on valmistunut.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Tuloksen nimi</h2></div>
        <hr/>
        <div>
            <p>Sen tason nimi, joka luodaan kohtaan  <b>Oma sis&auml;lt&ouml;</b> ja joka lis&auml;t&auml;&auml;n karttaan. Oletusnimi perustuu ty&ouml;kalun nimeen ja l&auml;ht&ouml;karttatason nimeen. Jos karttatason nimi on jo luotu, sinua pyydet&auml;&auml;n antamaan toinen nimi.
            </p>
            <p>Avattavan  <b>Tallenna tulos kohteeseen</b> -valikon avulla voit m&auml;&auml;ritt&auml;&auml; sen <b>Oma sis&auml;lt&ouml;</b> -kansion nimen, johon tulos tallennetaan.
            </p>
        </div>
    </div>
</div>
</html>
