<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Beregn tetthet</h2><p/>
        <h2><img src="../images/GUID-20E554EC-1F41-4951-99FE-B3FE71DB2E17-web.png" alt="Beregn tetthet"></h2>
        <hr/>
    <p>Beregn Tetthet-verkt&oslash;yet lager et tetthetskart fra punkter eller linjegeoobjekter ved &aring; spre kjente mengder av et fenomen (vises som attributter for punktene eller linjene) over kartet. Resultatet er et lag som best&aring;r av omr&aring;der klassifisert fra minst til h&oslash;yest tetthet.   

    </p>
    <p>For punktinndata b&oslash;r hvert punkt representere plasseringen av en hendelse, og resultatlaget representere en telling av hendelsen per arealenhet. En h&oslash;yere tetthetsverdi p&aring; en ny lokasjon betyr at det er flere punkter n&aelig;r den lokasjonen. I mange tilfeller kan resultatlaget tolkes som en risikoflate for fremtidige hendelser. Hvis inndatapunktene representerer lokasjoner for lynnedslag, kan resultatlaget tolkes som en risikoflate for fremtidige lynnedslag.
    </p>
    <p>For linjeinndataene representerer linjetetthetsflaten det totale antallet linjer som ligger i n&aelig;rheten av hver lokasjon. Enhetene for de beregnede tetthetsverdiene er linjelengden per arealenhet. Hvis linjene f.eks. representerer elver, vil resultatlaget representere den totale lengden p&aring; elvene som er innenfor s&oslash;keradien. Dette resultatet kan brukes til &aring; identifisere omr&aring;der som er egnet til beitedyr.
    </p>
    <p> Andre bruksm&aring;ter av dette verkt&oslash;yet omfatter f&oslash;lgende:
        <ul>
            <li>Opprette kriminalitetstetthetskart for &aring; hjelpe politiet med &aring; fordele ressurser til omr&aring;der med mye kriminalitet.
            </li>
            <li>Beregne tettheten av sykehus innenfor et fylke. Resultatlaget vil vise omr&aring;der med h&oslash;y og lav tilgjengelighet til sykehus, og denne informasjonen kan brukes til &aring; bestemme hvor nye sykehus skal bygges.
            </li>
            <li>Identifisere omr&aring;der som har h&oslash;y risiko for skogbrann p&aring; bakgrunn av p&aring; tidligere skogbranner.
            </li>
            <li>Finne lokalsamfunn som er unna fra de store motorveiene for &aring; planlegge hvor nye veier skal bygges.
            </li>
        </ul>
        
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Velg punkt- eller linjelaget som beregningen av tetthet skal baseres på</h2></div>
        <hr/>
        <div>
            <p>Punkt- eller linjelaget som beregningen av tetthet skal baseres p&aring;.

            </p>
            <p>I tillegg til &aring; velge et lag fra kartet kan du velge  <b>Velg analyselag</b> som du finner nederst i rullegardinlisten. Dette alternativet &aring;pner et galleri der du kan bla til og velge datasett fra ulike kilder som du vil bruke i analysen. 
            </p>
        </div>
    </div>
    <div id="field">
        <div><h2>Bruke et antallfelt</h2></div>
        <hr/>
        <div>
            <p>Ta med et felt som angir antall hendelser p&aring; hvert sted. Hvis du f.eks. har punkter som representerer byer, kan du bruke et felt som representerer befolkningen i byen som antallfelt, og det resulterende befolkningstetthetslaget vil beregne st&oslash;rre befolkningstetthet n&aelig;r byer med st&oslash;rre populasjon.
            </p>
            <p> Hvis standardvalget Ingen blir brukt, vil hver lokasjon antas &aring; representere ett enkelt antall.
            </p>
        </div>
    </div>
    <div id="radius">
        <div><h2>Søkeavstand</h2></div>
        <hr/>
        <div>
            <p>Skriv inn en avstand som angir hvor langt du vil s&oslash;ke &aring; finne punkt- eller linjegeoobjekter ved beregning av tetthetsverdier. Hvis du f.eks. oppgir en s&oslash;keavstand p&aring; 10&nbsp;000 meter, blir tettheten av hvilket som helst sted i utgangslaget beregnet p&aring; bakgrunn av geoobjekter som er innenfor 10&nbsp;000 meter fra lokasjonen. Lokasjoner som ikke har noen hendelser innenfor 10&nbsp;000 meter, vil f&aring; en tetthetsverdi p&aring; null.     

            </p>
            <p>Hvis ingen avstand blir oppgitt, blir det beregnet en standardverdi som er basert p&aring; plasseringene av inndatageoobjektene og verdiene i antallfeltet (hvis det er lagt inn noe antallfelt).
            </p>
        </div>
    </div>
    <div id="boundingPolygonLayer">
        <div><h2>Klipp ut udata til</h2></div>
        <hr/>
        <div>
            <p>Du kan enten tegne eller legge til et lag som angir omr&aring;det du vil at tetthetene skal beregnes for. Hvis du for eksempel beregner tettheten av fisk i en innsj&oslash;, kan du bruke innsj&oslash;ens grense i denne parameteren, og utdataene vil tegnes bare innenfor innsj&oslash;ens grense.
            </p>
        </div>
    </div>
    <div id="classificationType">
        <div><h2>Klassifiser etter</h2></div>
        <hr/>
        <div>
            <p>Velg hvordan tetthetsverdiene skal klassifiseres i omr&aring;der.
                <ul>
                    <li>Like intervall &ndash; Arealene lages slik at rekken av tetthetsverdier er lik for hvert areal.
                    </li>
                    <li>Geometrisk intervall &ndash; Arealene er basert p&aring; klasseintervaller som har en geometrisk serie. Denne metoden sikrer at hver klasseserie har omtrent samme antall verdier innenfor hver klasse, og at endringen mellom intervallene er konsekvent.
                    </li>
                    <li>Naturlige knekkpunkter &ndash; Klasseintervaller for arealer er basert p&aring; naturlige grupperinger av dataene. Det identifiseres klasseknekkverdier som best grupperer lignende verdier, og som fremhever forskjellene mellom klassene.

                    </li>
                    <li>Likt omr&aring;de &ndash; Omr&aring;dene lages slik at st&oslash;rrelsen er lik for hvert omr&aring;de.. Hvis resultatlaget f.eks. har flere h&oslash;ye tetthetsverdier enn lave tetthetsverdier, blir det laget flere arealer for h&oslash;ye tettheter.
                    </li>
                    <li>Standardavvik &ndash; Arealene lages p&aring; bakgrunn av standardavviket for de predikerte tetthetsverdiene. 
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="numClasses">
        <div><h2>Antall klasser</h2></div>
        <hr/>
        <div>
            <p>Angir antall klasser (omr&aring;de med predikerte verdier) i resultatlaget. Hver klasse definerer grenselinjene for arealer. Verdiene av disse klasser avgj&oslash;res av parameteren 
 <b>Klassifiser</b> ovenfor.
            </p>
        </div>
    </div>
    <div id="areaUnits">
        <div><h2>Resulterende arealenheter</h2></div>
        <hr/>
        <div>
            <p>Spesifiser de resulterende arealenhetene. Tetthet er antall delt p&aring; areal, og denne parameteren angir m&aring;leenheten for arealet i beregningen av tetthet.  

            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Navn på resultatlag</h2></div>
        <hr/>
        <div>
            <p>Dette er navnet p&aring; laget som opprettes i  <b>Mitt innhold</b> og legges til kartet. Standardnavnet er basert p&aring; verkt&oslash;ynavnet og navnet p&aring; inndatalaget. Hvis lagnavnet finnes allerede, blir du bedt om &aring; oppgi et annet navn.
            </p>
            <p>Bruk rullegardinmenyen  <b>Lagre resultat i</b> til &aring; angi navnet p&aring; en mappe i <b>Mitt innhold</b> som resultatene skal lagres i.
            </p>
        </div>
    </div>
</div>
</html>
