<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="smallsize">
        <h2>Nettverk for å bestemme optimale reiseutgifter</h2><p/>
        <h2><img src="../images/GUID-097BDD6E-0AD8-44F2-BB70-C5395F4B1AF4-web.png" alt="Illustrasjon av verkt&oslash;yet Nettverk for &aring; bestemme optimale reiseutgifter"></h2>
        <hr/>
    <p>Dette verkt&oslash;yet beregner det optimale kostnadsnettverket fra et sett av inndataregioner.
    </p>
    <p>Et eksempel p&aring; bruksomr&aring;de for dette verkt&oslash;yet er &aring; finne det beste nettverket for utrykningskj&oslash;ret&oslash;yer.
    </p>
    <p>Hvis det er merket av for  <b>Bruk gjeldende kartutstrekning</b>, analyseres bare de lokasjonene i inndatalaget som er synlige innenfor gjeldende kartutstrekning. Hvis det ikke er merket av for dette alternativet, analyseres alle lokasjonene i inndatalaget, selv om de befinner seg utenfor gjeldende kartutstrekning.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputRegionsRasterOrFeatures">
        <div><h2>Velg raster- eller geoobjektslokasjonslaget det skal beregnes reiseruter mellom</h2></div>
        <hr/>
        <div>
            <p>Inndataregionene som skal kobles sammen i nettverket med laveste utgifter.
            </p>
            <p>Regioner kan defineres av en bildetjeneste eller en geoobjektstjeneste.
            </p>
            <p>I en bildetjeneste defineres regionene ved grupper av tilgrensende (n&aelig;rliggende) celler med samme verdi. Hver region m&aring; gis et unikt nummer. Cellene som ikke inng&aring;r i noen region, m&aring; v&aelig;re NoData. Rastertypen m&aring; v&aelig;re heltall, og verdiene kan v&aelig;re enten positive eller negative.
            </p>
            <p>For en geoobjektstjeneste kan inndata v&aelig;re punkt, linje eller polygon.
            </p>
        </div>
    </div>
    <div id="inputCostRaster">
        <div><h2>Velg rasterlag for reiseutgifter</h2></div>
        <hr/>
        <div>
            <p>Et raster som definerer impedans eller kostnad ved planimetrisk bevegelse gjennom hver celle.
            </p>
            <p>Verdien ved hver celleplassering representerer kostnad-per-enhet-avstanden for bevegelse gjennom cellen. Hver celleplasseringsverdi multipliseres med celleoppl&oslash;sningen og kompenserer samtidig for diagonal bevegelse for &aring; finne de totale kostnadene ved &aring; passere gjennom cellen.
            </p>
            <p>Kostnadsrasterets verdier kan v&aelig;re heltall eller flyttall, men de kan ikke v&aelig;re negative tall eller null (du kan ikke ha en negativ eller nullkostnad).
            </p> 
        </div>
    </div>
    <div id="outputOptimumNetworkName">
        <div><h2>Navn på resulterende polylinjelag for optimale ruter</h2></div>
        <hr/>
        <div>
            <p>Navnet p&aring; laget som opprettes i  <b>Mitt innhold</b> og legges til kartet. Standardnavnet er basert p&aring; verkt&oslash;ynavnet og navnet p&aring; inndatalaget. Hvis laget finnes allerede, blir du bedt om &aring; oppgi et annet navn.
            </p>
            <p>Du kan angi navnet p&aring; en mappe i  <b>Mitt innhold</b>, der resultatet blir lagret via rullegardinlisten <b>Lagre resultat i</b>.
            </p>
        </div>
    </div>
    <div id="outputNeighborNetworkName">
        <div><h2>Navn på resulterende polylinjelag for nærliggende ruter</h2></div>
        <hr/>
        <div>
            <p>Navnet p&aring; laget som opprettes i  <b>Mitt innhold</b> og legges til kartet. Standardnavnet er basert p&aring; verkt&oslash;ynavnet og navnet p&aring; inndatalaget. Hvis laget finnes allerede, blir du bedt om &aring; oppgi et annet navn.
            </p>
            <p>Du kan angi navnet p&aring; en mappe i  <b>Mitt innhold</b>, der resultatet blir lagret via rullegardinlisten <b>Lagre resultat i</b>.
            </p>
        </div>
    </div>
</div>
</html>
